ruby/S.org
* [[https://wordsinasentence.com/sagacious-in-a-sentence/][Sagacious]]

  =intelligent; showing good judgement=

  - Wise and full of insight, the sagacious leader would live on to better the world.
  - Many agree that replacing typewriters with computers is a sagacious idea because computers make typing, editing, and proofreading easier.
  - I saw this sagacious dog on television that could add and subtract numbers!
  - It is not very sagacious of you to play with fire.
  - When Jane needs advice, she goes to her sagacious friend.
  - Instead of getting into a petty argument, do the sagacious thing next time and walk away!
  - Because you are sagacious in Algebra, I will come to you with my math questions.


