ruby/S.html
<!DOCTYPE html>
<html>
<head>
<title>S</title>
<!-- 2018-05-15 Tue 18:19 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="Hao Ruan">
<link href="http://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
<link href="../org-html-themes/solarized/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">S</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Sagacious</a></li>
<li><a href="#sec-2">2. Salient</a></li>
<li><a href="#sec-3">3. Salubrious</a></li>
<li><a href="#sec-4">4. Salutary</a></li>
<li><a href="#sec-5">5. Sanguine</a></li>
<li><a href="#sec-6">6. Satiate</a></li>
<li><a href="#sec-7">7. Satirize</a></li>
<li><a href="#sec-8">8. Saturnine</a></li>
<li><a href="#sec-9">9. Scant</a></li>
<li><a href="#sec-10">10. Scavenger</a></li>
<li><a href="#sec-11">11. Schism</a></li>
<li><a href="#sec-12">12. Scour</a></li>
<li><a href="#sec-13">13. Scourge</a></li>
<li><a href="#sec-14">14. Scruples</a></li>
<li><a href="#sec-15">15. Scrupulous</a></li>
<li><a href="#sec-16">16. Sedate</a></li>
<li><a href="#sec-17">17. Seductive</a></li>
<li><a href="#sec-18">18. Sedulous</a></li>
<li><a href="#sec-19">19. Segregate</a></li>
<li><a href="#sec-20">20. Seismic</a></li>
<li><a href="#sec-21">21. Seminal</a></li>
<li><a href="#sec-22">22. Sentient</a></li>
<li><a href="#sec-23">23. Septic</a></li>
<li><a href="#sec-24">24. Sequester</a></li>
<li><a href="#sec-25">25. Serendipity</a></li>
<li><a href="#sec-26">26. Serene</a></li>
<li><a href="#sec-27">27. Serenity</a></li>
<li><a href="#sec-28">28. Serrated</a></li>
<li><a href="#sec-29">29. Servile</a></li>
<li><a href="#sec-30">30. Shrivel</a></li>
<li><a href="#sec-31">31. Shunt</a></li>
<li><a href="#sec-32">32. Sinuous</a></li>
<li><a href="#sec-33">33. Skew</a></li>
<li><a href="#sec-34">34. Skinflint</a></li>
<li><a href="#sec-35">35. Slipshod</a></li>
<li><a href="#sec-36">36. Slovenly</a></li>
<li><a href="#sec-37">37. Sluggish</a></li>
<li><a href="#sec-38">38. Smother</a></li>
<li><a href="#sec-39">39. Smug</a></li>
<li><a href="#sec-40">40. Snub</a></li>
<li><a href="#sec-41">41. Snug</a></li>
<li><a href="#sec-42">42. Solder</a></li>
<li><a href="#sec-43">43. Solicit</a></li>
<li><a href="#sec-44">44. solicitous</a></li>
<li><a href="#sec-45">45. Solicitude</a></li>
<li><a href="#sec-46">46. Soliloquy</a></li>
<li><a href="#sec-47">47. Solvent</a></li>
<li><a href="#sec-48">48. Somber</a></li>
<li><a href="#sec-49">49. Sonorous</a></li>
<li><a href="#sec-50">50. Soothe</a></li>
<li><a href="#sec-51">51. Sophomoric</a></li>
<li><a href="#sec-52">52. Soporific</a></li>
<li><a href="#sec-53">53. Spartan</a></li>
<li><a href="#sec-54">54. Specious</a></li>
<li><a href="#sec-55">55. Sporadic</a></li>
<li><a href="#sec-56">56. Sprawl</a></li>
<li><a href="#sec-57">57. Sprout</a></li>
<li><a href="#sec-58">58. Spruce</a></li>
<li><a href="#sec-59">59. Spurious</a></li>
<li><a href="#sec-60">60. Spurn</a></li>
<li><a href="#sec-61">61. Squalid</a></li>
<li><a href="#sec-62">62. Squander</a></li>
<li><a href="#sec-63">63. Stagnant</a></li>
<li><a href="#sec-64">64. Stalwart</a></li>
<li><a href="#sec-65">65. Stark</a></li>
<li><a href="#sec-66">66. Steadfast</a></li>
<li><a href="#sec-67">67. Stilted</a></li>
<li><a href="#sec-68">68. Stint</a></li>
<li><a href="#sec-69">69. Stipulate</a></li>
<li><a href="#sec-70">70. Stocky</a></li>
<li><a href="#sec-71">71. Stodgy</a></li>
<li><a href="#sec-72">72. Stoic</a></li>
<li><a href="#sec-73">73. Stratagem</a></li>
<li><a href="#sec-74">74. Streak</a></li>
<li><a href="#sec-75">75. Strenuous</a></li>
<li><a href="#sec-76">76. Stringent</a></li>
<li><a href="#sec-77">77. Stronghold</a></li>
<li><a href="#sec-78">78. Stumble</a></li>
<li><a href="#sec-79">79. Stymie</a></li>
<li><a href="#sec-80">80. Subdued</a></li>
<li><a href="#sec-81">81. Subservient</a></li>
<li><a href="#sec-82">82. Subsist</a></li>
<li><a href="#sec-83">83. Subversive</a></li>
<li><a href="#sec-84">84. Subvert</a></li>
<li><a href="#sec-85">85. Succinct</a></li>
<li><a href="#sec-86">86. Succor</a></li>
<li><a href="#sec-87">87. Succumb</a></li>
<li><a href="#sec-88">88. Suffrage</a></li>
<li><a href="#sec-89">89. Sully</a></li>
<li><a href="#sec-90">90. Sultry</a></li>
<li><a href="#sec-91">91. Sumptuous</a></li>
<li><a href="#sec-92">92. Supercilious</a></li>
<li><a href="#sec-93">93. Supplant</a></li>
<li><a href="#sec-94">94. Supple</a></li>
<li><a href="#sec-95">95. Suppliant</a></li>
<li><a href="#sec-96">96. Surly</a></li>
<li><a href="#sec-97">97. Surmount</a></li>
<li><a href="#sec-98">98. Surreptitious</a></li>
<li><a href="#sec-99">99. Surrogate</a></li>
<li><a href="#sec-100">100. Sustain</a></li>
<li><a href="#sec-101">101. Sycophant</a></li>
<li><a href="#sec-102">102. Symbiosis</a></li>
<li><a href="#sec-103">103. Sacrament</a></li>
<li><a href="#sec-104">104. Sacrilege</a></li>
<li><a href="#sec-105">105. Saddle</a></li>
<li><a href="#sec-106">106. Sag</a></li>
<li><a href="#sec-107">107. Salve</a></li>
<li><a href="#sec-108">108. Sangfroid</a></li>
<li><a href="#sec-109">109. Sanity</a></li>
<li><a href="#sec-110">110. Sardonic</a></li>
<li><a href="#sec-111">111. Sartorial</a></li>
<li><a href="#sec-112">112. Sate</a></li>
<li><a href="#sec-113">113. Saucy</a></li>
<li><a href="#sec-114">114. Savvy</a></li>
<li><a href="#sec-115">115. Scabrous</a></li>
<li><a href="#sec-116">116. Scald</a></li>
<li><a href="#sec-117">117. Scamp</a></li>
<li><a href="#sec-118">118. Scamper</a></li>
<li><a href="#sec-119">119. Scintillating</a></li>
<li><a href="#sec-120">120. Scowl</a></li>
<li><a href="#sec-121">121. Scribble</a></li>
<li><a href="#sec-122">122. Scrumptious</a></li>
<li><a href="#sec-123">123. Scurry</a></li>
<li><a href="#sec-124">124. Scurvy</a></li>
<li><a href="#sec-125">125. Scuttle</a></li>
<li><a href="#sec-126">126. Seafaring</a></li>
<li><a href="#sec-127">127. Seam</a></li>
<li><a href="#sec-128">128. Sear</a></li>
<li><a href="#sec-129">129. Secretive</a></li>
<li><a href="#sec-130">130. Seep</a></li>
<li><a href="#sec-131">131. Senile</a></li>
<li><a href="#sec-132">132. Sententious</a></li>
<li><a href="#sec-133">133. Sequacious</a></li>
<li><a href="#sec-134">134. Sere</a></li>
<li><a href="#sec-135">135. Serenade</a></li>
<li><a href="#sec-136">136. Serpentine</a></li>
<li><a href="#sec-137">137. Serried</a></li>
<li><a href="#sec-138">138. Sever</a></li>
<li><a href="#sec-139">139. Shambled</a></li>
<li><a href="#sec-140">140. Sheen</a></li>
<li><a href="#sec-141">141. Shilly shally</a></li>
<li><a href="#sec-142">142. Shoddy</a></li>
<li><a href="#sec-143">143. Shove</a></li>
<li><a href="#sec-144">144. Shriek</a></li>
<li><a href="#sec-145">145. Shudder</a></li>
<li><a href="#sec-146">146. Siege</a></li>
<li><a href="#sec-147">147. Simper</a></li>
<li><a href="#sec-148">148. Singe</a></li>
<li><a href="#sec-149">149. Skim</a></li>
<li><a href="#sec-150">150. Skirt</a></li>
<li><a href="#sec-151">151. Skittish</a></li>
<li><a href="#sec-152">152. Skulduggery</a></li>
<li><a href="#sec-153">153. Slack</a></li>
<li><a href="#sec-154">154. Slake</a></li>
<li><a href="#sec-155">155. Slander</a></li>
<li><a href="#sec-156">156. Slant</a></li>
<li><a href="#sec-157">157. Slay</a></li>
<li><a href="#sec-158">158. Sleight</a></li>
<li><a href="#sec-159">159. Slew</a></li>
<li><a href="#sec-160">160. Slick</a></li>
<li><a href="#sec-161">161. Slog</a></li>
<li><a href="#sec-162">162. Sloppily</a></li>
<li><a href="#sec-163">163. Slosh</a></li>
<li><a href="#sec-164">164. Slovenly</a></li>
<li><a href="#sec-165">165. Slump</a></li>
<li><a href="#sec-166">166. Sly</a></li>
<li><a href="#sec-167">167. Smear</a></li>
<li><a href="#sec-168">168. Smirk</a></li>
<li><a href="#sec-169">169. Smudge</a></li>
<li><a href="#sec-170">170. Snare</a></li>
<li><a href="#sec-171">171. Snarl</a></li>
<li><a href="#sec-172">172. Snatch</a></li>
<li><a href="#sec-173">173. Sneer</a></li>
<li><a href="#sec-174">174. Snicker</a></li>
<li><a href="#sec-175">175. Snip</a></li>
<li><a href="#sec-176">176. Snitch</a></li>
<li><a href="#sec-177">177. Sodden</a></li>
<li><a href="#sec-178">178. Somatic</a></li>
<li><a href="#sec-179">179. Somnolent</a></li>
<li><a href="#sec-180">180. Sorcery</a></li>
<li><a href="#sec-181">181. Spasmodic</a></li>
<li><a href="#sec-182">182. Spat</a></li>
<li><a href="#sec-183">183. Spate</a></li>
<li><a href="#sec-184">184. Spear</a></li>
<li><a href="#sec-185">185. Speck</a></li>
<li><a href="#sec-186">186. Spendthrift</a></li>
<li><a href="#sec-187">187. Spew</a></li>
<li><a href="#sec-188">188. Spiel</a></li>
<li><a href="#sec-189">189. Spindly</a></li>
<li><a href="#sec-190">190. Spite</a></li>
<li><a href="#sec-191">191. Spleen</a></li>
<li><a href="#sec-192">192. Spree</a></li>
<li><a href="#sec-193">193. Squabble</a></li>
<li><a href="#sec-194">194. Squall</a></li>
<li><a href="#sec-195">195. Squalor</a></li>
<li><a href="#sec-196">196. Squeamish</a></li>
<li><a href="#sec-197">197. Squelch</a></li>
<li><a href="#sec-198">198. Squint</a></li>
<li><a href="#sec-199">199. Staid</a></li>
<li><a href="#sec-200">200. Stale</a></li>
<li><a href="#sec-201">201. Stampede</a></li>
<li><a href="#sec-202">202. Stanza</a></li>
<li><a href="#sec-203">203. Stature</a></li>
<li><a href="#sec-204">204. Staunch</a></li>
<li><a href="#sec-205">205. Steep</a></li>
<li><a href="#sec-206">206. Stench</a></li>
<li><a href="#sec-207">207. Stentorian</a></li>
<li><a href="#sec-208">208. Stickler</a></li>
<li><a href="#sec-209">209. Stiff</a></li>
<li><a href="#sec-210">210. Stifling</a></li>
<li><a href="#sec-211">211. Stoked</a></li>
<li><a href="#sec-212">212. Stolid</a></li>
<li><a href="#sec-213">213. Stoop</a></li>
<li><a href="#sec-214">214. Straggle</a></li>
<li><a href="#sec-215">215. Strand</a></li>
<li><a href="#sec-216">216. Strew</a></li>
<li><a href="#sec-217">217. Stricture</a></li>
<li><a href="#sec-218">218. Strident</a></li>
<li><a href="#sec-219">219. Strife</a></li>
<li><a href="#sec-220">220. Strut</a></li>
<li><a href="#sec-221">221. Stultify</a></li>
<li><a href="#sec-222">222. Stunt</a></li>
<li><a href="#sec-223">223. Stupefy</a></li>
<li><a href="#sec-224">224. Stupendous</a></li>
<li><a href="#sec-225">225. Stupor</a></li>
<li><a href="#sec-226">226. Sturdy</a></li>
<li><a href="#sec-227">227. Suavity</a></li>
<li><a href="#sec-228">228. Sublimate</a></li>
<li><a href="#sec-229">229. Suborn</a></li>
<li><a href="#sec-230">230. Subpoena</a></li>
<li><a href="#sec-231">231. Subsume</a></li>
<li><a href="#sec-232">232. Subterfuge</a></li>
<li><a href="#sec-233">233. Sullen</a></li>
<li><a href="#sec-234">234. Sunder</a></li>
<li><a href="#sec-235">235. Sundry</a></li>
<li><a href="#sec-236">236. Supererogatory</a></li>
<li><a href="#sec-237">237. Superimpose</a></li>
<li><a href="#sec-238">238. Superlative</a></li>
<li><a href="#sec-239">239. Supervise</a></li>
<li><a href="#sec-240">240. Supplicate</a></li>
<li><a href="#sec-241">241. Surfeit</a></li>
<li><a href="#sec-242">242. Svelte</a></li>
<li><a href="#sec-243">243. Swagger</a></li>
<li><a href="#sec-244">244. Swank</a></li>
<li><a href="#sec-245">245. Swarthy</a></li>
<li><a href="#sec-246">246. Swathe</a></li>
<li><a href="#sec-247">247. Sway</a></li>
<li><a href="#sec-248">248. Swelter</a></li>
<li><a href="#sec-249">249. Swerve</a></li>
<li><a href="#sec-250">250. Swindle</a></li>
<li><a href="#sec-251">251. Swoop</a></li>
<li><a href="#sec-252">252. Sybaritic</a></li>
<li><a href="#sec-253">253. Synopsis</a></li>
</ul>
</div>
</div>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Sagacious</a></li>
<li><a href="#sec-2">2. Salient</a></li>
<li><a href="#sec-3">3. Salubrious</a></li>
<li><a href="#sec-4">4. Salutary</a></li>
<li><a href="#sec-5">5. Sanguine</a></li>
<li><a href="#sec-6">6. Satiate</a></li>
<li><a href="#sec-7">7. Satirize</a></li>
<li><a href="#sec-8">8. Saturnine</a></li>
<li><a href="#sec-9">9. Scant</a></li>
<li><a href="#sec-10">10. Scavenger</a></li>
<li><a href="#sec-11">11. Schism</a></li>
<li><a href="#sec-12">12. Scour</a></li>
<li><a href="#sec-13">13. Scourge</a></li>
<li><a href="#sec-14">14. Scruples</a></li>
<li><a href="#sec-15">15. Scrupulous</a></li>
<li><a href="#sec-16">16. Sedate</a></li>
<li><a href="#sec-17">17. Seductive</a></li>
<li><a href="#sec-18">18. Sedulous</a></li>
<li><a href="#sec-19">19. Segregate</a></li>
<li><a href="#sec-20">20. Seismic</a></li>
<li><a href="#sec-21">21. Seminal</a></li>
<li><a href="#sec-22">22. Sentient</a></li>
<li><a href="#sec-23">23. Septic</a></li>
<li><a href="#sec-24">24. Sequester</a></li>
<li><a href="#sec-25">25. Serendipity</a></li>
<li><a href="#sec-26">26. Serene</a></li>
<li><a href="#sec-27">27. Serenity</a></li>
<li><a href="#sec-28">28. Serrated</a></li>
<li><a href="#sec-29">29. Servile</a></li>
<li><a href="#sec-30">30. Shrivel</a></li>
<li><a href="#sec-31">31. Shunt</a></li>
<li><a href="#sec-32">32. Sinuous</a></li>
<li><a href="#sec-33">33. Skew</a></li>
<li><a href="#sec-34">34. Skinflint</a></li>
<li><a href="#sec-35">35. Slipshod</a></li>
<li><a href="#sec-36">36. Slovenly</a></li>
<li><a href="#sec-37">37. Sluggish</a></li>
<li><a href="#sec-38">38. Smother</a></li>
<li><a href="#sec-39">39. Smug</a></li>
<li><a href="#sec-40">40. Snub</a></li>
<li><a href="#sec-41">41. Snug</a></li>
<li><a href="#sec-42">42. Solder</a></li>
<li><a href="#sec-43">43. Solicit</a></li>
<li><a href="#sec-44">44. solicitous</a></li>
<li><a href="#sec-45">45. Solicitude</a></li>
<li><a href="#sec-46">46. Soliloquy</a></li>
<li><a href="#sec-47">47. Solvent</a></li>
<li><a href="#sec-48">48. Somber</a></li>
<li><a href="#sec-49">49. Sonorous</a></li>
<li><a href="#sec-50">50. Soothe</a></li>
<li><a href="#sec-51">51. Sophomoric</a></li>
<li><a href="#sec-52">52. Soporific</a></li>
<li><a href="#sec-53">53. Spartan</a></li>
<li><a href="#sec-54">54. Specious</a></li>
<li><a href="#sec-55">55. Sporadic</a></li>
<li><a href="#sec-56">56. Sprawl</a></li>
<li><a href="#sec-57">57. Sprout</a></li>
<li><a href="#sec-58">58. Spruce</a></li>
<li><a href="#sec-59">59. Spurious</a></li>
<li><a href="#sec-60">60. Spurn</a></li>
<li><a href="#sec-61">61. Squalid</a></li>
<li><a href="#sec-62">62. Squander</a></li>
<li><a href="#sec-63">63. Stagnant</a></li>
<li><a href="#sec-64">64. Stalwart</a></li>
<li><a href="#sec-65">65. Stark</a></li>
<li><a href="#sec-66">66. Steadfast</a></li>
<li><a href="#sec-67">67. Stilted</a></li>
<li><a href="#sec-68">68. Stint</a></li>
<li><a href="#sec-69">69. Stipulate</a></li>
<li><a href="#sec-70">70. Stocky</a></li>
<li><a href="#sec-71">71. Stodgy</a></li>
<li><a href="#sec-72">72. Stoic</a></li>
<li><a href="#sec-73">73. Stratagem</a></li>
<li><a href="#sec-74">74. Streak</a></li>
<li><a href="#sec-75">75. Strenuous</a></li>
<li><a href="#sec-76">76. Stringent</a></li>
<li><a href="#sec-77">77. Stronghold</a></li>
<li><a href="#sec-78">78. Stumble</a></li>
<li><a href="#sec-79">79. Stymie</a></li>
<li><a href="#sec-80">80. Subdued</a></li>
<li><a href="#sec-81">81. Subservient</a></li>
<li><a href="#sec-82">82. Subsist</a></li>
<li><a href="#sec-83">83. Subversive</a></li>
<li><a href="#sec-84">84. Subvert</a></li>
<li><a href="#sec-85">85. Succinct</a></li>
<li><a href="#sec-86">86. Succor</a></li>
<li><a href="#sec-87">87. Succumb</a></li>
<li><a href="#sec-88">88. Suffrage</a></li>
<li><a href="#sec-89">89. Sully</a></li>
<li><a href="#sec-90">90. Sultry</a></li>
<li><a href="#sec-91">91. Sumptuous</a></li>
<li><a href="#sec-92">92. Supercilious</a></li>
<li><a href="#sec-93">93. Supplant</a></li>
<li><a href="#sec-94">94. Supple</a></li>
<li><a href="#sec-95">95. Suppliant</a></li>
<li><a href="#sec-96">96. Surly</a></li>
<li><a href="#sec-97">97. Surmount</a></li>
<li><a href="#sec-98">98. Surreptitious</a></li>
<li><a href="#sec-99">99. Surrogate</a></li>
<li><a href="#sec-100">100. Sustain</a></li>
<li><a href="#sec-101">101. Sycophant</a></li>
<li><a href="#sec-102">102. Symbiosis</a></li>
<li><a href="#sec-103">103. Sacrament</a></li>
<li><a href="#sec-104">104. Sacrilege</a></li>
<li><a href="#sec-105">105. Saddle</a></li>
<li><a href="#sec-106">106. Sag</a></li>
<li><a href="#sec-107">107. Salve</a></li>
<li><a href="#sec-108">108. Sangfroid</a></li>
<li><a href="#sec-109">109. Sanity</a></li>
<li><a href="#sec-110">110. Sardonic</a></li>
<li><a href="#sec-111">111. Sartorial</a></li>
<li><a href="#sec-112">112. Sate</a></li>
<li><a href="#sec-113">113. Saucy</a></li>
<li><a href="#sec-114">114. Savvy</a></li>
<li><a href="#sec-115">115. Scabrous</a></li>
<li><a href="#sec-116">116. Scald</a></li>
<li><a href="#sec-117">117. Scamp</a></li>
<li><a href="#sec-118">118. Scamper</a></li>
<li><a href="#sec-119">119. Scintillating</a></li>
<li><a href="#sec-120">120. Scowl</a></li>
<li><a href="#sec-121">121. Scribble</a></li>
<li><a href="#sec-122">122. Scrumptious</a></li>
<li><a href="#sec-123">123. Scurry</a></li>
<li><a href="#sec-124">124. Scurvy</a></li>
<li><a href="#sec-125">125. Scuttle</a></li>
<li><a href="#sec-126">126. Seafaring</a></li>
<li><a href="#sec-127">127. Seam</a></li>
<li><a href="#sec-128">128. Sear</a></li>
<li><a href="#sec-129">129. Secretive</a></li>
<li><a href="#sec-130">130. Seep</a></li>
<li><a href="#sec-131">131. Senile</a></li>
<li><a href="#sec-132">132. Sententious</a></li>
<li><a href="#sec-133">133. Sequacious</a></li>
<li><a href="#sec-134">134. Sere</a></li>
<li><a href="#sec-135">135. Serenade</a></li>
<li><a href="#sec-136">136. Serpentine</a></li>
<li><a href="#sec-137">137. Serried</a></li>
<li><a href="#sec-138">138. Sever</a></li>
<li><a href="#sec-139">139. Shambled</a></li>
<li><a href="#sec-140">140. Sheen</a></li>
<li><a href="#sec-141">141. Shilly shally</a></li>
<li><a href="#sec-142">142. Shoddy</a></li>
<li><a href="#sec-143">143. Shove</a></li>
<li><a href="#sec-144">144. Shriek</a></li>
<li><a href="#sec-145">145. Shudder</a></li>
<li><a href="#sec-146">146. Siege</a></li>
<li><a href="#sec-147">147. Simper</a></li>
<li><a href="#sec-148">148. Singe</a></li>
<li><a href="#sec-149">149. Skim</a></li>
<li><a href="#sec-150">150. Skirt</a></li>
<li><a href="#sec-151">151. Skittish</a></li>
<li><a href="#sec-152">152. Skulduggery</a></li>
<li><a href="#sec-153">153. Slack</a></li>
<li><a href="#sec-154">154. Slake</a></li>
<li><a href="#sec-155">155. Slander</a></li>
<li><a href="#sec-156">156. Slant</a></li>
<li><a href="#sec-157">157. Slay</a></li>
<li><a href="#sec-158">158. Sleight</a></li>
<li><a href="#sec-159">159. Slew</a></li>
<li><a href="#sec-160">160. Slick</a></li>
<li><a href="#sec-161">161. Slog</a></li>
<li><a href="#sec-162">162. Sloppily</a></li>
<li><a href="#sec-163">163. Slosh</a></li>
<li><a href="#sec-164">164. Slovenly</a></li>
<li><a href="#sec-165">165. Slump</a></li>
<li><a href="#sec-166">166. Sly</a></li>
<li><a href="#sec-167">167. Smear</a></li>
<li><a href="#sec-168">168. Smirk</a></li>
<li><a href="#sec-169">169. Smudge</a></li>
<li><a href="#sec-170">170. Snare</a></li>
<li><a href="#sec-171">171. Snarl</a></li>
<li><a href="#sec-172">172. Snatch</a></li>
<li><a href="#sec-173">173. Sneer</a></li>
<li><a href="#sec-174">174. Snicker</a></li>
<li><a href="#sec-175">175. Snip</a></li>
<li><a href="#sec-176">176. Snitch</a></li>
<li><a href="#sec-177">177. Sodden</a></li>
<li><a href="#sec-178">178. Somatic</a></li>
<li><a href="#sec-179">179. Somnolent</a></li>
<li><a href="#sec-180">180. Sorcery</a></li>
<li><a href="#sec-181">181. Spasmodic</a></li>
<li><a href="#sec-182">182. Spat</a></li>
<li><a href="#sec-183">183. Spate</a></li>
<li><a href="#sec-184">184. Spear</a></li>
<li><a href="#sec-185">185. Speck</a></li>
<li><a href="#sec-186">186. Spendthrift</a></li>
<li><a href="#sec-187">187. Spew</a></li>
<li><a href="#sec-188">188. Spiel</a></li>
<li><a href="#sec-189">189. Spindly</a></li>
<li><a href="#sec-190">190. Spite</a></li>
<li><a href="#sec-191">191. Spleen</a></li>
<li><a href="#sec-192">192. Spree</a></li>
<li><a href="#sec-193">193. Squabble</a></li>
<li><a href="#sec-194">194. Squall</a></li>
<li><a href="#sec-195">195. Squalor</a></li>
<li><a href="#sec-196">196. Squeamish</a></li>
<li><a href="#sec-197">197. Squelch</a></li>
<li><a href="#sec-198">198. Squint</a></li>
<li><a href="#sec-199">199. Staid</a></li>
<li><a href="#sec-200">200. Stale</a></li>
<li><a href="#sec-201">201. Stampede</a></li>
<li><a href="#sec-202">202. Stanza</a></li>
<li><a href="#sec-203">203. Stature</a></li>
<li><a href="#sec-204">204. Staunch</a></li>
<li><a href="#sec-205">205. Steep</a></li>
<li><a href="#sec-206">206. Stench</a></li>
<li><a href="#sec-207">207. Stentorian</a></li>
<li><a href="#sec-208">208. Stickler</a></li>
<li><a href="#sec-209">209. Stiff</a></li>
<li><a href="#sec-210">210. Stifling</a></li>
<li><a href="#sec-211">211. Stoked</a></li>
<li><a href="#sec-212">212. Stolid</a></li>
<li><a href="#sec-213">213. Stoop</a></li>
<li><a href="#sec-214">214. Straggle</a></li>
<li><a href="#sec-215">215. Strand</a></li>
<li><a href="#sec-216">216. Strew</a></li>
<li><a href="#sec-217">217. Stricture</a></li>
<li><a href="#sec-218">218. Strident</a></li>
<li><a href="#sec-219">219. Strife</a></li>
<li><a href="#sec-220">220. Strut</a></li>
<li><a href="#sec-221">221. Stultify</a></li>
<li><a href="#sec-222">222. Stunt</a></li>
<li><a href="#sec-223">223. Stupefy</a></li>
<li><a href="#sec-224">224. Stupendous</a></li>
<li><a href="#sec-225">225. Stupor</a></li>
<li><a href="#sec-226">226. Sturdy</a></li>
<li><a href="#sec-227">227. Suavity</a></li>
<li><a href="#sec-228">228. Sublimate</a></li>
<li><a href="#sec-229">229. Suborn</a></li>
<li><a href="#sec-230">230. Subpoena</a></li>
<li><a href="#sec-231">231. Subsume</a></li>
<li><a href="#sec-232">232. Subterfuge</a></li>
<li><a href="#sec-233">233. Sullen</a></li>
<li><a href="#sec-234">234. Sunder</a></li>
<li><a href="#sec-235">235. Sundry</a></li>
<li><a href="#sec-236">236. Supererogatory</a></li>
<li><a href="#sec-237">237. Superimpose</a></li>
<li><a href="#sec-238">238. Superlative</a></li>
<li><a href="#sec-239">239. Supervise</a></li>
<li><a href="#sec-240">240. Supplicate</a></li>
<li><a href="#sec-241">241. Surfeit</a></li>
<li><a href="#sec-242">242. Svelte</a></li>
<li><a href="#sec-243">243. Swagger</a></li>
<li><a href="#sec-244">244. Swank</a></li>
<li><a href="#sec-245">245. Swarthy</a></li>
<li><a href="#sec-246">246. Swathe</a></li>
<li><a href="#sec-247">247. Sway</a></li>
<li><a href="#sec-248">248. Swelter</a></li>
<li><a href="#sec-249">249. Swerve</a></li>
<li><a href="#sec-250">250. Swindle</a></li>
<li><a href="#sec-251">251. Swoop</a></li>
<li><a href="#sec-252">252. Sybaritic</a></li>
<li><a href="#sec-253">253. Synopsis</a></li>
</ul>
</div>
</div>
<div class="outline-2" id="meta">
<table>


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<tbody>
<tr>
<td class="left">Author</td>
<td class="left">Hao Ruan (haoru@cisco.com)</td>
</tr>

<tr>
<td class="left">Date</td>
<td class="left">2018-05-15 18:19:48</td>
</tr>
</tbody>
</table>
<a href="#bottom">⇩</a>
<a id="top"/>
</div>




<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> <a href="https://wordsinasentence.com/sagacious-in-a-sentence/">Sagacious</a></h2>
<div class="outline-text-2" id="text-1">
<p>
<code>intelligent; showing good judgement</code>
</p>

<ul class="org-ul">
<li>Wise and full of insight, the sagacious leader would live on to better the world.
</li>
<li>Many agree that replacing typewriters with computers is a sagacious idea because computers make typing, editing, and proofreading easier.
</li>
<li>I saw this sagacious dog on television that could add and subtract numbers!
</li>
<li>It is not very sagacious of you to play with fire.
</li>
<li>When Jane needs advice, she goes to her sagacious friend.
</li>
<li>Instead of getting into a petty argument, do the sagacious thing next time and walk away!
</li>
<li>Because you are sagacious in Algebra, I will come to you with my math questions.
</li>
</ul>
</div>
</div>
