ruby/S.org
* [[https://wordsinasentence.com/salient-in-a-sentence/][Salient]]

  =most important or prominent=

  - When I look at the house for sale, salient defects such as the broken windows stare back at me.
  - The salient feature on Johnny’s face is his huge nose.
  - As Janet debated which car to buy, she realized price was the most salient factor in her decision.
  - What do you believe is the author’s salient message he wants to convey in his latest novel?
  - Even though Cheryl *had been shaken up* =吓坏了= by the attack, she was still able to give the police a few salient facts about her attacker.
  - The salient feature of the getaway car was its bright orange color.
  - In my religion, the salient belief that stands as the basis of our faith is the death of Christ for our sins.


* [[https://wordsinasentence.com/salubrious-in-a-sentence/][Salubrious]]

  =something that is good for you or is beneficial to mind or body=

  - Vegetables are salubrious foods which provide essential nutrients.
  - While nuts are salubrious on a nutritional level, eating too many of them can cause you to gain unwanted weight.
  - Rumor has it that the spring waters in our community are salubrious and filled with healing oils.
  - Because of his religion, Hiram was a very salubrious eater who ate only vegetables and fruits.
  - In cities where alcohol sales are prohibited, people tend to live longer and have more salubrious lives.
  - Because Elizabeth wanted to stay salubrious, she never missed her yearly physical with her doctor.
  - Although I have a small headache, I feel pretty salubrious for the most part.

* [[https://wordsinasentence.com/salutary-in-a-sentence/][Salutary]]

  =producing good benefits=

  - The board hopes the merger of the two companies will have salutary effects that will leave all the shareholders happy.
  - At the salutary event, the charity easily reached its fundraising goal of one million dollars.
  - In addition to effectively teaching the curriculum, our professor often educates us with salutary lessons that personally enrich our lives.
  -  To Chad, his year of European traveling was a salutary experience because it provided him with new friends and new knowledge.
  - The young mother stopped spanking her son when she realized the punishment did not have a salutary influence on her offspring.
  - Listening to the speaker’s inspirational story was a salutary experience for every person in the room who had ever doubted his or her ability to become successful.
  - If this drug does not have any salutary effects, the drug administration will not approve it for use.


* [[https://wordsinasentence.com/sanguine-in-a-sentence/][Sanguine]]

  =optimistic, hopeful, or confident about the future=

  - Although the economy is looking better, we should still not be too sanguine about the future.
  - You can tell by the big smile on her fact that she has a sanguine temperament!
  - Despite the fact the soldiers have not been home in eight months, they are still sanguine about seeing their families soon.
  - The bank manager did not feel sanguine about recovering the loan.
  - It amazes me how having cancer does not prevent him from being sanguine!
  - Since the doctor had told Sharon she could leave the hospital in two days, she was feeling quite sanguine about her recovery.
  - Matthew was sanguine about his wife taking him back after their short separation.

* [[https://wordsinasentence.com/satiate-in-a-sentence/][Satiate]]

  =to satisfy fully=

  - Hopefully this feast I am preparing will satiate your hunger.
  - When I was pregnant, all it took to satiate my cravings was a chocolate ice cream cone.
  - A trip to the library will satiate Jeremy’s thirst for knowledge.
  - Since I get hungry in between lunch and dinner, I keep snacks on hand to satiate my appetite.
  - After the race, Hank tried to satiate his thirst by drinking two gallons of water.
  - A bottle of milk will normally satiate my baby at night.
  - By baking three cakes for the holiday weekend, I hope to satiate the taste buds of everyone in my family.

* [[https://wordsinasentence.com/satirize-in-a-sentence/][Satirize]]

  =cleverly make fun of something=

  - The poet looked for a way to satirize the boring poem and give it a more humorous appeal.
  - Using humor and irony, the playwright was able to satirize the drama.
  - His ability to satirize the depressing story caused the readers to laugh instead of cry.
  - The playwright set out to satirize his newest work, using exaggerations and funny one-liners in every act.

* [[https://wordsinasentence.com/saturnine-in-a-sentence/][Saturnine]]

  =sad and solemn=

  - The dog’s eyes became saturnine whenever he was left at home alone.
  - As the widow accepted offers of sympathy at her husband’s funeral, she struggled to keep tears from her saturnine eyes.
  - Matt had a saturnine look on his face as he watched his ex-girlfriend walk out the door for the last time.
  - Since Natasha has been ill, she has been in a saturnine mood.


* [[https://wordsinasentence.com/scant-in-a-sentence/][Scant]]

  =a tiny amount=

  - We have to ration the water because we only have a scant amount.
  - Since food provisions were in scant supply, we could only eat once a day.
  - The student didn’t understand the math concept because she paid scant attention during the lecture.
  - Because my salary is scant, I only have a few dollars left after I pay my bills.

* [[https://wordsinasentence.com/scavenger-in-a-sentence/][Scavenger]]

  =someone who scavenges, especially one who searches through rubbish for food or useful things=

  - The vulture is considered a scavenger because it searches for dead prey.
  - I consider myself a bargain scavenger because I am constantly on the lookout for deals.
  - The scavenger dumpster dives, looking for trash to turn into treasure.
  - My dog is a scavenger and is always ready to eat any food that falls to the floor.


