ruby/S.html


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> <a href="https://wordsinasentence.com/salient-in-a-sentence/">Salient</a></h2>
<div class="outline-text-2" id="text-2">
<p>
<code>most important or prominent</code>
</p>

<ul class="org-ul">
<li>When I look at the house for sale, salient defects such as the broken windows stare back at me.
</li>
<li>The salient feature on Johnny’s face is his huge nose.
</li>
<li>As Janet debated which car to buy, she realized price was the most salient factor in her decision.
</li>
<li>What do you believe is the author’s salient message he wants to convey in his latest novel?
</li>
<li>Even though Cheryl <b>had been shaken up</b> <code>吓坏了</code> by the attack, she was still able to give the police a few salient facts about her attacker.
</li>
<li>The salient feature of the getaway car was its bright orange color.
</li>
<li>In my religion, the salient belief that stands as the basis of our faith is the death of Christ for our sins.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> <a href="https://wordsinasentence.com/salubrious-in-a-sentence/">Salubrious</a></h2>
<div class="outline-text-2" id="text-3">
<p>
<code>something that is good for you or is beneficial to mind or body</code>
</p>

<ul class="org-ul">
<li>Vegetables are salubrious foods which provide essential nutrients.
</li>
<li>While nuts are salubrious on a nutritional level, eating too many of them can cause you to gain unwanted weight.
</li>
<li>Rumor has it that the spring waters in our community are salubrious and filled with healing oils.
</li>
<li>Because of his religion, Hiram was a very salubrious eater who ate only vegetables and fruits.
</li>
<li>In cities where alcohol sales are prohibited, people tend to live longer and have more salubrious lives.
</li>
<li>Because Elizabeth wanted to stay salubrious, she never missed her yearly physical with her doctor.
</li>
<li>Although I have a small headache, I feel pretty salubrious for the most part.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> <a href="https://wordsinasentence.com/salutary-in-a-sentence/">Salutary</a></h2>
<div class="outline-text-2" id="text-4">
<p>
<code>producing good benefits</code>
</p>

<ul class="org-ul">
<li>The board hopes the merger of the two companies will have salutary effects that will leave all the shareholders happy.
</li>
<li>At the salutary event, the charity easily reached its fundraising goal of one million dollars.
</li>
<li>In addition to effectively teaching the curriculum, our professor often educates us with salutary lessons that personally enrich our lives.
</li>
<li>To Chad, his year of European traveling was a salutary experience because it provided him with new friends and new knowledge.
</li>
<li>The young mother stopped spanking her son when she realized the punishment did not have a salutary influence on her offspring.
</li>
<li>Listening to the speaker’s inspirational story was a salutary experience for every person in the room who had ever doubted his or her ability to become successful.
</li>
<li>If this drug does not have any salutary effects, the drug administration will not approve it for use.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> <a href="https://wordsinasentence.com/sanguine-in-a-sentence/">Sanguine</a></h2>
<div class="outline-text-2" id="text-5">
<p>
<code>optimistic, hopeful, or confident about the future</code>
</p>

<ul class="org-ul">
<li>Although the economy is looking better, we should still not be too sanguine about the future.
</li>
<li>You can tell by the big smile on her fact that she has a sanguine temperament!
</li>
<li>Despite the fact the soldiers have not been home in eight months, they are still sanguine about seeing their families soon.
</li>
<li>The bank manager did not feel sanguine about recovering the loan.
</li>
<li>It amazes me how having cancer does not prevent him from being sanguine!
</li>
<li>Since the doctor had told Sharon she could leave the hospital in two days, she was feeling quite sanguine about her recovery.
</li>
<li>Matthew was sanguine about his wife taking him back after their short separation.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> <a href="https://wordsinasentence.com/satiate-in-a-sentence/">Satiate</a></h2>
<div class="outline-text-2" id="text-6">
<p>
<code>to satisfy fully</code>
</p>

<ul class="org-ul">
<li>Hopefully this feast I am preparing will satiate your hunger.
</li>
<li>When I was pregnant, all it took to satiate my cravings was a chocolate ice cream cone.
</li>
<li>A trip to the library will satiate Jeremy’s thirst for knowledge.
</li>
<li>Since I get hungry in between lunch and dinner, I keep snacks on hand to satiate my appetite.
</li>
<li>After the race, Hank tried to satiate his thirst by drinking two gallons of water.
</li>
<li>A bottle of milk will normally satiate my baby at night.
</li>
<li>By baking three cakes for the holiday weekend, I hope to satiate the taste buds of everyone in my family.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> <a href="https://wordsinasentence.com/satirize-in-a-sentence/">Satirize</a></h2>
<div class="outline-text-2" id="text-7">
<p>
<code>cleverly make fun of something</code>
</p>

<ul class="org-ul">
<li>The poet looked for a way to satirize the boring poem and give it a more humorous appeal.
</li>
<li>Using humor and irony, the playwright was able to satirize the drama.
</li>
<li>His ability to satirize the depressing story caused the readers to laugh instead of cry.
</li>
<li>The playwright set out to satirize his newest work, using exaggerations and funny one-liners in every act.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> <a href="https://wordsinasentence.com/saturnine-in-a-sentence/">Saturnine</a></h2>
<div class="outline-text-2" id="text-8">
<p>
<code>sad and solemn</code>
</p>

<ul class="org-ul">
<li>The dog’s eyes became saturnine whenever he was left at home alone.
</li>
<li>As the widow accepted offers of sympathy at her husband’s funeral, she struggled to keep tears from her saturnine eyes.
</li>
<li>Matt had a saturnine look on his face as he watched his ex-girlfriend walk out the door for the last time.
</li>
<li>Since Natasha has been ill, she has been in a saturnine mood.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> <a href="https://wordsinasentence.com/scant-in-a-sentence/">Scant</a></h2>
<div class="outline-text-2" id="text-9">
<p>
<code>a tiny amount</code>
</p>

<ul class="org-ul">
<li>We have to ration the water because we only have a scant amount.
</li>
<li>Since food provisions were in scant supply, we could only eat once a day.
</li>
<li>The student didn’t understand the math concept because she paid scant attention during the lecture.
</li>
<li>Because my salary is scant, I only have a few dollars left after I pay my bills.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> <a href="https://wordsinasentence.com/scavenger-in-a-sentence/">Scavenger</a></h2>
<div class="outline-text-2" id="text-10">
<p>
<code>someone who scavenges, especially one who searches through rubbish for food or useful things</code>
</p>

<ul class="org-ul">
<li>The vulture is considered a scavenger because it searches for dead prey.
</li>
<li>I consider myself a bargain scavenger because I am constantly on the lookout for deals.
</li>
<li>The scavenger dumpster dives, looking for trash to turn into treasure.
</li>
<li>My dog is a scavenger and is always ready to eat any food that falls to the floor.
</li>
</ul>
</div>
</div>
