ruby/S.org
* [[https://wordsinasentence.com/schism-in-a-sentence/][Schism]]

  =a split or separation within a group or organization=

  - The schism between my two best friends put me in the awkward position of having to choose one over the other.
  - In the United States, the schism caused by slavery eventually led to the Civil War.
  - Because of the schism that has divided the football players, our high school team will not play a game this week.
  - As a result of the schism within the church, many clergy members are confused between which of the two sects to join.
  - The schism that divided the nation into two separate countries was caused by religious differences.
  - A century ago, a severe schism occurred within the Lutheran church and split the religion into two different branches.
  - Once my parents realized their schism was destroying our household, they decided to end their marriage and go their separate ways.

* [[https://wordsinasentence.com/scour-in-a-sentence/][Scour]]

  =to scrub hard=

  - My mother made us scour the bathroom before our guests arrived.
  - After I spilled ketchup on my white shirt, I took it to the bathroom to scour it with cold water.
  - Our punishment was to scour the graffiti off of school property.
  - Every time the dog tracked mud inside the house, my mother would scour the dirt.

* [[https://wordsinasentence.com/scourge-in-a-sentence/][Scourge]]

  =a persistent pest, illness, or source of trouble=

  - For several years, the drug violence in the border city was such a scourge on the population that it was named the murder capital of the world.
  - From AIDS, to cancer, to Alzheimer’s, medical research is always trying to find a cure for the latest scourge on human health.
  - Although I love to see the butterflies fluttering around my flowers, the caterpillars that they come from are a scourge on my garden.
  - Although the scourge of crime in the neighborhood continues to get worse, most of the residents are older people who can’t afford to move.
  - From the way that Ali was ranting about how men were the scourge of the universe, I guessed that she must have broken up with her latest boyfriend.
  - Montezuma’s Revenge is the quaint nickname for the intestinal scourge that many travelers suffer after they drink the water in some Latin countries.
  - Cameron would always look back on this winter and remember the scourge of blizzards and ice storms that kept him a virtual prisoner in his own home.



* [[https://wordsinasentence.com/scruples-in-a-sentence/][Scruples]]

  =internal factors that prevent a person from behaving in a certain manner=

  - Janet has no scruples about mistreating people who mistreat her.
  - Although Alan would like to participate in the challenge, his religious scruples will not allow him to participate in a drinking event.
  - Many individuals will ignore their scruples for the right price.
  - Because Sylvester is a *mercenary*, he has no scruples about killing someone for money.
  - Marshall’s religious scruples would not allow him to get a much-needed *blood transfusion*.
  - Since the swindler had no scruples, he was not concerned about selling the old woman a worthless life insurance policy.
  - My teenage daughter likes to joke and say her moral scruples prohibit her from doing chores.

* [[https://wordsinasentence.com/scrupulous-in-a-sentence/][Scrupulous]]

  =very careful about doing something correctly=

  - Will is a scrupulous employee who always checks his work for accuracy.
  - Because Shannon is a scrupulous editor, she never misses errors when she proofreads a document.
  - Scrupulous landscapers are careful to only destroy weeds and not the beautiful vegetation.
  - Although Margaret tries to be a scrupulous cleaner, she sometimes forgets to dust off the bookshelves.
  - Josh is a scrupulous dancer who will practice a step repeatedly until he can make the motion effortlessly.
  - As a surgeon, my husband has to be very scrupulous when he is performing life-saving operations.
  - Most detectives are scrupulous individuals who do not let small details escape their notice.

* [[https://wordsinasentence.com/sedate-in-a-sentence/][Sedate]]

  =to soothe or calm=

  - The shot should sedate the patient and allow him to sleep peacefully.
  - When my baby is upset, I can usually sedate her by *patting her back*.
  - The only way to sedate the hostile dog was by putting him to sleep with a tranquilizer.
  - During an anxiety attack, you can sometimes sedate yourself by breathing slowly.


* [[https://wordsinasentence.com/seductive-in-a-sentence/][Seductive]]

  =tempting; alluring=

  - Seductive plates full of scrumptious shrimp and mouthwatering steak made the guests mouth water.
  - Seductive *blobs of color* drew the woman’s eyes to the most fascinating painting in the gallery.
  - Singing in a cool and seductive voice, Marilyn Monroe attracted every man in the room.
  - Low indoor lighting combined with candles and seductive music set the mood for a romantic weekend.

* [[https://wordsinasentence.com/sedulous-in-a-sentence/][Sedulous]]

  =diligent, hard working and persistent=

  - Even though you completely destroy the ant bed time after time, those sedulous ants will continue to go right back to work rebuilding it.
  - Although she told him that she was already in a relationship with someone, Ethan refused to abandon his sedulous efforts to get a date with Felicia.
  - Because he is a sedulous worker who is always on the lookout for new prospects, Garrison has been Salesman of the Year for six years in a row.
  - This antique table is constructed with sedulous workmanship and an attention to detail that you just don’t find in today’s manufactured furniture.
  - Although mules are stereotyped as stubborn creatures, they are actually sedulous animals who work tirelessly in almost any situation.
  - Harrison is constantly boasting about his sedulous assistant who keeps the office running smoothly.
  - Isabel has a sedulous routine of putting on her makeup every day because she is obsessed with making a glamorous impression.

* [[https://wordsinasentence.com/segregate-in-a-sentence/][Segregate]]

  =to place apart because of real or perceived differences=

  - Airlines segregate passengers into economy and first class so they can charge higher ticket prices for premium seats.
  - To preserve order inside the prison, the warden will segregate rival gang members from each other.
  - Most schools segregate students according to their academic abilities.
  - At the veterinarian’s office, two waiting areas are used to segregate the well animals from the sick animals.

