ruby/S.html


<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> <a href="https://wordsinasentence.com/schism-in-a-sentence/">Schism</a></h2>
<div class="outline-text-2" id="text-11">
<p>
<code>a split or separation within a group or organization</code>
</p>

<ul class="org-ul">
<li>The schism between my two best friends put me in the awkward position of having to choose one over the other.
</li>
<li>In the United States, the schism caused by slavery eventually led to the Civil War.
</li>
<li>Because of the schism that has divided the football players, our high school team will not play a game this week.
</li>
<li>As a result of the schism within the church, many clergy members are confused between which of the two sects to join.
</li>
<li>The schism that divided the nation into two separate countries was caused by religious differences.
</li>
<li>A century ago, a severe schism occurred within the Lutheran church and split the religion into two different branches.
</li>
<li>Once my parents realized their schism was destroying our household, they decided to end their marriage and go their separate ways.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> <a href="https://wordsinasentence.com/scour-in-a-sentence/">Scour</a></h2>
<div class="outline-text-2" id="text-12">
<p>
<code>to scrub hard</code>
</p>

<ul class="org-ul">
<li>My mother made us scour the bathroom before our guests arrived.
</li>
<li>After I spilled ketchup on my white shirt, I took it to the bathroom to scour it with cold water.
</li>
<li>Our punishment was to scour the graffiti off of school property.
</li>
<li>Every time the dog tracked mud inside the house, my mother would scour the dirt.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> <a href="https://wordsinasentence.com/scourge-in-a-sentence/">Scourge</a></h2>
<div class="outline-text-2" id="text-13">
<p>
<code>a persistent pest, illness, or source of trouble</code>
</p>

<ul class="org-ul">
<li>For several years, the drug violence in the border city was such a scourge on the population that it was named the murder capital of the world.
</li>
<li>From AIDS, to cancer, to Alzheimer’s, medical research is always trying to find a cure for the latest scourge on human health.
</li>
<li>Although I love to see the butterflies fluttering around my flowers, the caterpillars that they come from are a scourge on my garden.
</li>
<li>Although the scourge of crime in the neighborhood continues to get worse, most of the residents are older people who can’t afford to move.
</li>
<li>From the way that Ali was ranting about how men were the scourge of the universe, I guessed that she must have broken up with her latest boyfriend.
</li>
<li>Montezuma’s Revenge is the quaint nickname for the intestinal scourge that many travelers suffer after they drink the water in some Latin countries.
</li>
<li>Cameron would always look back on this winter and remember the scourge of blizzards and ice storms that kept him a virtual prisoner in his own home.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-14" class="outline-2">
<h2 id="sec-14"><span class="section-number-2">14</span> <a href="https://wordsinasentence.com/scruples-in-a-sentence/">Scruples</a></h2>
<div class="outline-text-2" id="text-14">
<p>
<code>internal factors that prevent a person from behaving in a certain manner</code>
</p>

<ul class="org-ul">
<li>Janet has no scruples about mistreating people who mistreat her.
</li>
<li>Although Alan would like to participate in the challenge, his religious scruples will not allow him to participate in a drinking event.
</li>
<li>Many individuals will ignore their scruples for the right price.
</li>
<li>Because Sylvester is a <b>mercenary</b>, he has no scruples about killing someone for money.
</li>
<li>Marshall’s religious scruples would not allow him to get a much-needed <b>blood transfusion</b>.
</li>
<li>Since the swindler had no scruples, he was not concerned about selling the old woman a worthless life insurance policy.
</li>
<li>My teenage daughter likes to joke and say her moral scruples prohibit her from doing chores.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-15" class="outline-2">
<h2 id="sec-15"><span class="section-number-2">15</span> <a href="https://wordsinasentence.com/scrupulous-in-a-sentence/">Scrupulous</a></h2>
<div class="outline-text-2" id="text-15">
<p>
<code>very careful about doing something correctly</code>
</p>

<ul class="org-ul">
<li>Will is a scrupulous employee who always checks his work for accuracy.
</li>
<li>Because Shannon is a scrupulous editor, she never misses errors when she proofreads a document.
</li>
<li>Scrupulous landscapers are careful to only destroy weeds and not the beautiful vegetation.
</li>
<li>Although Margaret tries to be a scrupulous cleaner, she sometimes forgets to dust off the bookshelves.
</li>
<li>Josh is a scrupulous dancer who will practice a step repeatedly until he can make the motion effortlessly.
</li>
<li>As a surgeon, my husband has to be very scrupulous when he is performing life-saving operations.
</li>
<li>Most detectives are scrupulous individuals who do not let small details escape their notice.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-16" class="outline-2">
<h2 id="sec-16"><span class="section-number-2">16</span> <a href="https://wordsinasentence.com/sedate-in-a-sentence/">Sedate</a></h2>
<div class="outline-text-2" id="text-16">
<p>
<code>to soothe or calm</code>
</p>

<ul class="org-ul">
<li>The shot should sedate the patient and allow him to sleep peacefully.
</li>
<li>When my baby is upset, I can usually sedate her by <b>patting her back</b>.
</li>
<li>The only way to sedate the hostile dog was by putting him to sleep with a tranquilizer.
</li>
<li>During an anxiety attack, you can sometimes sedate yourself by breathing slowly.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-17" class="outline-2">
<h2 id="sec-17"><span class="section-number-2">17</span> <a href="https://wordsinasentence.com/seductive-in-a-sentence/">Seductive</a></h2>
<div class="outline-text-2" id="text-17">
<p>
<code>tempting; alluring</code>
</p>

<ul class="org-ul">
<li>Seductive plates full of scrumptious shrimp and mouthwatering steak made the guests mouth water.
</li>
<li>Seductive <b>blobs of color</b> drew the woman’s eyes to the most fascinating painting in the gallery.
</li>
<li>Singing in a cool and seductive voice, Marilyn Monroe attracted every man in the room.
</li>
<li>Low indoor lighting combined with candles and seductive music set the mood for a romantic weekend.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-18" class="outline-2">
<h2 id="sec-18"><span class="section-number-2">18</span> <a href="https://wordsinasentence.com/sedulous-in-a-sentence/">Sedulous</a></h2>
<div class="outline-text-2" id="text-18">
<p>
<code>diligent, hard working and persistent</code>
</p>

<ul class="org-ul">
<li>Even though you completely destroy the ant bed time after time, those sedulous ants will continue to go right back to work rebuilding it.
</li>
<li>Although she told him that she was already in a relationship with someone, Ethan refused to abandon his sedulous efforts to get a date with Felicia.
</li>
<li>Because he is a sedulous worker who is always on the lookout for new prospects, Garrison has been Salesman of the Year for six years in a row.
</li>
<li>This antique table is constructed with sedulous workmanship and an attention to detail that you just don’t find in today’s manufactured furniture.
</li>
<li>Although mules are stereotyped as stubborn creatures, they are actually sedulous animals who work tirelessly in almost any situation.
</li>
<li>Harrison is constantly boasting about his sedulous assistant who keeps the office running smoothly.
</li>
<li>Isabel has a sedulous routine of putting on her makeup every day because she is obsessed with making a glamorous impression.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-19" class="outline-2">
<h2 id="sec-19"><span class="section-number-2">19</span> <a href="https://wordsinasentence.com/segregate-in-a-sentence/">Segregate</a></h2>
<div class="outline-text-2" id="text-19">
<p>
<code>to place apart because of real or perceived differences</code>
</p>

<ul class="org-ul">
<li>Airlines segregate passengers into economy and first class so they can charge higher ticket prices for premium seats.
</li>
<li>To preserve order inside the prison, the warden will segregate rival gang members from each other.
</li>
<li>Most schools segregate students according to their academic abilities.
</li>
<li>At the veterinarian’s office, two waiting areas are used to segregate the well animals from the sick animals.
</li>
</ul>
</div>
</div>
