ruby/S.org
* [[https://wordsinasentence.com/seismic-in-a-sentence/][Seismic]]

  =Caused by or related to an earthquake=

  - Seismic tests were conducted to determine the force of the earthquake.
  - Seismic waves caused by the earthquake caused a tsunami on the island shore.
  - Conducting hi-tech seismic surveys, the scientists were able to predict an upcoming quake.
  - Buildings hit by seismic waves were not able to withstand the trembling surfs.

* [[https://wordsinasentence.com/seminal-in-a-sentence/][Seminal]]

  =important and highly influential on later developments=

  - His award-winning performance was a seminal event for the college.
  - Newton’s laws are seminal in the field of physics.
  - Steve Jobs’ inventions were seminal in the world of technology.
  - We attended a conference where seminal ideas for future scenarios were introduced.

* [[https://wordsinasentence.com/sentient-in-a-sentence/][Sentient]]

  =being able to feel or sense things=

  - Humans are not the only sentient beings, elephants are very emotional and perceptive mammals as well.
  - For many years, scientists argued over whether corals were sentient creatures or were an inanimate object like a rock.
  - Many people believe plants to be sentient and responsive to things such as music and the human voice.
  - Because it barely moves, people do not see the snail as a very sentient and conscious animal.

* [[https://wordsinasentence.com/septic-in-a-sentence/][Septic]]

  =infected or contaminated with disease-causing organisms=

  - After the wound became septic, it started oozing *pus* =脓= and turned green.
  - When working with a septic system, the workers wear suits to protect themselves from contaminants in the sewage.
  - You should wash and cover your wound to prevent it from becoming septic.
  - The doctor prescribed an antibiotic to cure my septic throat.

* [[https://wordsinasentence.com/sequester-in-a-sentence/][Sequester]]

  =to be put away for a specific reason=

  - The people with the virus were told to sequester themselves at home to avoid spreading the illness.
  - If the verdict is not decided the first day, the judge will sequester the jury members to protect them from external influences.
  - The writer decided to sequester himself in an isolated cabin so he could finish his novel without interruptions.
  - In an attempt to break his own videogame record, Daniel chose to sequester himself in his bedroom for an entire weekend.
  - The judge ordered detectives to sequester the witness in a safe house.
  - To prevent poisoning accidents, many parents sequester medications in a locked cabinet.
  - The single mother was upset when she learned the judge planned to sequester the jury away from their families.

* [[https://wordsinasentence.com/serendipity-in-a-sentence/][Serendipity]]

  =the fact of finding pleasant or useful things by chance=

  - The lottery is something one wins by serendipity not by design.
  - When it comes to capturing the perfect picture, it is all about serendipity.
  - The paparazzi relied on serendipity to figure out which hotel entrance the celebrity would use.
  - Although Jeremiah is known for being unlucky, he did once have the serendipity of being chosen as one of the city’s most exciting young people.
  - It was by serendipity that I found a hundred dollar bill on the sidewalk.
  - By serendipity, I was fortunate enough to get two tickets to a sold out conference.
  - When I ran into my first love on a singles cruise, I knew it was serendipity at work.

* [[https://wordsinasentence.com/serene-in-a-sentence/][Serene]]

  =calm; peaceful=

  - The quiet beach made a serene setting for the midnight wedding.
  - While James is usually upset about something, his wife has a serene personality and is incredibly laid-back.
  - Danielle sleeps best in a serene environment.
  - During the test, I tried to remain serene so I would not get nervous and make careless mistakes.
  - Taking yoga classes helps me remain serene.
  - When Mabel went to the doctor, she received an anxiety medication to help her stay serene.
  - Standing in front of the waterfall, the bride and groom made a serene picture.

* [[https://wordsinasentence.com/serenity-in-a-sentence/][Serenity]]

  =untroubled, calm, and peaceful=

  - For the outdoorsman, there is no way to experience serenity better than enjoying nature.
  - The beautiful garden filled him with a sense of serenity.
  - For an introvert, it is difficult to experience serenity in a large crowd.
  - Many individuals find that yoga is a great way to experience serenity.
  - The monk had attained a peaceful serenity, completely unaffected by the troubles around him.
  - Serenity is often sought after but in the busy bustle of city life it is rarely found.
  - A thrill-seeker would much prefer constant chaos than complete serenity.

* [[https://wordsinasentence.com/serrated-in-a-sentence/][Serrated]]

  =having a row of sharp or tooth-like projections=

  - A serrated knife allowed the chef to saw the bread into slices.
  - In order to cut the steaks, each dish included a serrated knife.
  - The serrated edge of a knife proved more dangerous to cut food due to its toothed side.
  - The difference between the two knife sets is that the first set contained a serrated knife to cut bread and meats.

* [[https://wordsinasentence.com/servile-in-a-sentence/][Servile]]

  =submissive; willing to serve others=

  - Some individuals are so servile that other people take advantage of their submissiveness.
  - Because she has a servile *disposition* =性情=, Janet is a great nurse.
  - Even though Michelle was no longer a maid, she still felt servile when she was in a room with wealthy people.
  - Wives do not exist simply to be servile and to do their husbands’ *bidding* =吩咐=.
  - Since you pay me, I am willing to work for you and be servile from the hours of nine to five each day.
  - A diehard *people pleaser* =讨好者=, Justine is servile by nature.
  - Because the billionaire’s personal assistant wants to keep her job, she always speaks to her boss in a servile tone.

