ruby/S.html

<div id="outline-container-sec-20" class="outline-2">
<h2 id="sec-20"><span class="section-number-2">20</span> <a href="https://wordsinasentence.com/seismic-in-a-sentence/">Seismic</a></h2>
<div class="outline-text-2" id="text-20">
<p>
<code>Caused by or related to an earthquake</code>
</p>

<ul class="org-ul">
<li>Seismic tests were conducted to determine the force of the earthquake.
</li>
<li>Seismic waves caused by the earthquake caused a tsunami on the island shore.
</li>
<li>Conducting hi-tech seismic surveys, the scientists were able to predict an upcoming quake.
</li>
<li>Buildings hit by seismic waves were not able to withstand the trembling surfs.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-21" class="outline-2">
<h2 id="sec-21"><span class="section-number-2">21</span> <a href="https://wordsinasentence.com/seminal-in-a-sentence/">Seminal</a></h2>
<div class="outline-text-2" id="text-21">
<p>
<code>important and highly influential on later developments</code>
</p>

<ul class="org-ul">
<li>His award-winning performance was a seminal event for the college.
</li>
<li>Newton’s laws are seminal in the field of physics.
</li>
<li>Steve Jobs’ inventions were seminal in the world of technology.
</li>
<li>We attended a conference where seminal ideas for future scenarios were introduced.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-22" class="outline-2">
<h2 id="sec-22"><span class="section-number-2">22</span> <a href="https://wordsinasentence.com/sentient-in-a-sentence/">Sentient</a></h2>
<div class="outline-text-2" id="text-22">
<p>
<code>being able to feel or sense things</code>
</p>

<ul class="org-ul">
<li>Humans are not the only sentient beings, elephants are very emotional and perceptive mammals as well.
</li>
<li>For many years, scientists argued over whether corals were sentient creatures or were an inanimate object like a rock.
</li>
<li>Many people believe plants to be sentient and responsive to things such as music and the human voice.
</li>
<li>Because it barely moves, people do not see the snail as a very sentient and conscious animal.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-23" class="outline-2">
<h2 id="sec-23"><span class="section-number-2">23</span> <a href="https://wordsinasentence.com/septic-in-a-sentence/">Septic</a></h2>
<div class="outline-text-2" id="text-23">
<p>
<code>infected or contaminated with disease-causing organisms</code>
</p>

<ul class="org-ul">
<li>After the wound became septic, it started oozing <b>pus</b> <code>脓</code> and turned green.
</li>
<li>When working with a septic system, the workers wear suits to protect themselves from contaminants in the sewage.
</li>
<li>You should wash and cover your wound to prevent it from becoming septic.
</li>
<li>The doctor prescribed an antibiotic to cure my septic throat.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-24" class="outline-2">
<h2 id="sec-24"><span class="section-number-2">24</span> <a href="https://wordsinasentence.com/sequester-in-a-sentence/">Sequester</a></h2>
<div class="outline-text-2" id="text-24">
<p>
<code>to be put away for a specific reason</code>
</p>

<ul class="org-ul">
<li>The people with the virus were told to sequester themselves at home to avoid spreading the illness.
</li>
<li>If the verdict is not decided the first day, the judge will sequester the jury members to protect them from external influences.
</li>
<li>The writer decided to sequester himself in an isolated cabin so he could finish his novel without interruptions.
</li>
<li>In an attempt to break his own videogame record, Daniel chose to sequester himself in his bedroom for an entire weekend.
</li>
<li>The judge ordered detectives to sequester the witness in a safe house.
</li>
<li>To prevent poisoning accidents, many parents sequester medications in a locked cabinet.
</li>
<li>The single mother was upset when she learned the judge planned to sequester the jury away from their families.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-25" class="outline-2">
<h2 id="sec-25"><span class="section-number-2">25</span> <a href="https://wordsinasentence.com/serendipity-in-a-sentence/">Serendipity</a></h2>
<div class="outline-text-2" id="text-25">
<p>
<code>the fact of finding pleasant or useful things by chance</code>
</p>

<ul class="org-ul">
<li>The lottery is something one wins by serendipity not by design.
</li>
<li>When it comes to capturing the perfect picture, it is all about serendipity.
</li>
<li>The paparazzi relied on serendipity to figure out which hotel entrance the celebrity would use.
</li>
<li>Although Jeremiah is known for being unlucky, he did once have the serendipity of being chosen as one of the city’s most exciting young people.
</li>
<li>It was by serendipity that I found a hundred dollar bill on the sidewalk.
</li>
<li>By serendipity, I was fortunate enough to get two tickets to a sold out conference.
</li>
<li>When I ran into my first love on a singles cruise, I knew it was serendipity at work.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-26" class="outline-2">
<h2 id="sec-26"><span class="section-number-2">26</span> <a href="https://wordsinasentence.com/serene-in-a-sentence/">Serene</a></h2>
<div class="outline-text-2" id="text-26">
<p>
<code>calm; peaceful</code>
</p>

<ul class="org-ul">
<li>The quiet beach made a serene setting for the midnight wedding.
</li>
<li>While James is usually upset about something, his wife has a serene personality and is incredibly laid-back.
</li>
<li>Danielle sleeps best in a serene environment.
</li>
<li>During the test, I tried to remain serene so I would not get nervous and make careless mistakes.
</li>
<li>Taking yoga classes helps me remain serene.
</li>
<li>When Mabel went to the doctor, she received an anxiety medication to help her stay serene.
</li>
<li>Standing in front of the waterfall, the bride and groom made a serene picture.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-27" class="outline-2">
<h2 id="sec-27"><span class="section-number-2">27</span> <a href="https://wordsinasentence.com/serenity-in-a-sentence/">Serenity</a></h2>
<div class="outline-text-2" id="text-27">
<p>
<code>untroubled, calm, and peaceful</code>
</p>

<ul class="org-ul">
<li>For the outdoorsman, there is no way to experience serenity better than enjoying nature.
</li>
<li>The beautiful garden filled him with a sense of serenity.
</li>
<li>For an introvert, it is difficult to experience serenity in a large crowd.
</li>
<li>Many individuals find that yoga is a great way to experience serenity.
</li>
<li>The monk had attained a peaceful serenity, completely unaffected by the troubles around him.
</li>
<li>Serenity is often sought after but in the busy bustle of city life it is rarely found.
</li>
<li>A thrill-seeker would much prefer constant chaos than complete serenity.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-28" class="outline-2">
<h2 id="sec-28"><span class="section-number-2">28</span> <a href="https://wordsinasentence.com/serrated-in-a-sentence/">Serrated</a></h2>
<div class="outline-text-2" id="text-28">
<p>
<code>having a row of sharp or tooth-like projections</code>
</p>

<ul class="org-ul">
<li>A serrated knife allowed the chef to saw the bread into slices.
</li>
<li>In order to cut the steaks, each dish included a serrated knife.
</li>
<li>The serrated edge of a knife proved more dangerous to cut food due to its toothed side.
</li>
<li>The difference between the two knife sets is that the first set contained a serrated knife to cut bread and meats.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-29" class="outline-2">
<h2 id="sec-29"><span class="section-number-2">29</span> <a href="https://wordsinasentence.com/servile-in-a-sentence/">Servile</a></h2>
<div class="outline-text-2" id="text-29">
<p>
<code>submissive; willing to serve others</code>
</p>

<ul class="org-ul">
<li>Some individuals are so servile that other people take advantage of their submissiveness.
</li>
<li>Because she has a servile <b>disposition</b> <code>性情</code>, Janet is a great nurse.
</li>
<li>Even though Michelle was no longer a maid, she still felt servile when she was in a room with wealthy people.
</li>
<li>Wives do not exist simply to be servile and to do their husbands’ <b>bidding</b> <code>吩咐</code>.
</li>
<li>Since you pay me, I am willing to work for you and be servile from the hours of nine to five each day.
</li>
<li>A diehard <b>people pleaser</b> <code>讨好者</code>, Justine is servile by nature.
</li>
<li>Because the billionaire’s personal assistant wants to keep her job, she always speaks to her boss in a servile tone.
</li>
</ul>
</div>
</div>
