ruby/S.org
* [[https://wordsinasentence.com/shrivel-in-a-sentence/][Shrivel]]

  =become wrinkled or get smaller=

  - Soaking in the bathtub for too long, the girl’s tiny fingers began to shrivel up like wrinkled sticks.
  - As they lay in the sun, the grapes began to shrivel into a raisin form.
  - Years of tanning in the sun had caused the woman’s skin to dry and shrivel.
  - As summer turned into fall, the leaves began to shrivel and turn brown in the *crisp air*.

* [[https://wordsinasentence.com/shunt-in-a-sentence/][Shunt]]

  =to push or shove something=

  - It’s unfortunate that our society tends to shunt older workers to retirement before they are ready.
  - The *thirty something* attempted to shunt the idea of marriage in hopes she would get a ring.
  - The car responsible for the rear-end crash shunt the other vehicle into oncoming traffic.
  - Lazy nurses tried to shunt the difficult patient’s onto assistants while they gossiped in the back.

* [[https://wordsinasentence.com/sinuous-in-a-sentence/][Sinuous]]

  =winding and twisting=

  - According to the treasure map, the cave is located at the end of the sinuous path that winds up the mountain.
  - It took the artist four years to create the sinuous sculpture made of hand twisted pieces of wire.
  - Because the maze was especially sinuous with countless twists and turns, we were lost in it for hours.
  - The bird carefully made a sinuous nest out of twigs.

* [[https://wordsinasentence.com/skew-in-a-sentence/][Skew]]

  =slanted, crooked=

  - Because we didn’t use a *level* =水平仪= when hanging it, the picture was skew on the wall.
  - The peculiar man was well known for his crooked cowboy hat that sat skew on top of his head.
  - I was irritated by the skew book on the shelf that refused to stand up straight.
  - Although I tried my best to keep all of the dominoes parallel, a skew piece called all of the others to come *tumbling down*.


* [[https://wordsinasentence.com/skinflint-in-a-sentence/][Skinflint]]

  =a person who spends as little money as possible=

  - The skinflint refused to spend money, even on things that are necessary.
  - A *hardnosed* skinflint, the penny-pincher refused to pay full price for anything.
  - The woman’s husband is a skinflint and refuses to give her money for groceries or utilities.
  - Scrooge was a skinflint who refused to spend a dime on anyone but himself.

* [[https://wordsinasentence.com/slipshod-in-a-sentence/][Slipshod]]

  =performed too rapidly=

  - Because the roofer performed a slipshod repair job, we had a leak in the kitchen within hours.
  - This is a very important task so please do not perform it in a slipshod manner.
  - If you turn in a slipshod project for your final assignment, you will probably not pass the class.
  - Jim’s awful presentation of the poem revealed his slipshod preparation for poetry last night.


* [[https://wordsinasentence.com/slovenly-in-a-sentence/][Slovenly]]

  =having a dirty appearance=

  - The man’s slovenly dress was a result of him being homeless for a month.
  - Because Jan is a *pet hoarder*, with over twenty cats, it is not surprising that she lives in a slovenly home.
  - In the animated series, the slovenly dark-skinned child always has a puff of dirt following him.
  - Although Warren is very wealthy, he still lives in the slovenly neighborhood where he grew up as an underprivileged youth.
  - Since Bridgett spends most of her time in class, she rarely cleans her slovenly dorm room.
  - The inmates have written the governor a letter complaining about the slovenly and unsanitary prison conditions.
  - After a night of wild partying, a slovenly-looking Carl came in to work wearing yesterday’s clothes.

* [[https://wordsinasentence.com/sluggish-in-a-sentence/][Sluggish]]

  =slow-moving and lacking in energy=

  - After staying up all night, the tired teenager was sluggish when morning arrived.
  - It took forever for the sluggish sloth to move from one side of the road to the other.
  - Ben may need a new computer since his sluggish laptop takes forever to boot up.
  - Because sales have been sluggish, the company will host an event to bring in customers.

* [[https://wordsinasentence.com/smother-in-a-sentence/][Smother]]

  =to restrict or stifle the airflow of someone or something requiring air or oxygen=

  - When the camp leader decided he needed to smother the fire before going to bed, he took his booted foot and stomped it out.
  - Taking a pillow to smother the victim by holding it firmly on top of her face is one way to cause the victim to die since she can’t breathe.
  - By rubbing thick Vaseline over the tick under my skin that caused it to smother since it was trapped without oxygen.
  - Instead of blowing out the candle, I placed a small cup over the entire *wick* =灯芯= in order to smother the flame.

* [[https://wordsinasentence.com/smug-in-a-sentence/][Smug]]

  =extremely satisfied with oneself=

  - Gregory was smug after he easily eliminated his rival during the kickboxing competition.
  - After scoring a touchdown, the smug player did his celebratory dance.
  - Jason’s smug expression left his face when he received a failing score on his driving exam.
  - Because Rick had a smug attitude during his meeting with the principal, he projected the image he was proud of his misdeeds.

* [[https://wordsinasentence.com/snub-in-a-sentence/][Snub]]

  =the ignoring or brushing off of someone=

  - The waitress insisted that her lack of attentiveness to the table wasn’t a snub, but an accidental oversight.
  - The ignoring of the new student was an intentional snub, as the hateful girls refused to allow anyone into their clique.
  - When the newlywed *turned her nose up* =嗤之以鼻= to her mother-in-law’s dinner offer, the snub offended everyone in the family.
  - The endorsement of the unknown candidate by many local affiliates felt like a snub to the local contender.

* [[https://wordsinasentence.com/snug-in-a-sentence/][Snug]]

  =fitting tightly=

  - The baby’s car seat belt must be snug so that she will be protected in case of an accident.
  - Snug fitting pajamas help protect your skin from burning in case of a fire.
  - The woman’s snug fitting pants were the first sign that she had gained weight.
  - Pulling down his snug cap down tightly, the ball player prepared to pitch the ball.

