ruby/S.html

<div id="outline-container-sec-30" class="outline-2">
<h2 id="sec-30"><span class="section-number-2">30</span> <a href="https://wordsinasentence.com/shrivel-in-a-sentence/">Shrivel</a></h2>
<div class="outline-text-2" id="text-30">
<p>
<code>become wrinkled or get smaller</code>
</p>

<ul class="org-ul">
<li>Soaking in the bathtub for too long, the girl’s tiny fingers began to shrivel up like wrinkled sticks.
</li>
<li>As they lay in the sun, the grapes began to shrivel into a raisin form.
</li>
<li>Years of tanning in the sun had caused the woman’s skin to dry and shrivel.
</li>
<li>As summer turned into fall, the leaves began to shrivel and turn brown in the <b>crisp air</b>.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-31" class="outline-2">
<h2 id="sec-31"><span class="section-number-2">31</span> <a href="https://wordsinasentence.com/shunt-in-a-sentence/">Shunt</a></h2>
<div class="outline-text-2" id="text-31">
<p>
<code>to push or shove something</code>
</p>

<ul class="org-ul">
<li>It’s unfortunate that our society tends to shunt older workers to retirement before they are ready.
</li>
<li>The <b>thirty something</b> attempted to shunt the idea of marriage in hopes she would get a ring.
</li>
<li>The car responsible for the rear-end crash shunt the other vehicle into oncoming traffic.
</li>
<li>Lazy nurses tried to shunt the difficult patient’s onto assistants while they gossiped in the back.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-32" class="outline-2">
<h2 id="sec-32"><span class="section-number-2">32</span> <a href="https://wordsinasentence.com/sinuous-in-a-sentence/">Sinuous</a></h2>
<div class="outline-text-2" id="text-32">
<p>
<code>winding and twisting</code>
</p>

<ul class="org-ul">
<li>According to the treasure map, the cave is located at the end of the sinuous path that winds up the mountain.
</li>
<li>It took the artist four years to create the sinuous sculpture made of hand twisted pieces of wire.
</li>
<li>Because the maze was especially sinuous with countless twists and turns, we were lost in it for hours.
</li>
<li>The bird carefully made a sinuous nest out of twigs.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-33" class="outline-2">
<h2 id="sec-33"><span class="section-number-2">33</span> <a href="https://wordsinasentence.com/skew-in-a-sentence/">Skew</a></h2>
<div class="outline-text-2" id="text-33">
<p>
<code>slanted, crooked</code>
</p>

<ul class="org-ul">
<li>Because we didn’t use a <b>level</b> <code>水平仪</code> when hanging it, the picture was skew on the wall.
</li>
<li>The peculiar man was well known for his crooked cowboy hat that sat skew on top of his head.
</li>
<li>I was irritated by the skew book on the shelf that refused to stand up straight.
</li>
<li>Although I tried my best to keep all of the dominoes parallel, a skew piece called all of the others to come <b>tumbling down</b>.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-34" class="outline-2">
<h2 id="sec-34"><span class="section-number-2">34</span> <a href="https://wordsinasentence.com/skinflint-in-a-sentence/">Skinflint</a></h2>
<div class="outline-text-2" id="text-34">
<p>
<code>a person who spends as little money as possible</code>
</p>

<ul class="org-ul">
<li>The skinflint refused to spend money, even on things that are necessary.
</li>
<li>A <b>hardnosed</b> skinflint, the penny-pincher refused to pay full price for anything.
</li>
<li>The woman’s husband is a skinflint and refuses to give her money for groceries or utilities.
</li>
<li>Scrooge was a skinflint who refused to spend a dime on anyone but himself.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-35" class="outline-2">
<h2 id="sec-35"><span class="section-number-2">35</span> <a href="https://wordsinasentence.com/slipshod-in-a-sentence/">Slipshod</a></h2>
<div class="outline-text-2" id="text-35">
<p>
<code>performed too rapidly</code>
</p>

<ul class="org-ul">
<li>Because the roofer performed a slipshod repair job, we had a leak in the kitchen within hours.
</li>
<li>This is a very important task so please do not perform it in a slipshod manner.
</li>
<li>If you turn in a slipshod project for your final assignment, you will probably not pass the class.
</li>
<li>Jim’s awful presentation of the poem revealed his slipshod preparation for poetry last night.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-36" class="outline-2">
<h2 id="sec-36"><span class="section-number-2">36</span> <a href="https://wordsinasentence.com/slovenly-in-a-sentence/">Slovenly</a></h2>
<div class="outline-text-2" id="text-36">
<p>
<code>having a dirty appearance</code>
</p>

<ul class="org-ul">
<li>The man’s slovenly dress was a result of him being homeless for a month.
</li>
<li>Because Jan is a <b>pet hoarder</b>, with over twenty cats, it is not surprising that she lives in a slovenly home.
</li>
<li>In the animated series, the slovenly dark-skinned child always has a puff of dirt following him.
</li>
<li>Although Warren is very wealthy, he still lives in the slovenly neighborhood where he grew up as an underprivileged youth.
</li>
<li>Since Bridgett spends most of her time in class, she rarely cleans her slovenly dorm room.
</li>
<li>The inmates have written the governor a letter complaining about the slovenly and unsanitary prison conditions.
</li>
<li>After a night of wild partying, a slovenly-looking Carl came in to work wearing yesterday’s clothes.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-37" class="outline-2">
<h2 id="sec-37"><span class="section-number-2">37</span> <a href="https://wordsinasentence.com/sluggish-in-a-sentence/">Sluggish</a></h2>
<div class="outline-text-2" id="text-37">
<p>
<code>slow-moving and lacking in energy</code>
</p>

<ul class="org-ul">
<li>After staying up all night, the tired teenager was sluggish when morning arrived.
</li>
<li>It took forever for the sluggish sloth to move from one side of the road to the other.
</li>
<li>Ben may need a new computer since his sluggish laptop takes forever to boot up.
</li>
<li>Because sales have been sluggish, the company will host an event to bring in customers.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-38" class="outline-2">
<h2 id="sec-38"><span class="section-number-2">38</span> <a href="https://wordsinasentence.com/smother-in-a-sentence/">Smother</a></h2>
<div class="outline-text-2" id="text-38">
<p>
<code>to restrict or stifle the airflow of someone or something requiring air or oxygen</code>
</p>

<ul class="org-ul">
<li>When the camp leader decided he needed to smother the fire before going to bed, he took his booted foot and stomped it out.
</li>
<li>Taking a pillow to smother the victim by holding it firmly on top of her face is one way to cause the victim to die since she can’t breathe.
</li>
<li>By rubbing thick Vaseline over the tick under my skin that caused it to smother since it was trapped without oxygen.
</li>
<li>Instead of blowing out the candle, I placed a small cup over the entire <b>wick</b> <code>灯芯</code> in order to smother the flame.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-39" class="outline-2">
<h2 id="sec-39"><span class="section-number-2">39</span> <a href="https://wordsinasentence.com/smug-in-a-sentence/">Smug</a></h2>
<div class="outline-text-2" id="text-39">
<p>
<code>extremely satisfied with oneself</code>
</p>

<ul class="org-ul">
<li>Gregory was smug after he easily eliminated his rival during the kickboxing competition.
</li>
<li>After scoring a touchdown, the smug player did his celebratory dance.
</li>
<li>Jason’s smug expression left his face when he received a failing score on his driving exam.
</li>
<li>Because Rick had a smug attitude during his meeting with the principal, he projected the image he was proud of his misdeeds.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-40" class="outline-2">
<h2 id="sec-40"><span class="section-number-2">40</span> <a href="https://wordsinasentence.com/snub-in-a-sentence/">Snub</a></h2>
<div class="outline-text-2" id="text-40">
<p>
<code>the ignoring or brushing off of someone</code>
</p>

<ul class="org-ul">
<li>The waitress insisted that her lack of attentiveness to the table wasn’t a snub, but an accidental oversight.
</li>
<li>The ignoring of the new student was an intentional snub, as the hateful girls refused to allow anyone into their clique.
</li>
<li>When the newlywed <b>turned her nose up</b> <code>嗤之以鼻</code> to her mother-in-law’s dinner offer, the snub offended everyone in the family.
</li>
<li>The endorsement of the unknown candidate by many local affiliates felt like a snub to the local contender.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-41" class="outline-2">
<h2 id="sec-41"><span class="section-number-2">41</span> <a href="https://wordsinasentence.com/snug-in-a-sentence/">Snug</a></h2>
<div class="outline-text-2" id="text-41">
<p>
<code>fitting tightly</code>
</p>

<ul class="org-ul">
<li>The baby’s car seat belt must be snug so that she will be protected in case of an accident.
</li>
<li>Snug fitting pajamas help protect your skin from burning in case of a fire.
</li>
<li>The woman’s snug fitting pants were the first sign that she had gained weight.
</li>
<li>Pulling down his snug cap down tightly, the ball player prepared to pitch the ball.
</li>
</ul>
</div>
</div>
