ruby/S.org
* [[https://wordsinasentence.com/solder-in-a-sentence/][Solder]]

  =a fusible metal (usually tin or lead) that is used to join other metals together=

  - Half of the world’s tin is used for solder, specifically to fuse other metals together.
  - A laser was used to attach a lead solder to the ball joint.
  - It is important when fusing things to use solder that is compatible with both metals.
  - After a few failed attempts, lead solder was used to fuse two metal bars together.

* [[https://wordsinasentence.com/solicit-in-a-sentence/][Solicit]]

  =to request or ask for something=

  - Many businesses put up signs to discourage others from going there to solicit.
  - If you want to solicit business from them, you’ll have to communicate at their level.
  - The prostitute was arrested when she tried to solicit an undercover officer.
  - During the war, they looked to solicit help from their neighboring countries.
  - The homeless man looked to solicit enough money to buy lunch.
  - She only wore that fancy dress to solicit compliments from her peers.
  - The salesman tried to solicit business everywhere he went.

* [[https://wordsinasentence.com/solicitous-in-a-sentence/][solicitous]]

  =full of anxiety and concern=

  - I am going to keep a solicitous eye out for criminals in this *hard-hit* =受失业问题打击严重的= neighborhood.
  - The solicitous mother did not want her young daughter going out on a date.
  - My girlfriend gets solicitous when I drink too much.
  - Nothing makes me more solicitous right now than my depressing financial situation.
  - My solicitous friend believes it is unsafe to fly an airplane.
  - I can understand why you are concerned about my late pregnancy, but acting overly solicitous about it is crazy.
  - Drivers around the world are solicitous about rising gas prices.

* [[https://wordsinasentence.com/solicitude-in-a-sentence/][Solicitude]]

  =care or concern=

  - His solicitude was shown by the fact that he brought flowers to her every day.
  - A mother is always going to display some solicitude for her children.
  - After her boyfriend was in a car accident, she showed her solicitude by visiting until he was out of the hospital.
  - He waited with solicitude for the test results, hoping his daughter was not suffering from a serious condition.
  - The server was able to improve her tips by offering sincere solicitude to all of her customers.
  - Gandhi showed great solicitude towards all life on earth.
  - Mother Teresa was known for her extraordinary solicitude.

* [[https://wordsinasentence.com/soliloquy-in-a-sentence/][Soliloquy]]

  =a monologue that is spoken out loud by an actor or actress=

  - Speaking her internal thoughts as she moved about, the Broadway star gave a stellar soliloquy through her moving speech.
  - A closing soliloquy moved the crowd to tears as they were given a glimpse into the dying man’s fears and hopes.
  - The actress’s soliloquy let the audience hear the character’s inner thoughts right before the climax.
  - Preparing for his soliloquy, Shakespeare paced back and forth reading his monologue lines aloud.

* [[https://wordsinasentence.com/solvent-in-a-sentence/][Solvent]]

  =able to pay all financial obligations=

  - When the man realized he was not solvent and was unable to *provide for* =供养= his wife and kids, he killed himself.
  - Rick refused to sell his solvent company because it was so profitable.
  - Because the restaurant is not solvent, it will be closing in two weeks.
  - The computer company was able to remain solvent for three years before closing its doors.

* [[https://wordsinasentence.com/somber-in-a-sentence/][Somber]]

  =grim or miserable=

  - When I saw the doctor’s somber expression, I knew my diagnosis was not a good one.
  - Sometimes the news is so somber I turn off the television.
  - After Bill was unexpectedly fired, he was in a somber mood for weeks.
  - The funeral hall was filled with somber faces.
  - Because Jane was feeling poorly on her birthday, she looked pretty somber during her party.
  - We took William’s somber look to mean he had not gotten the promotion at work.
  - After the home team lost the big game, the stands were filled with somber fans.

* [[https://wordsinasentence.com/sonorous-in-a-sentence/][Sonorous]]

  =able to produce a deep sound=

  - Even without a microphone, the singer’s sonorous voice filled the entire room.
  - Because Hank has a sonorous pleasant-sounding voice, he is often paid to narrate television commercials.
  - I wear *earplugs* so my husband’s sonorous snoring does not keep me awake at night.
  - When the doctors heard the patient’s sonorous breathing, they knew he needed oxygen immediately.
  - The lion’s sonorous rumble startled the small children in the zoo.
  - When a sonorous sound came from the volcano, the residents of the village knew it was time to evacuate the area.
  - The *town crier* =城市公告员= had a loud sonorous voice that was easily heard throughout the  town.

* [[https://wordsinasentence.com/soothe-in-a-sentence/][Soothe]]

  =to calm or ease=

  - The calming *aloe vera* =芦荟= plant is used be people all over the world to soothe burns and skin irritations.
  - Try as I might, I could not soothe the *colicky* infant who continued to cry.
  - An apology did little to soothe the woman’s hurt feelings or mend the grudge between the feuding siblings.
  - Alternating between heat and cool *compresses* =敷布= is said to soothe the aching in the lower *lumbar* region.

* [[https://wordsinasentence.com/sophomoric-in-a-sentence/][Sophomoric]]

  =juvenile, immature, and lacking good judgment=

  - After drinking too much alcohol, the celebrity made sophomoric comments that turned his fans against him.
  - The sophomoric humor in the movie only appeals to teenagers.
  - When Jason and Heather went out on dates, Jason often displayed sophomoric behaviors that really embarrassed Heather in front of her mature friends.
  - Young people should not watch reality shows because the only thing they can learn from this type of entertainment is how to act in a sophomoric manner.
  - The professor was shocked when one of his graduate students turned in an essay filled with sophomoric errors.
  - Because the boys played a sophomoric prank that could have turned deadly, they were suspended from school for the rest of the academic year.
  - As one of the few openly gay teenagers in his school, Jed is used to enduring sophomoric comments from bullies.

