ruby/S.html

<div id="outline-container-sec-42" class="outline-2">
<h2 id="sec-42"><span class="section-number-2">42</span> <a href="https://wordsinasentence.com/solder-in-a-sentence/">Solder</a></h2>
<div class="outline-text-2" id="text-42">
<p>
<code>a fusible metal (usually tin or lead) that is used to join other metals together</code>
</p>

<ul class="org-ul">
<li>Half of the world’s tin is used for solder, specifically to fuse other metals together.
</li>
<li>A laser was used to attach a lead solder to the ball joint.
</li>
<li>It is important when fusing things to use solder that is compatible with both metals.
</li>
<li>After a few failed attempts, lead solder was used to fuse two metal bars together.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-43" class="outline-2">
<h2 id="sec-43"><span class="section-number-2">43</span> <a href="https://wordsinasentence.com/solicit-in-a-sentence/">Solicit</a></h2>
<div class="outline-text-2" id="text-43">
<p>
<code>to request or ask for something</code>
</p>

<ul class="org-ul">
<li>Many businesses put up signs to discourage others from going there to solicit.
</li>
<li>If you want to solicit business from them, you’ll have to communicate at their level.
</li>
<li>The prostitute was arrested when she tried to solicit an undercover officer.
</li>
<li>During the war, they looked to solicit help from their neighboring countries.
</li>
<li>The homeless man looked to solicit enough money to buy lunch.
</li>
<li>She only wore that fancy dress to solicit compliments from her peers.
</li>
<li>The salesman tried to solicit business everywhere he went.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-44" class="outline-2">
<h2 id="sec-44"><span class="section-number-2">44</span> <a href="https://wordsinasentence.com/solicitous-in-a-sentence/">solicitous</a></h2>
<div class="outline-text-2" id="text-44">
<p>
<code>full of anxiety and concern</code>
</p>

<ul class="org-ul">
<li>I am going to keep a solicitous eye out for criminals in this <b>hard-hit</b> <code>受失业问题打击严重的</code> neighborhood.
</li>
<li>The solicitous mother did not want her young daughter going out on a date.
</li>
<li>My girlfriend gets solicitous when I drink too much.
</li>
<li>Nothing makes me more solicitous right now than my depressing financial situation.
</li>
<li>My solicitous friend believes it is unsafe to fly an airplane.
</li>
<li>I can understand why you are concerned about my late pregnancy, but acting overly solicitous about it is crazy.
</li>
<li>Drivers around the world are solicitous about rising gas prices.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-45" class="outline-2">
<h2 id="sec-45"><span class="section-number-2">45</span> <a href="https://wordsinasentence.com/solicitude-in-a-sentence/">Solicitude</a></h2>
<div class="outline-text-2" id="text-45">
<p>
<code>care or concern</code>
</p>

<ul class="org-ul">
<li>His solicitude was shown by the fact that he brought flowers to her every day.
</li>
<li>A mother is always going to display some solicitude for her children.
</li>
<li>After her boyfriend was in a car accident, she showed her solicitude by visiting until he was out of the hospital.
</li>
<li>He waited with solicitude for the test results, hoping his daughter was not suffering from a serious condition.
</li>
<li>The server was able to improve her tips by offering sincere solicitude to all of her customers.
</li>
<li>Gandhi showed great solicitude towards all life on earth.
</li>
<li>Mother Teresa was known for her extraordinary solicitude.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-46" class="outline-2">
<h2 id="sec-46"><span class="section-number-2">46</span> <a href="https://wordsinasentence.com/soliloquy-in-a-sentence/">Soliloquy</a></h2>
<div class="outline-text-2" id="text-46">
<p>
<code>a monologue that is spoken out loud by an actor or actress</code>
</p>

<ul class="org-ul">
<li>Speaking her internal thoughts as she moved about, the Broadway star gave a stellar soliloquy through her moving speech.
</li>
<li>A closing soliloquy moved the crowd to tears as they were given a glimpse into the dying man’s fears and hopes.
</li>
<li>The actress’s soliloquy let the audience hear the character’s inner thoughts right before the climax.
</li>
<li>Preparing for his soliloquy, Shakespeare paced back and forth reading his monologue lines aloud.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-47" class="outline-2">
<h2 id="sec-47"><span class="section-number-2">47</span> <a href="https://wordsinasentence.com/solvent-in-a-sentence/">Solvent</a></h2>
<div class="outline-text-2" id="text-47">
<p>
<code>able to pay all financial obligations</code>
</p>

<ul class="org-ul">
<li>When the man realized he was not solvent and was unable to <b>provide for</b> <code>供养</code> his wife and kids, he killed himself.
</li>
<li>Rick refused to sell his solvent company because it was so profitable.
</li>
<li>Because the restaurant is not solvent, it will be closing in two weeks.
</li>
<li>The computer company was able to remain solvent for three years before closing its doors.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-48" class="outline-2">
<h2 id="sec-48"><span class="section-number-2">48</span> <a href="https://wordsinasentence.com/somber-in-a-sentence/">Somber</a></h2>
<div class="outline-text-2" id="text-48">
<p>
<code>grim or miserable</code>
</p>

<ul class="org-ul">
<li>When I saw the doctor’s somber expression, I knew my diagnosis was not a good one.
</li>
<li>Sometimes the news is so somber I turn off the television.
</li>
<li>After Bill was unexpectedly fired, he was in a somber mood for weeks.
</li>
<li>The funeral hall was filled with somber faces.
</li>
<li>Because Jane was feeling poorly on her birthday, she looked pretty somber during her party.
</li>
<li>We took William’s somber look to mean he had not gotten the promotion at work.
</li>
<li>After the home team lost the big game, the stands were filled with somber fans.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-49" class="outline-2">
<h2 id="sec-49"><span class="section-number-2">49</span> <a href="https://wordsinasentence.com/sonorous-in-a-sentence/">Sonorous</a></h2>
<div class="outline-text-2" id="text-49">
<p>
<code>able to produce a deep sound</code>
</p>

<ul class="org-ul">
<li>Even without a microphone, the singer’s sonorous voice filled the entire room.
</li>
<li>Because Hank has a sonorous pleasant-sounding voice, he is often paid to narrate television commercials.
</li>
<li>I wear <b>earplugs</b> so my husband’s sonorous snoring does not keep me awake at night.
</li>
<li>When the doctors heard the patient’s sonorous breathing, they knew he needed oxygen immediately.
</li>
<li>The lion’s sonorous rumble startled the small children in the zoo.
</li>
<li>When a sonorous sound came from the volcano, the residents of the village knew it was time to evacuate the area.
</li>
<li>The <b>town crier</b> <code>城市公告员</code> had a loud sonorous voice that was easily heard throughout the  town.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-50" class="outline-2">
<h2 id="sec-50"><span class="section-number-2">50</span> <a href="https://wordsinasentence.com/soothe-in-a-sentence/">Soothe</a></h2>
<div class="outline-text-2" id="text-50">
<p>
<code>to calm or ease</code>
</p>

<ul class="org-ul">
<li>The calming <b>aloe vera</b> <code>芦荟</code> plant is used be people all over the world to soothe burns and skin irritations.
</li>
<li>Try as I might, I could not soothe the <b>colicky</b> infant who continued to cry.
</li>
<li>An apology did little to soothe the woman’s hurt feelings or mend the grudge between the feuding siblings.
</li>
<li>Alternating between heat and cool <b>compresses</b> <code>敷布</code> is said to soothe the aching in the lower <b>lumbar</b> region.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-51" class="outline-2">
<h2 id="sec-51"><span class="section-number-2">51</span> <a href="https://wordsinasentence.com/sophomoric-in-a-sentence/">Sophomoric</a></h2>
<div class="outline-text-2" id="text-51">
<p>
<code>juvenile, immature, and lacking good judgment</code>
</p>

<ul class="org-ul">
<li>After drinking too much alcohol, the celebrity made sophomoric comments that turned his fans against him.
</li>
<li>The sophomoric humor in the movie only appeals to teenagers.
</li>
<li>When Jason and Heather went out on dates, Jason often displayed sophomoric behaviors that really embarrassed Heather in front of her mature friends.
</li>
<li>Young people should not watch reality shows because the only thing they can learn from this type of entertainment is how to act in a sophomoric manner.
</li>
<li>The professor was shocked when one of his graduate students turned in an essay filled with sophomoric errors.
</li>
<li>Because the boys played a sophomoric prank that could have turned deadly, they were suspended from school for the rest of the academic year.
</li>
<li>As one of the few openly gay teenagers in his school, Jed is used to enduring sophomoric comments from bullies.
</li>
</ul>
</div>
</div>
