ruby/S.org
* [[https://wordsinasentence.com/soporific-in-a-sentence/][Soporific]]

  =causing or tending to cause sleep=

  - The professor’s boring speech was soporific and had everyone in the audience yawning.
  - While alcohol is soporific and can help you sleep, it does not take away your problems.
  - Because of the medicine’s soporific properties, the doctor told me to only take it at bedtime.
  - There is a soporific effect of eating that makes many people sleepy after every meal.
  - Everyone was glad when the loud dance music completely altered the soporific tone of the formal event.
  - To my active daughter, few things are as soporific as watching the game of golf on television.
  - After taking her soporific prescription, June was asleep within an hour.


* [[https://wordsinasentence.com/spartan-in-a-sentence/][Spartan]]

  =reflective of vast *self-denial* (克己)=

  - The décor in my apartment is spartan because I don’t have a lot of money for furnishings.
  - As a soldier, Mark is used to traveling with spartan supplies.
  - The monks have chosen to live a spartan life devoid of all luxuries.
  - While I had my wedding at a five-star hotel, my sister’s wedding took place in a spartan courthouse.

* [[https://wordsinasentence.com/specious-in-a-sentence/][Specious]]

  =seems correct or true, but actually wrong or false; deceptive=

  - The intruder tried to give the authorities a specious excuse regarding his presence in the building.
  - Although he could not deliver on them, the salesman made us several specious promises.
  - Several weight loss products on the market make specious claims as to their effectiveness.
  - Rather than admitting he overslept, Joe gave his teacher a specious reason for being late.
  - Even though the defendant told a good tale, the jury found his testimony to be specious.
  - Since she had doubts about the specious business offer, Kim refused to sign the contract.
  - You will not win your debate with specious arguments!


* [[https://wordsinasentence.com/sporadic-in-a-sentence/][Sporadic]]

  =occurring occasionally=

  - Since my father left my mother and me twenty years ago, he has made sporadic appearances in my life.
  - The doctor decided to hospitalize my mother because of her sporadic heartbeat.
  - Sporadic gas shortages are making the summer miserable for many travelers.
  - Over the years, many singers have discovered success can be sporadic.
  - After the tornado, there were sporadic power outages in our town.
  - Commercial development in our city has been sporadic because of the weak economy.
  - The doctors are finding it difficult to identify the cause of Tom’s sporadic headaches because they occur infrequently.

* [[https://wordsinasentence.com/sprawl-in-a-sentence/][Sprawl]]

  =to develop or spread without limitation=

  - If we don’t manage the bushes, they'll sprawl onto our neighbor’s property.
  - The troublesome vines have started to sprawl over the fence.
  - Once finished, the huge amusement park will sprawl over more than 400 acres.
  - My kitten will sometimes sprawl across my laptop and use it as a nap spot.

* [[https://wordsinasentence.com/sprout-in-a-sentence/][Sprout]]

  =to develop or shoot forth=

  - The young students are eager gardeners ready to see their seeds sprout.
  - Because we haven’t been tending the garden, the weeds have started to sprout.
  - My nephew has began to sprout and is now nearly as tall as his father.
  - After the mayor announced the building of the new manufacturing plant, housing developments started to sprout around our small town.


* [[https://wordsinasentence.com/spruce-in-a-sentence/][Spruce]]

  =to make something clean or neat or to be stylish or clean=

  - We are having guests so please spruce up before dinner.
  - As soon as the spruce man walked in the room, everyone started to comment about his stylish appearance.
  - A new coat of paint should spruce up the old church.
  - The necklace will spruce up the black dress and give you a more sophisticated look.

* [[https://wordsinasentence.com/spurious-in-a-sentence/][Spurious]]

  =not real or genuine=

  - After receiving a low appraisal on my diamond ring, I realized the suspicious-looking jeweler had sold me a spurious jewel.
  - The con artist made a spurious claim about being a member of the royal family.
  - Despite the spurious statement the suspect made about his whereabouts on the night of the murder, the police had to release him because of a lack of evidence.
  - Everyone knows Janice is trying to pass her spurious designer handbag off as the real thing.
  - Recently, some weight loss drugs were taken off the market because of spurious statements made by the manufacturers.
  - The so-called historical document looked spurious to me because it was written on printer paper.
  - Because they want to attract readers, many bloggers often make up spurious headlines.

* [[https://wordsinasentence.com/spurn-in-a-sentence/][Spurn]]

  =to reject; turn down=

  - Mikey is such a picky eater that he will spurn everything except chicken nuggets and ice cream.
  - Even after you spurn this so-called charity’s request for donations, they continue to hound you every week.
  - I’ll never understand why my cousin chose to spurn the chance to join us on our family cruise to the Bahamas.
  - During the 1960s, young people began to spurn the traditions of previous generations, and the Hippy movement was born.
  - Just because you were afraid of everything as a kid, you shouldn’t spurn the idea of taking your son to Disneyland.
  - In spite of the fact that everyone knew that any suitor the princess decided to spurn would be sent to fight the red dragon, there was still always a line of hopeful young wooers eager to take on the challenge.
  - The political tension in the Middle East is heightened by the current leaders’ tendencies to spurn all overtures to peace.

