ruby/S.html

<div id="outline-container-sec-52" class="outline-2">
<h2 id="sec-52"><span class="section-number-2">52</span> <a href="https://wordsinasentence.com/soporific-in-a-sentence/">Soporific</a></h2>
<div class="outline-text-2" id="text-52">
<p>
<code>causing or tending to cause sleep</code>
</p>

<ul class="org-ul">
<li>The professor’s boring speech was soporific and had everyone in the audience yawning.
</li>
<li>While alcohol is soporific and can help you sleep, it does not take away your problems.
</li>
<li>Because of the medicine’s soporific properties, the doctor told me to only take it at bedtime.
</li>
<li>There is a soporific effect of eating that makes many people sleepy after every meal.
</li>
<li>Everyone was glad when the loud dance music completely altered the soporific tone of the formal event.
</li>
<li>To my active daughter, few things are as soporific as watching the game of golf on television.
</li>
<li>After taking her soporific prescription, June was asleep within an hour.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-53" class="outline-2">
<h2 id="sec-53"><span class="section-number-2">53</span> <a href="https://wordsinasentence.com/spartan-in-a-sentence/">Spartan</a></h2>
<div class="outline-text-2" id="text-53">
<p>
<code>reflective of vast *self-denial* (克己)</code>
</p>

<ul class="org-ul">
<li>The décor in my apartment is spartan because I don’t have a lot of money for furnishings.
</li>
<li>As a soldier, Mark is used to traveling with spartan supplies.
</li>
<li>The monks have chosen to live a spartan life devoid of all luxuries.
</li>
<li>While I had my wedding at a five-star hotel, my sister’s wedding took place in a spartan courthouse.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-54" class="outline-2">
<h2 id="sec-54"><span class="section-number-2">54</span> <a href="https://wordsinasentence.com/specious-in-a-sentence/">Specious</a></h2>
<div class="outline-text-2" id="text-54">
<p>
<code>seems correct or true, but actually wrong or false; deceptive</code>
</p>

<ul class="org-ul">
<li>The intruder tried to give the authorities a specious excuse regarding his presence in the building.
</li>
<li>Although he could not deliver on them, the salesman made us several specious promises.
</li>
<li>Several weight loss products on the market make specious claims as to their effectiveness.
</li>
<li>Rather than admitting he overslept, Joe gave his teacher a specious reason for being late.
</li>
<li>Even though the defendant told a good tale, the jury found his testimony to be specious.
</li>
<li>Since she had doubts about the specious business offer, Kim refused to sign the contract.
</li>
<li>You will not win your debate with specious arguments!
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-55" class="outline-2">
<h2 id="sec-55"><span class="section-number-2">55</span> <a href="https://wordsinasentence.com/sporadic-in-a-sentence/">Sporadic</a></h2>
<div class="outline-text-2" id="text-55">
<p>
<code>occurring occasionally</code>
</p>

<ul class="org-ul">
<li>Since my father left my mother and me twenty years ago, he has made sporadic appearances in my life.
</li>
<li>The doctor decided to hospitalize my mother because of her sporadic heartbeat.
</li>
<li>Sporadic gas shortages are making the summer miserable for many travelers.
</li>
<li>Over the years, many singers have discovered success can be sporadic.
</li>
<li>After the tornado, there were sporadic power outages in our town.
</li>
<li>Commercial development in our city has been sporadic because of the weak economy.
</li>
<li>The doctors are finding it difficult to identify the cause of Tom’s sporadic headaches because they occur infrequently.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-56" class="outline-2">
<h2 id="sec-56"><span class="section-number-2">56</span> <a href="https://wordsinasentence.com/sprawl-in-a-sentence/">Sprawl</a></h2>
<div class="outline-text-2" id="text-56">
<p>
<code>to develop or spread without limitation</code>
</p>

<ul class="org-ul">
<li>If we don’t manage the bushes, they'll sprawl onto our neighbor’s property.
</li>
<li>The troublesome vines have started to sprawl over the fence.
</li>
<li>Once finished, the huge amusement park will sprawl over more than 400 acres.
</li>
<li>My kitten will sometimes <b>sprawl</b> <code>伸展四肢</code> across my laptop and use it as a nap spot.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-57" class="outline-2">
<h2 id="sec-57"><span class="section-number-2">57</span> <a href="https://wordsinasentence.com/sprout-in-a-sentence/">Sprout</a></h2>
<div class="outline-text-2" id="text-57">
<p>
<code>to develop or shoot forth</code>
</p>

<ul class="org-ul">
<li>The young students are eager gardeners ready to see their seeds sprout.
</li>
<li>Because we haven’t been tending the garden, the weeds have started to sprout.
</li>
<li>My nephew has began to sprout and is now nearly as tall as his father.
</li>
<li>After the mayor announced the building of the new manufacturing plant, housing developments started to sprout around our small town.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-58" class="outline-2">
<h2 id="sec-58"><span class="section-number-2">58</span> <a href="https://wordsinasentence.com/spruce-in-a-sentence/">Spruce</a></h2>
<div class="outline-text-2" id="text-58">
<p>
<code>to make something clean or neat or to be stylish or clean</code>
</p>

<ul class="org-ul">
<li>We are having guests so please spruce up before dinner.
</li>
<li>As soon as the spruce man walked in the room, everyone started to comment about his stylish appearance.
</li>
<li>A new coat of paint should spruce up the old church.
</li>
<li>The necklace will <b>spruce up</b> <code>打扮整齐</code> the black dress and give you a more sophisticated look.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-59" class="outline-2">
<h2 id="sec-59"><span class="section-number-2">59</span> <a href="https://wordsinasentence.com/spurious-in-a-sentence/">Spurious</a></h2>
<div class="outline-text-2" id="text-59">
<p>
<code>not real or genuine</code>
</p>

<ul class="org-ul">
<li>After receiving a low appraisal on my diamond ring, I realized the suspicious-looking jeweler had sold me a spurious jewel.
</li>
<li>The con artist made a spurious claim about being a member of the royal family.
</li>
<li>Despite the spurious statement the suspect made about his whereabouts on the night of the murder, the police had to release him because of a lack of evidence.
</li>
<li>Everyone knows Janice is trying to <b>pass her spurious designer handbag off as</b> <code>卖假货</code> the real thing.
</li>
<li>Recently, some weight loss drugs were taken off the market because of spurious statements made by the manufacturers.
</li>
<li>The so-called historical document looked spurious to me because it was written on printer paper.
</li>
<li>Because they want to attract readers, many bloggers often make up spurious headlines.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-60" class="outline-2">
<h2 id="sec-60"><span class="section-number-2">60</span> <a href="https://wordsinasentence.com/spurn-in-a-sentence/">Spurn</a></h2>
<div class="outline-text-2" id="text-60">
<p>
<code>to reject; turn down</code>
</p>

<ul class="org-ul">
<li>Mikey is such a picky eater that he will spurn everything except <b>chicken nuggets</b> and ice cream.
</li>
<li>Even after you spurn this so-called charity’s request for donations, they continue to hound you every week.
</li>
<li>I’ll never understand why my cousin chose to spurn the chance to join us on our family cruise to the Bahamas.
</li>
<li>During the 1960s, young people began to spurn the traditions of previous generations, and the Hippy movement was born.
</li>
<li>Just because you were afraid of everything as a kid, you shouldn’t spurn the idea of taking your son to Disneyland.
</li>
<li>In spite of the fact that everyone knew that any <b>suitor</b> <code>求婚者</code> the princess decided to spurn would be sent to fight the red dragon, there was still always a line of hopeful young wooers eager to take on the challenge.
</li>
<li>The political tension in the Middle East is heightened by the current leaders’ tendencies to spurn all <b>overtures</b> <code>友好姿态</code> to peace.
</li>
</ul>
</div>
</div>
