ruby/S.org
* [[https://wordsinasentence.com/squalid-in-a-sentence/][Squalid]]

  =extremely dirty and unpleasant=

  - The homeless man had no choice but to sleep in squalid conditions.
  - During the war, many prisoners had to live in squalid camps where water and food were in short supply.
  - The abandoned house was squalid and filled with rats.
  - When the health inspector saw the squalid conditions of the restaurant, he insisted the owners close the establishment immediately.
  - The kidnapped little girl was kept in a squalid shed that contained nothing but a filthy mattress.
  - Because the landlord allowed his tenants to live in squalid conditions, he was sentenced to nine months in jail by the state judge.
  - The murder took place in a squalid building that was occupied mostly by drug dealers and gang members.

* [[https://wordsinasentence.com/squander-in-a-sentence/][Squander]]

  =to waste=

  - Because time is one thing you can never get back again, you should always make an effort not to squander a minute on trivial pursuits.
  - Eddie has a tendency to squander his entire allowance on comic books and action figures.
  - Since the beginning of human existence, the abundance of nature has inspired us to squander our natural resources, which is why we’re in the mess we’re in now.
  - Dina didn’t want to squander her good mood in the darkness of a movie theater, so she persuaded her friends to go dancing instead.
  - I couldn’t believe it when I heard that the young virtuoso had decided to squander his talent as a violinist and become a game show host.
  - There are a lot of deceitful characters out there who prey on the elderly in an effort to get them to squander what little money they have from their pensions or Social Security.
  - When the head of the company decided to invest in all-new technology in every department, the Chief Financial Officer was afraid that he was about to squander all the profits.

* [[https://wordsinasentence.com/stagnant-in-a-sentence/][Stagnant]]

  =not moving or increasing=

  - Because John needs more money and his current salary has been stagnant for three years, he is looking for a new job.
  - Sometimes when I feel my life is stagnant and not going anywhere, I will talk to my psychologist so I can honestly reflect upon my situation.
  - Although the economy appears to be stagnant among the middle classes, it seems as though the rich are getting richer.
  - Two days after the storm, the stagnant water puddles are still in my front yard.
  - Since the legislators are focusing on their battles with each other, progress on the budget proposal has been stagnant.
  - On the hottest day of the year the air was stagnant without a breeze in sight.
  - As my mother looked at the rising food prices and her empty bank account, she noticed her paycheck had remained stagnant for years.

* [[https://wordsinasentence.com/stalwart-in-a-sentence/][Stalwart]]

  =extremely dedicated and loyal=

  - The stalwart dog refused to leave his owner’s grave.
  - When the king was accompanied by his stalwart bodyguards, he felt safe walking among his people.
  - Only the most stalwart of employees will work for free.
  - As a stalwart follower of the Democratic Party, I agree to vote for the party’s presidential candidate.

* [[https://wordsinasentence.com/stark-in-a-sentence/][Stark]]

  =plain; without decoration=

  - With only a small red dot on a white canvas, the painting looked quite stark.
  - The house’s living room was stark and held only one couch.
  - When I looked at the depressed artist’s painting, I was saddened by his stark depiction of the widower’s home.
  - The vegetation in the desert is stark because of the area’s dry climate.

* [[https://wordsinasentence.com/steadfast-in-a-sentence/][Steadfast]]

  =faithful to a person, belief, or goal=

  - My mother really loved my father and remained steadfast to her marriage vows even after my father died.
  - Although the civil rights activist had been warned by the racist police officers, he held steadfast in his commitment to march to city hall.
  - The priest was steadfast in his belief that Christ had died for the sins of all mankind.
  - Despite the fact donations were coming in slowly, Hank remained steadfast to his commitment to raise money for a new orphanage.
  - It was hard for the soldiers to remain steadfast to their commanding officer when they knew he was sending them on a suicide mission.
  - Even though Jack knew his wife had extramarital affairs, he refused to leave her because of his steadfast love.
  - Michelle remained steadfast to her vow of abstinence despite pressure from her boyfriend to have sex.

* [[https://wordsinasentence.com/stilted-in-a-sentence/][Stilted]]

  =unnatural; stiff in form or tone=

  - After the divorce, my parents' conversations were stilted and far from natural.
  - The casting director described the actor’s stilted monologue as a stiff performance.
  - Because Gail and I are school rivals, we rarely engage in anything other than a stilted conversation.
  - It was obvious Jeff’s parents made him deliver the stilted apology.

* [[https://wordsinasentence.com/stint-in-a-sentence/][Stint]]

  =a span of time in which a person is occupied with a particular job or in a particular place=

  - After a two-year stint as a Peace Corps volunteer, I returned home and became a teacher.
  - Patricia’s stint as a waitress gave her the patience she needed to work in shoe sales.
  - When the astronaut returned home after a long stint in space, he had to reconnect with his family.
  - The lawyer did a yearlong stint as a public defender before applying for a position in the district attorney’s office.
  - Before Jason enjoyed a stint as a professional baseball player, he played golf on the amateur level.
  - Mark served a stint in jail for selling drugs.
  - After a stint as an x-ray technician, Barbara applied to pharmacy school.

* [[https://wordsinasentence.com/stipulate-in-a-sentence/][Stipulate]]

  =to insist upon something as a condition of an agreement=

  - The owners may stipulate a huge deposit as a condition of the purchase agreement.
  - Before I agree to close the deal, I must stipulate a few requirements that must be met before I sign on the dotted line.
  - The contracts of the baseball players stipulate they must attend all practices and games.
  - The software company’s policies stipulate employees must take two fifteen-minute breaks a day.
  - Carl’s probation terms stipulate he must adhere to a curfew and report to his probation officer once a week.
  - If the contract does not stipulate how often payments should be made, then it is not a valid agreement.
  - The rules of the Miss South Pageant stipulate that all entrants must be under the age of twenty-one.

