ruby/S.html

<div id="outline-container-sec-61" class="outline-2">
<h2 id="sec-61"><span class="section-number-2">61</span> <a href="https://wordsinasentence.com/squalid-in-a-sentence/">Squalid</a></h2>
<div class="outline-text-2" id="text-61">
<p>
<code>extremely dirty and unpleasant</code>
</p>

<ul class="org-ul">
<li>The homeless man had no choice but to sleep in squalid conditions.
</li>
<li>During the war, many prisoners had to live in squalid camps where water and food were in short supply.
</li>
<li>The abandoned house was squalid and filled with rats.
</li>
<li>When the health inspector saw the squalid conditions of the restaurant, he insisted the owners close the establishment immediately.
</li>
<li>The kidnapped little girl was kept in a squalid shed that contained nothing but a filthy mattress.
</li>
<li>Because the landlord allowed his tenants to live in squalid conditions, he was sentenced to nine months in jail by the state judge.
</li>
<li>The murder took place in a squalid building that was occupied mostly by drug dealers and gang members.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-62" class="outline-2">
<h2 id="sec-62"><span class="section-number-2">62</span> <a href="https://wordsinasentence.com/squander-in-a-sentence/">Squander</a></h2>
<div class="outline-text-2" id="text-62">
<p>
<code>to waste</code>
</p>

<ul class="org-ul">
<li>Because time is one thing you can never get back again, you should always make an effort not to squander a minute on trivial pursuits.
</li>
<li>Eddie has a tendency to squander his entire allowance on comic books and action figures.
</li>
<li>Since the beginning of human existence, the abundance of nature has inspired us to squander our natural resources, which is why we’re in the mess we’re in now.
</li>
<li>Dina didn’t want to squander her good mood in the darkness of a movie theater, so she persuaded her friends to go dancing instead.
</li>
<li>I couldn’t believe it when I heard that the young <b>virtuoso</b> had decided to squander his talent as a violinist and become a game show host.
</li>
<li>There are a lot of deceitful characters out there who prey on the elderly in an effort to get them to squander what little money they have from their pensions or Social Security.
</li>
<li>When the head of the company decided to invest in all-new technology in every department, the Chief Financial Officer was afraid that he was about to squander all the profits.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-63" class="outline-2">
<h2 id="sec-63"><span class="section-number-2">63</span> <a href="https://wordsinasentence.com/stagnant-in-a-sentence/">Stagnant</a></h2>
<div class="outline-text-2" id="text-63">
<p>
<code>not moving or increasing</code>
</p>

<ul class="org-ul">
<li>Because John needs more money and his current salary has been stagnant for three years, he is looking for a new job.
</li>
<li>Sometimes when I feel my life is stagnant and not going anywhere, I will talk to my psychologist so I can honestly reflect upon my situation.
</li>
<li>Although the economy appears to be stagnant among the middle classes, it seems as though the rich are getting richer.
</li>
<li>Two days after the storm, the stagnant <b>water puddles</b> are still in my front yard.
</li>
<li>Since the legislators are focusing on their battles with each other, progress on the budget proposal has been stagnant.
</li>
<li>On the hottest day of the year the air was stagnant without a breeze in sight.
</li>
<li>As my mother looked at the rising food prices and her empty bank account, she noticed her paycheck had remained stagnant for years.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-64" class="outline-2">
<h2 id="sec-64"><span class="section-number-2">64</span> <a href="https://wordsinasentence.com/stalwart-in-a-sentence/">Stalwart</a></h2>
<div class="outline-text-2" id="text-64">
<p>
<code>extremely dedicated and loyal</code>
</p>

<ul class="org-ul">
<li>The stalwart dog refused to leave his owner’s grave.
</li>
<li>When the king was accompanied by his stalwart bodyguards, he felt safe walking among his people.
</li>
<li>Only the most stalwart of employees will work for free.
</li>
<li>As a stalwart follower of the Democratic Party, I agree to vote for the party’s presidential candidate.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-65" class="outline-2">
<h2 id="sec-65"><span class="section-number-2">65</span> <a href="https://wordsinasentence.com/stark-in-a-sentence/">Stark</a></h2>
<div class="outline-text-2" id="text-65">
<p>
<code>plain; without decoration</code>
</p>

<ul class="org-ul">
<li>With only a small red dot on a white canvas, the painting looked quite stark.
</li>
<li>The house’s living room was stark and held only one couch.
</li>
<li>When I looked at the depressed artist’s painting, I was saddened by his stark depiction of the widower’s home.
</li>
<li>The vegetation in the desert is stark because of the area’s dry climate.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-66" class="outline-2">
<h2 id="sec-66"><span class="section-number-2">66</span> <a href="https://wordsinasentence.com/steadfast-in-a-sentence/">Steadfast</a></h2>
<div class="outline-text-2" id="text-66">
<p>
<code>faithful to a person, belief, or goal</code>
</p>

<ul class="org-ul">
<li>My mother really loved my father and remained steadfast to her marriage vows even after my father died.
</li>
<li>Although the civil rights activist had been warned by the racist police officers, he held steadfast in his commitment to march to city hall.
</li>
<li>The priest was steadfast in his belief that Christ had died for the sins of all mankind.
</li>
<li>Despite the fact donations were coming in slowly, Hank remained steadfast to his commitment to raise money for a new orphanage.
</li>
<li>It was hard for the soldiers to remain steadfast to their commanding officer when they knew he was sending them on a suicide mission.
</li>
<li>Even though Jack knew his wife had extramarital affairs, he refused to leave her because of his steadfast love.
</li>
<li>Michelle remained steadfast to her vow of abstinence despite pressure from her boyfriend to have sex.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-67" class="outline-2">
<h2 id="sec-67"><span class="section-number-2">67</span> <a href="https://wordsinasentence.com/stilted-in-a-sentence/">Stilted</a></h2>
<div class="outline-text-2" id="text-67">
<p>
<code>unnatural; stiff in form or tone</code>
</p>

<ul class="org-ul">
<li>After the divorce, my parents' conversations were stilted and far from natural.
</li>
<li>The casting director described the actor’s stilted monologue as a stiff performance.
</li>
<li>Because Gail and I are school rivals, we rarely engage in anything other than a stilted conversation.
</li>
<li>It was obvious Jeff’s parents made him deliver the stilted apology.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-68" class="outline-2">
<h2 id="sec-68"><span class="section-number-2">68</span> <a href="https://wordsinasentence.com/stint-in-a-sentence/">Stint</a></h2>
<div class="outline-text-2" id="text-68">
<p>
<code>a span of time in which a person is occupied with a particular job or in a particular place</code>
</p>

<ul class="org-ul">
<li>After a two-year stint as a Peace Corps volunteer, I returned home and became a teacher.
</li>
<li>Patricia’s stint as a waitress gave her the patience she needed to work in shoe sales.
</li>
<li>When the astronaut returned home after a long stint in space, he had to reconnect with his family.
</li>
<li>The lawyer did a yearlong stint as a public defender before applying for a position in the district attorney’s office.
</li>
<li>Before Jason enjoyed a stint as a professional baseball player, he played golf on the amateur level.
</li>
<li>Mark served a stint in jail for selling drugs.
</li>
<li>After a stint as an x-ray technician, Barbara applied to pharmacy school.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-69" class="outline-2">
<h2 id="sec-69"><span class="section-number-2">69</span> <a href="https://wordsinasentence.com/stipulate-in-a-sentence/">Stipulate</a></h2>
<div class="outline-text-2" id="text-69">
<p>
<code>to insist upon something as a condition of an agreement</code>
</p>

<ul class="org-ul">
<li>The owners may stipulate a huge deposit as a condition of the purchase agreement.
</li>
<li>Before I agree to close the deal, I must stipulate a few requirements that must be met before I sign on the <b>dotted line</b>.
</li>
<li>The contracts of the baseball players stipulate they must attend all practices and games.
</li>
<li>The software company’s policies stipulate employees must take two fifteen-minute breaks a day.
</li>
<li>Carl’s probation terms stipulate he must adhere to a curfew and report to his probation officer once a week.
</li>
<li>If the contract does not stipulate how often payments should be made, then it is not a valid agreement.
</li>
<li>The rules of the Miss South Pageant stipulate that all entrants must be under the age of twenty-one.
</li>
</ul>
</div>
</div>
