ruby/S.org
* [[https://wordsinasentence.com/stocky-in-a-sentence/][Stocky]]

  =sturdy and solid shape usually in humans or animals=

  - With a stocky frame, her blind date was rather short but it looked like he could bench press over 200 pounds.
  - Even though the stocky dog was a cute poodle, he knocked me over after jumping up on me.
  - Sam was picked for the kickball team due to his stocky body type which made his teammates believe he could kick a homerun.
  - As the stocky horse rounded the corner of the racetrack, his muscle bulged through his shiny brown fur.

* [[https://wordsinasentence.com/stodgy-in-a-sentence/][Stodgy]]

  =having old-fashioned beliefs and feelings=

  - The stodgy old man did not believe women should work outside of the home.
  - As I looked at the stodgy committee, I knew the members would not be impressed by my unconventional ideas.
  - My professor’s pipe and outdated wardrobe gave him a stodgy appearance.
  - In my church, the minister maintains the stodgy opinion women should not wear pants.

* [[https://wordsinasentence.com/stoic-in-a-sentence/][Stoic]]

  =describing one who is not moved by pain or pleasure=

  - My stoic uncle showed no emotion at his wife’s funeral.
  - While on camera, the actor played the role of a stoic killer who was not affected by the pain he suffered or inflicted upon others.
  - Candace worked hard to maintain her stoic features so others could not see her true feelings.
  - As I looked at Alex’s stoic face, I could not tell if he was happy or said.
  - The stoic defendant’s facial expression did not change when the judge gave him life in prison.
  - When the stoic girl got a spanking, she showed no emotion at all.
  - John’s stoic personality causes him to come across as cold and unfeeling.

* [[https://wordsinasentence.com/stratagem-in-a-sentence/][Stratagem]]

  =a scheme or a clever plot, especially one used to outwit an opponent or achieve a goal=

  - His chess stratagem was so good that he never lost a match.
  - Her business stratagem allowed her to quickly rise to the top as a great success.
  - With years of tactical experience, the lieutenant used a stratagem to minimize risk of casualties.
  - Though he had a clever stratagem, he had underestimated his opponent’s numbers and was faced with defeat.
  - Though the villain had a devious stratagem, the hero was able to win in the end.
  - With the right stratagem, you can accomplish just about any goal.
  - His poker stratagem allowed him to beat his friends nearly every week.

* [[https://wordsinasentence.com/streak-in-a-sentence/][Streak]]

  =a line of substance that is distinct from the whole. Can be dirt, color, or some other source=

  - In an iconic scene in Harry Potter and the Sorcerer’s Stone, Ron Weasley has a streak of dirt on his cheek.
  - Skunks have a streak of white fur down their backs.
  - During her date at the Italian restaurant, Janet was so *flustered* that she dropped her *ravioli* and it left a streak of red sauce on her white blouse.
  - Before dying her whole head, Roxie put a streak of pink in her bangs to test the color.

* [[https://wordsinasentence.com/strenuous-in-a-sentence/][Strenuous]]

  =requiring a lot of effort=

  - Writing a novel under a tight deadline is a very strenuous task.
  - In order to be in the military, one must be prepared for strenuous activity.
  - The weightlifter exerted strenuous effort to lift the car off the ground.
  - Because I am *out of shape* =胖=, I found the two-mile hike to be very strenuous.


* [[https://wordsinasentence.com/stringent-in-a-sentence/][Stringent]]

  =very strict or severe=

  - I was so happy to move out of my parents’ house and escape their stringent rules.
  - When Martha was overweight, her doctor put her on stringent diet that left her feeling hungry all the time.
  - Airplanes must pass stringent safety tests before they are allowed to be passenger carriers.
  - Since the level of violent crimes has not decreased in years, it appears as if more stringent consequences are necessary for those who commit these awful acts.
  - Stringent visa rules are keeping many people from relocating to our country.
  - Even though James performed very well as a college undergraduate, he was unable to meet the stringent admission requirements of the medical school.
  - Several schools are being closed as a result of the county’s stringent budget crisis.

* [[https://wordsinasentence.com/stronghold-in-a-sentence/][Stronghold]]

  =heavily reinforced place of protection or center for militia=

  - The stronghold was guarded by hundreds of highly trained soldiers and fortified with reinforced steel.
  - They knew that if they could just make it to the stronghold alive that they’d find ample protection and weapons to use against their enemies.
  - Every skilled army has a stronghold to hole up in when the battle starts to go downhill.
  - The castle’s stronghold was the optimal place to go under siege because it only had one entrance and housed countless deadly weapons.

* [[https://wordsinasentence.com/stumble-in-a-sentence/][Stumble]]

  =a fall or trip; to lose one's balance=

  - She tripped on a toy and began to stumble down the stairs.
  - After he hit his head while playing at the park, he was only able to stumble home to safety.
  - She needed practice walking in high heels for her wedding day as she managed to only stumble around in them.
  - The runner started to stumble as he approached the finish line.

* [[https://wordsinasentence.com/stymie-in-a-sentence/][Stymie]]

  =to stand as an obstacle=

  - My rival did everything she could to stymie my efforts to become homecoming queen.
  - Since my parents were unhappy about my college choice, they tried to stymie my decision by withholding their financial assistance.
  - Some people believe the legalization of marijuana will stymie drug violence.
  - At the concert, the security guards worked hard to stymie crazed fans from grabbing their idols.
  - The purpose of the therapy is to stymie the growth of the cancer cells.
  - Because Henry wants to stymie his divorce, he is refusing to sign the final papers.
  - The power outage will stymie progress in the computer center.

