ruby/S.html

<div id="outline-container-sec-70" class="outline-2">
<h2 id="sec-70"><span class="section-number-2">70</span> <a href="https://wordsinasentence.com/stocky-in-a-sentence/">Stocky</a></h2>
<div class="outline-text-2" id="text-70">
<p>
<code>sturdy and solid shape usually in humans or animals</code>
</p>

<p>
<code>矮壮的</code>
</p>

<ul class="org-ul">
<li>With a stocky frame, her blind date was rather short but it looked like he could <b>bench press</b> <code>仰卧推举</code> over 200 pounds.
</li>
<li>Even though the stocky dog was a cute poodle, he knocked me over after jumping up on me.
</li>
<li>Sam was picked for the kickball team due to his stocky body type which made his teammates believe he could kick a homerun.
</li>
<li>As the stocky horse rounded the corner of the racetrack, his muscle bulged through his shiny brown fur.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-71" class="outline-2">
<h2 id="sec-71"><span class="section-number-2">71</span> <a href="https://wordsinasentence.com/stodgy-in-a-sentence/">Stodgy</a></h2>
<div class="outline-text-2" id="text-71">
<p>
<code>having old-fashioned beliefs and feelings</code>
</p>

<ul class="org-ul">
<li>The stodgy old man did not believe women should work outside of the home.
</li>
<li>As I looked at the stodgy committee, I knew the members would not be impressed by my unconventional ideas.
</li>
<li>My professor’s pipe and outdated wardrobe gave him a stodgy appearance.
</li>
<li>In my church, the minister maintains the stodgy opinion women should not wear pants.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-72" class="outline-2">
<h2 id="sec-72"><span class="section-number-2">72</span> <a href="https://wordsinasentence.com/stoic-in-a-sentence/">Stoic</a></h2>
<div class="outline-text-2" id="text-72">
<p>
<code>describing one who is not moved by pain or pleasure</code>
</p>

<ul class="org-ul">
<li>My stoic uncle showed no emotion at his wife’s funeral.
</li>
<li>While on camera, the actor played the role of a stoic killer who was not affected by the pain he suffered or inflicted upon others.
</li>
<li>Candace worked hard to maintain her stoic features so others could not see her true feelings.
</li>
<li>As I looked at Alex’s stoic face, I could not tell if he was happy or said.
</li>
<li>The stoic defendant’s facial expression did not change when the judge gave him life in prison.
</li>
<li>When the stoic girl got a spanking, she showed no emotion at all.
</li>
<li>John’s stoic personality causes him to come across as cold and unfeeling.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-73" class="outline-2">
<h2 id="sec-73"><span class="section-number-2">73</span> <a href="https://wordsinasentence.com/stratagem-in-a-sentence/">Stratagem</a></h2>
<div class="outline-text-2" id="text-73">
<p>
<code>a scheme or a clever plot, especially one used to outwit an opponent or achieve a goal</code>
</p>

<ul class="org-ul">
<li>His chess stratagem was so good that he never lost a match.
</li>
<li>Her business stratagem allowed her to quickly rise to the top as a great success.
</li>
<li>With years of tactical experience, the lieutenant used a stratagem to minimize risk of casualties.
</li>
<li>Though he had a clever stratagem, he had underestimated his opponent’s numbers and was faced with defeat.
</li>
<li>Though the villain had a devious stratagem, the hero was able to win in the end.
</li>
<li>With the right stratagem, you can accomplish just about any goal.
</li>
<li>His poker stratagem allowed him to beat his friends nearly every week.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-74" class="outline-2">
<h2 id="sec-74"><span class="section-number-2">74</span> <a href="https://wordsinasentence.com/streak-in-a-sentence/">Streak</a></h2>
<div class="outline-text-2" id="text-74">
<p>
<code>a line of substance that is distinct from the whole. Can be dirt, color, or some other source</code>
</p>

<ul class="org-ul">
<li>In an iconic scene in Harry Potter and the Sorcerer’s Stone, Ron Weasley has a streak of dirt on his cheek.
</li>
<li>Skunks have a streak of white fur down their backs.
</li>
<li>During her date at the Italian restaurant, Janet was so <b>flustered</b> that she dropped her <b>ravioli</b> and it left a streak of red sauce on her white blouse.
</li>
<li>Before dying her whole head, Roxie put a streak of pink in her bangs to test the color.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-75" class="outline-2">
<h2 id="sec-75"><span class="section-number-2">75</span> <a href="https://wordsinasentence.com/strenuous-in-a-sentence/">Strenuous</a></h2>
<div class="outline-text-2" id="text-75">
<p>
<code>requiring a lot of effort</code>
</p>

<ul class="org-ul">
<li>Writing a novel under a tight deadline is a very strenuous task.
</li>
<li>In order to be in the military, one must be prepared for strenuous activity.
</li>
<li>The weightlifter exerted strenuous effort to lift the car off the ground.
</li>
<li>Because I am <b>out of shape</b> <code>胖</code>, I found the two-mile hike to be very strenuous.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-76" class="outline-2">
<h2 id="sec-76"><span class="section-number-2">76</span> <a href="https://wordsinasentence.com/stringent-in-a-sentence/">Stringent</a></h2>
<div class="outline-text-2" id="text-76">
<p>
<code>very strict or severe</code>
</p>

<ul class="org-ul">
<li>I was so happy to move out of my parents’ house and escape their stringent rules.
</li>
<li>When Martha was overweight, her doctor put her on stringent diet that left her feeling hungry all the time.
</li>
<li>Airplanes must pass stringent safety tests before they are allowed to be passenger carriers.
</li>
<li>Since the level of violent crimes has not decreased in years, it appears as if more stringent consequences are necessary for those who commit these awful acts.
</li>
<li>Stringent visa rules are keeping many people from relocating to our country.
</li>
<li>Even though James performed very well as a college undergraduate, he was unable to meet the stringent admission requirements of the medical school.
</li>
<li>Several schools are being closed as a result of the county’s stringent budget crisis.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-77" class="outline-2">
<h2 id="sec-77"><span class="section-number-2">77</span> <a href="https://wordsinasentence.com/stronghold-in-a-sentence/">Stronghold</a></h2>
<div class="outline-text-2" id="text-77">
<p>
<code>heavily reinforced place of protection or center for militia</code>
</p>

<ul class="org-ul">
<li>The stronghold was guarded by hundreds of highly trained soldiers and fortified with reinforced steel.
</li>
<li>They knew that if they could just make it to the stronghold alive that they’d find ample protection and weapons to use against their enemies.
</li>
<li>Every skilled army has a stronghold to hole up in when the battle starts to go downhill.
</li>
<li>The castle’s stronghold was the optimal place to go under siege because it only had one entrance and housed countless deadly weapons.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-78" class="outline-2">
<h2 id="sec-78"><span class="section-number-2">78</span> <a href="https://wordsinasentence.com/stumble-in-a-sentence/">Stumble</a></h2>
<div class="outline-text-2" id="text-78">
<p>
<code>a fall or trip; to lose one's balance</code>
</p>

<ul class="org-ul">
<li>She tripped on a toy and began to stumble down the stairs.
</li>
<li>After he hit his head while playing at the park, he was only able to stumble home to safety.
</li>
<li>She needed practice walking in high heels for her wedding day as she managed to only stumble around in them.
</li>
<li>The runner started to stumble as he approached the finish line.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-79" class="outline-2">
<h2 id="sec-79"><span class="section-number-2">79</span> <a href="https://wordsinasentence.com/stymie-in-a-sentence/">Stymie</a></h2>
<div class="outline-text-2" id="text-79">
<p>
<code>to stand as an obstacle</code>
</p>

<ul class="org-ul">
<li>My rival did everything she could to stymie my efforts to become homecoming queen.
</li>
<li>Since my parents were unhappy about my college choice, they tried to stymie my decision by withholding their financial assistance.
</li>
<li>Some people believe the legalization of marijuana will stymie drug violence.
</li>
<li>At the concert, the security guards worked hard to stymie crazed fans from grabbing their idols.
</li>
<li>The purpose of the therapy is to stymie the growth of the cancer cells.
</li>
<li>Because Henry wants to stymie his divorce, he is refusing to sign the final papers.
</li>
<li>The power outage will stymie progress in the computer center.
</li>
</ul>
</div>
</div>
