ruby/S.org
* [[https://wordsinasentence.com/subdued-in-a-sentence/][Subdued]]

  =held down; overpowered=

  - According to the lawsuit, the officers subdued the suspect with unnecessary force and broke his arm.
  - The kidnapper quickly subdued the small child.
  - Since the dog was not properly subdued with the restraints, it was able to bite the veterinarian.
  - The victim had to be subdued with sedatives before she would calm down enough to answer the investigator’s questions.
  - When the toddler had a tantrum in the parking lot, his father subdued him by wrapping him in a *bear hug*.
  - Even after four *tranquilizer darts*, the huge black bear would not be subdued.
  - After working all night, the firemen finally subdued the gigantic blaze that threatened the entire neighborhood.


* [[https://wordsinasentence.com/subservient-in-a-sentence/][Subservient]]

  =submissive=

  - In the movie, you will play the role of a subservient son who never talks back to his father.
  - The little boy usually became subservient in the presence of bullies.
  - While I do not mind following reasonable orders on occasion, I am far from subservient and will not do everything I am told.
  - The *stuck-up* =自大= singer believed everyone should be subservient to her.
  - If a slave wanted to avoid punishment, he had no choice but to be completely subservient to his owner.
  - The cult leader insisted that all of his followers be subservient and obey his every command.
  - When the *genie* came out of the bottle, she was subservient to her master and fulfilled his every wish.


* [[https://wordsinasentence.com/subsist-in-a-sentence/][Subsist]]

  =to sustain or live upon=

  - The prisoners of war were forced to subsist upon bread and water.
  - Since the roads were closed during the storm, my family had to subsist on biscuits and canned meats for three days.
  - Jeff will have to subsist on ten dollars until he receives his next paycheck.
  - How does the government expect a poor family to subsist on such a tiny amount of financial assistance?

* [[https://wordsinasentence.com/subversive-in-a-sentence/][Subversive]]

  =intended to destroy the power or influence of a government or an established belief=

  - The group published a subversive magazine that contained nothing but negative articles about the current government.
  - On Sunday night, the subversive members of the church usually meet to discuss ways to get rid of their minister.
  - The government closely monitors subversive organizations to see if they pose a threat to the country.
  - In the movie, the dictator sent out troops to kill all of the subversive rebels who were trying to remove him from power.
  - Every day, subversive groups are recruiting young people to join their rebellious organizations.
  - Through its protest, the subversive crowd is displaying its opposition to the government’s crimes against humanity.
  - The professor used his lessons to teach subversive philosophies to his frustrated students who were displeased with the president’s policies.

* [[https://wordsinasentence.com/subvert-in-a-sentence/][Subvert]]

  =to attempt to undercut or overthrow a person or group’s authority=

  - In the movie, the rebels sought to subvert the *tribunal’s* power and replace the body with a democratic government.
  - My stepmother is slowly changing things in our house in an attempt to subvert my mother’s traditions.
  - Since the prince was in a hurry to become king, he planned to subvert his father’s influence by convincing everyone the leader was insane.
  - The dictator ordered the execution of every *insurgent* who sought to subvert his authority.

* [[https://wordsinasentence.com/succinct-in-a-sentence/][Succinct]]

  =expressed in a clear but brief manner=

  - Everyone was happy when the politician made a succinct speech that did not take all evening.
  - The ideal summary is succinct and to the point.
  - Because my students are easily bored, I have to be certain my lessons are succinct.
  - The reviewer’s remarks were succinct and to the point.
  - My literature class is so crowded the teacher insists our presentations be succinct and no more than three minutes in length.
  - During the debate, the politicians only had a few moments to give succinct responses.
  - People who suffer from attention deficit disorders learn best through succinct lectures which do not require them to focus for long periods of time.

* Succor

  - As soon as the news was broadcast, people from the small community were gathering in homes and churches to organize plans for bringing succor to the widows and children of the firefighters.
  - Even though Holly is painfully shy, she is never hesitant to offer succor to anyone who is in pain.
  - Because of its powers to provide emotional succor in times of stress, Paula keeps a drawer full of chocolate at work, in case of emergency.
  - The Red Cross is dedicated to providing succor and support to families who have been displaced by natural disasters.
  - Compared to the indifference paid to returning veterans from the Viet Nam conflict, today’s Americans are more likely to succor soldiers who have served in combat.
  - While they waited for the ambulance to arrive, Beth did whatever she could to succor the people who had been injured in the crash.
  - Even though you may be tempted to succor the baby bird, it would be better if you called a wildlife agency or veterinarian.


* [[https://wordsinasentence.com/succumb-in-a-sentence/][Succumb]]

  =to give up or give in=

  - Although Jerry gave up smoking, there is always a chance he might succumb to his old habit.
  - Sarah is so vain she thinks every man will succumb to her charms.
  - I will not succumb to the temptations offered by the donut shop.
  - The siren was so seductive that all the sailors would succumb to her song and leave their posts.
  - Even though my knee is aching, I will not succumb to the pain and drop out of the race.
  - Gerry lost several friends when he refused to succumb to peer pressure and use drugs.
  - In his speech, the president stated that our country will not succumb to fear and terror.

