ruby/S.html

<div id="outline-container-sec-80" class="outline-2">
<h2 id="sec-80"><span class="section-number-2">80</span> <a href="https://wordsinasentence.com/subdued-in-a-sentence/">Subdued</a></h2>
<div class="outline-text-2" id="text-80">
<p>
<code>held down; overpowered</code>
</p>

<ul class="org-ul">
<li>According to the lawsuit, the officers subdued the suspect with unnecessary force and broke his arm.
</li>
<li>The kidnapper quickly subdued the small child.
</li>
<li>Since the dog was not properly subdued with the restraints, it was able to bite the veterinarian.
</li>
<li>The victim had to be subdued with sedatives before she would calm down enough to answer the investigator’s questions.
</li>
<li>When the toddler had a tantrum in the parking lot, his father subdued him by wrapping him in a <b>bear hug</b>.
</li>
<li>Even after four <b>tranquilizer darts</b>, the huge black bear would not be subdued.
</li>
<li>After working all night, the firemen finally subdued the gigantic blaze that threatened the entire neighborhood.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-81" class="outline-2">
<h2 id="sec-81"><span class="section-number-2">81</span> <a href="https://wordsinasentence.com/subservient-in-a-sentence/">Subservient</a></h2>
<div class="outline-text-2" id="text-81">
<p>
<code>submissive</code>
</p>

<ul class="org-ul">
<li>In the movie, you will play the role of a subservient son who never talks back to his father.
</li>
<li>The little boy usually became subservient in the presence of bullies.
</li>
<li>While I do not mind following reasonable orders on occasion, I am far from subservient and will not do everything I am told.
</li>
<li>The <b>stuck-up</b> <code>自大</code> singer believed everyone should be subservient to her.
</li>
<li>If a slave wanted to avoid punishment, he had no choice but to be completely subservient to his owner.
</li>
<li>The cult leader insisted that all of his followers be subservient and obey his every command.
</li>
<li>When the <b>genie</b> came out of the bottle, she was subservient to her master and fulfilled his every wish.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-82" class="outline-2">
<h2 id="sec-82"><span class="section-number-2">82</span> <a href="https://wordsinasentence.com/subsist-in-a-sentence/">Subsist</a></h2>
<div class="outline-text-2" id="text-82">
<p>
<code>to sustain or live upon</code>
</p>

<ul class="org-ul">
<li>The prisoners of war were forced to subsist upon bread and water.
</li>
<li>Since the roads were closed during the storm, my family had to subsist on biscuits and canned meats for three days.
</li>
<li>Jeff will have to subsist on ten dollars until he receives his next paycheck.
</li>
<li>How does the government expect a poor family to subsist on such a tiny amount of financial assistance?
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-83" class="outline-2">
<h2 id="sec-83"><span class="section-number-2">83</span> <a href="https://wordsinasentence.com/subversive-in-a-sentence/">Subversive</a></h2>
<div class="outline-text-2" id="text-83">
<p>
<code>intended to destroy the power or influence of a government or an established belief</code>
</p>

<ul class="org-ul">
<li>The group published a subversive magazine that contained nothing but negative articles about the current government.
</li>
<li>On Sunday night, the subversive members of the church usually meet to discuss ways to get rid of their minister.
</li>
<li>The government closely monitors subversive organizations to see if they pose a threat to the country.
</li>
<li>In the movie, the dictator sent out troops to kill all of the subversive rebels who were trying to remove him from power.
</li>
<li>Every day, subversive groups are recruiting young people to join their rebellious organizations.
</li>
<li>Through its protest, the subversive crowd is displaying its opposition to the government’s crimes against humanity.
</li>
<li>The professor used his lessons to teach subversive philosophies to his frustrated students who were displeased with the president’s policies.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-84" class="outline-2">
<h2 id="sec-84"><span class="section-number-2">84</span> <a href="https://wordsinasentence.com/subvert-in-a-sentence/">Subvert</a></h2>
<div class="outline-text-2" id="text-84">
<p>
<code>to attempt to undercut or overthrow a person or group’s authority</code>
</p>

<ul class="org-ul">
<li>In the movie, the rebels sought to subvert the <b>tribunal’s</b> power and replace the body with a democratic government.
</li>
<li>My stepmother is slowly changing things in our house in an attempt to subvert my mother’s traditions.
</li>
<li>Since the prince was in a hurry to become king, he planned to subvert his father’s influence by convincing everyone the leader was insane.
</li>
<li>The dictator ordered the execution of every <b>insurgent</b> who sought to subvert his authority.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-85" class="outline-2">
<h2 id="sec-85"><span class="section-number-2">85</span> <a href="https://wordsinasentence.com/succinct-in-a-sentence/">Succinct</a></h2>
<div class="outline-text-2" id="text-85">
<p>
<code>expressed in a clear but brief manner</code>
</p>

<ul class="org-ul">
<li>Everyone was happy when the politician made a succinct speech that did not take all evening.
</li>
<li>The ideal summary is succinct and to the point.
</li>
<li>Because my students are easily bored, I have to be certain my lessons are succinct.
</li>
<li>The reviewer’s remarks were succinct and to the point.
</li>
<li>My literature class is so crowded the teacher insists our presentations be succinct and no more than three minutes in length.
</li>
<li>During the debate, the politicians only had a few moments to give succinct responses.
</li>
<li>People who suffer from attention deficit disorders learn best through succinct lectures which do not require them to focus for long periods of time.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-86" class="outline-2">
<h2 id="sec-86"><span class="section-number-2">86</span> Succor</h2>
<div class="outline-text-2" id="text-86">
<ul class="org-ul">
<li>As soon as the news was broadcast, people from the small community were gathering in homes and churches to organize plans for bringing succor to the widows and children of the firefighters.
</li>
<li>Even though Holly is painfully shy, she is never hesitant to offer succor to anyone who is in pain.
</li>
<li>Because of its powers to provide emotional succor in times of stress, Paula keeps a drawer full of chocolate at work, in case of emergency.
</li>
<li>The Red Cross is dedicated to providing succor and support to families who have been displaced by natural disasters.
</li>
<li>Compared to the indifference paid to returning veterans from the Viet Nam conflict, today’s Americans are more likely to succor soldiers who have served in combat.
</li>
<li>While they waited for the ambulance to arrive, Beth did whatever she could to succor the people who had been injured in the crash.
</li>
<li>Even though you may be tempted to succor the baby bird, it would be better if you called a wildlife agency or veterinarian.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-87" class="outline-2">
<h2 id="sec-87"><span class="section-number-2">87</span> <a href="https://wordsinasentence.com/succumb-in-a-sentence/">Succumb</a></h2>
<div class="outline-text-2" id="text-87">
<p>
<code>to give up or give in</code>
</p>

<ul class="org-ul">
<li>Although Jerry gave up smoking, there is always a chance he might succumb to his old habit.
</li>
<li>Sarah is so vain she thinks every man will succumb to her charms.
</li>
<li>I will not succumb to the temptations offered by the donut shop.
</li>
<li>The siren was so seductive that all the sailors would succumb to her song and leave their posts.
</li>
<li>Even though my knee is aching, I will not succumb to the pain and drop out of the race.
</li>
<li>Gerry lost several friends when he refused to succumb to peer pressure and use drugs.
</li>
<li>In his speech, the president stated that our country will not succumb to fear and terror.
</li>
</ul>
</div>
</div>
