ruby/S.org
* [[https://wordsinasentence.com/suffrage-in-a-sentence/][Suffrage]]

  =the right to participate in making a decision=

  - By allowing employees to leave work early during the elections, the company president is encouraging each employee to use his right of suffrage.
  - If the people in the small country had suffrage, they would remove the evil leader from power.
  - Women who acquired the freedom to vote can thank the female leaders who fought for universal suffrage.
  - On election day Jim will stand in a long line to execute his right of suffrage.
  - In class today, the students learned about the men and women who led the suffrage movement so every vote could be counted.
  - When you cast your vote, you exercise your privilege of suffrage.
  - The school’s mock election is designed to allow students to become voters so they can use their rights of suffrage.

* [[https://wordsinasentence.com/sully-in-a-sentence/][Sully]]

  =to ruin or damage=

  - The accusation of child abuse is sure to sully the teacher’s reputation and cause him his job.
  - If the chemical plant is built near the resort, it will probably sully the clean air in the area.
  - The drug recall will temporarily sully the drug manufacturer’s name and result in a decrease in sales.
  - Because my ex-husband’s wife tried to sully my relationship with my children, I find it difficult to speak to her in a kind manner.


* [[https://wordsinasentence.com/sultry-in-a-sentence/][Sultry]]

  =hot and humid weather=

  - The hot sun and humid air of Florida made for one sultry day.
  - The sultry heat of the city in the summer can be difficult to deal with.
  - With a broken air conditioner, the house was too sultry to stay in.
  - The sultry environment of the greenhouse helped the plants to grow.
  - As a survival expert, he warned his students that shelter could be just as important as water in an unforgiving, sultry environment.
  - He did not enjoy the steam room because he found the sultry temperatures to be quite uncomfortable.
  - Running the oven all day made the air stiff, the house feeling sultry compared to outside.

* [[https://wordsinasentence.com/sumptuous-in-a-sentence/][Sumptuous]]

  =splendid; of the best quality=

  - My eyes grew large when I saw the sumptuous wedding feast.
  - Since the filmmaker only spent a few hours on the movie, he was not surprised to have a finished project that was far from sumptuous.
  - The sumptuous leather coat is sure to cost a great deal of money.
  - Even though the hotel furnishings were quite sumptuous, the décor did not make up for the fact the hotel had not been properly cleaned.
  - Mary had to remember her diet each time she looked at the sumptuous banquets on the cruise ship.
  - Because I love a great breakfast, I was happy I had booked my vacation in a bed-and-breakfast that provided a sumptuous spread each morning.
  - The hotel chef prepared a sumptuous picnic lunch for the newly married couple.

* [[https://wordsinasentence.com/supercilious-in-a-sentence/][Supercilious]]

  =behaving in a way that suggests you think that you are superior to others=

  - Lynda is so supercilious that she refuses to friend anyone outside her race.
  - The supercilious, stuck-up woman demands special treatment for being pretty.
  - Even though he was just as poor as the others, the supercilious man he was superior.
  - The supercilious queen was known as “snobby” because of the way she treated her citizens.
  - His supercilious choice of words undermined everyone else's opinion.
  - You are being supercilious by boasting about your generous salary.
  - The supercilious woman bragged about living in a mansion to everyone at the banquet.

* [[https://wordsinasentence.com/supplant-in-a-sentence/][Supplant]]

  =to kick out or replace in a rough manner=

  - If my stepmother thinks she can supplant my real mother, then she has a rude awakening in her future!
  - A text message cannot supplant an actual phone call because it is incapable of expressing emotion.
  - Because the dictator was afraid his enemies might supplant him, he decided to kill all of his rivals.
  - The army is here to support the local police not to supplant its position as a body of authority.
  - Since I spent all of my bill money, I need to locate funds to supplant those I've wasted.
  - The new iPhone will soon supplant last year’s model and become the most popular mobile device.
  - Because Jackson wants to become head coach, he is doing everything in his power to supplant Max from the position.

* [[https://wordsinasentence.com/supple-in-a-sentence/][Supple]]

  =flexible, easy to bend=

  - Regular yoga will help you to keep a supple form.
  - A good massage will leave you with supple muscles afterwards.
  - It is important to stretch before exercise to keep a supple form.
  - Clay starts out supple, but once it is allowed to dry it becomes hard.
  - Her supple form inspired thoughts in the boy that he did not care to share.
  - Play-Doh is supple and easy for young kids to mold into many different shapes.
  - If you stay supple during exercise it will help you to avoid injury.

* [[https://wordsinasentence.com/suppliant-in-a-sentence/][Suppliant]]

  =pleading, begging=

  - After watching Tucker fail miserably because he had made bold demands, I decided to take a more suppliant tactic in asking for a raise.
  - Meek and suppliant, the best man admitted he had forgotten the ring and begged the bride and groom for forgiveness.
  - In the movie Forrest Gump, Forrest’s mother refuses to be suppliant when she demands what is best for her son, but she does agree to some incentives.
  - The farmers and other members of the community gathered in the church and knelt together to say a suppliant prayer for rain.
  - On Good Friday, many religious pilgrims come to this mountain to make a suppliant climb on their knees to pray at the foot of the cross.
  - Abel approached Rebecca’s father in a courteous, suppliant way to ask for her hand in marriage.
  - Because she was in the mood for lobster, Barbara made a suppliant request for her date to order it for her.

* [[https://wordsinasentence.com/surly-in-a-sentence/][Surly]]

  =ill-tempered and irritable=

  - The surly man was yelling at the waitress because he didn’t get the right order from the restaurant.
  - Your usually cheerful dog may act surly if it has a splinter in its paw.
  - Most people tend to act surly in the morning if they aren’t used to waking up early.
  - Someone with a headache may have surly attitude if everyone around them is too loud.


