ruby/S.html

<div id="outline-container-sec-88" class="outline-2">
<h2 id="sec-88"><span class="section-number-2">88</span> <a href="https://wordsinasentence.com/suffrage-in-a-sentence/">Suffrage</a></h2>
<div class="outline-text-2" id="text-88">
<p>
<code>the right to participate in making a decision</code>
</p>

<ul class="org-ul">
<li>By allowing employees to leave work early during the elections, the company president is encouraging each employee to use his right of suffrage.
</li>
<li>If the people in the small country had suffrage, they would remove the evil leader from power.
</li>
<li>Women who acquired the freedom to vote can thank the female leaders who fought for universal suffrage.
</li>
<li>On election day Jim will stand in a long line to execute his right of suffrage.
</li>
<li>In class today, the students learned about the men and women who led the suffrage movement so every vote could be counted.
</li>
<li>When you cast your vote, you exercise your privilege of suffrage.
</li>
<li>The school’s mock election is designed to allow students to become voters so they can use their rights of suffrage.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-89" class="outline-2">
<h2 id="sec-89"><span class="section-number-2">89</span> <a href="https://wordsinasentence.com/sully-in-a-sentence/">Sully</a></h2>
<div class="outline-text-2" id="text-89">
<p>
<code>to ruin or damage</code>
</p>

<ul class="org-ul">
<li>The accusation of child abuse is sure to sully the teacher’s reputation and cause him his job.
</li>
<li>If the chemical plant is built near the resort, it will probably sully the clean air in the area.
</li>
<li>The drug recall will temporarily sully the drug manufacturer’s name and result in a decrease in sales.
</li>
<li>Because my ex-husband’s wife tried to sully my relationship with my children, I find it difficult to speak to her in a kind manner.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-90" class="outline-2">
<h2 id="sec-90"><span class="section-number-2">90</span> <a href="https://wordsinasentence.com/sultry-in-a-sentence/">Sultry</a></h2>
<div class="outline-text-2" id="text-90">
<p>
<code>hot and humid weather</code>
</p>

<ul class="org-ul">
<li>The hot sun and humid air of Florida made for one sultry day.
</li>
<li>The sultry heat of the city in the summer can be difficult to deal with.
</li>
<li>With a broken air conditioner, the house was too sultry to stay in.
</li>
<li>The sultry environment of the greenhouse helped the plants to grow.
</li>
<li>As a survival expert, he warned his students that shelter could be just as important as water in an unforgiving, sultry environment.
</li>
<li>He did not enjoy the steam room because he found the sultry temperatures to be quite uncomfortable.
</li>
<li>Running the oven all day made the air stiff, the house feeling sultry compared to outside.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-91" class="outline-2">
<h2 id="sec-91"><span class="section-number-2">91</span> <a href="https://wordsinasentence.com/sumptuous-in-a-sentence/">Sumptuous</a></h2>
<div class="outline-text-2" id="text-91">
<p>
<code>splendid; of the best quality</code>
</p>

<ul class="org-ul">
<li>My eyes grew large when I saw the sumptuous wedding feast.
</li>
<li>Since the filmmaker only spent a few hours on the movie, he was not surprised to have a finished project that was far from sumptuous.
</li>
<li>The sumptuous leather coat is sure to cost a great deal of money.
</li>
<li>Even though the hotel furnishings were quite sumptuous, the décor did not make up for the fact the hotel had not been properly cleaned.
</li>
<li>Mary had to remember her diet each time she looked at the sumptuous banquets on the cruise ship.
</li>
<li>Because I love a great breakfast, I was happy I had booked my vacation in a bed-and-breakfast that provided a sumptuous spread each morning.
</li>
<li>The hotel chef prepared a sumptuous picnic lunch for the newly married couple.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-92" class="outline-2">
<h2 id="sec-92"><span class="section-number-2">92</span> <a href="https://wordsinasentence.com/supercilious-in-a-sentence/">Supercilious</a></h2>
<div class="outline-text-2" id="text-92">
<p>
<code>behaving in a way that suggests you think that you are superior to others</code>
</p>

<ul class="org-ul">
<li>Lynda is so supercilious that she refuses to friend anyone outside her race.
</li>
<li>The supercilious, stuck-up woman demands special treatment for being pretty.
</li>
<li>Even though he was just as poor as the others, the supercilious man he was superior.
</li>
<li>The supercilious queen was known as “snobby” because of the way she treated her citizens.
</li>
<li>His supercilious choice of words undermined everyone else's opinion.
</li>
<li>You are being supercilious by boasting about your generous salary.
</li>
<li>The supercilious woman bragged about living in a mansion to everyone at the banquet.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-93" class="outline-2">
<h2 id="sec-93"><span class="section-number-2">93</span> <a href="https://wordsinasentence.com/supplant-in-a-sentence/">Supplant</a></h2>
<div class="outline-text-2" id="text-93">
<p>
<code>to kick out or replace in a rough manner</code>
</p>

<ul class="org-ul">
<li>If my stepmother thinks she can supplant my real mother, then she has a <b>rude awakening</b> <code>如梦初醒</code> in her future!
</li>
<li>A text message cannot supplant an actual phone call because it is incapable of expressing emotion.
</li>
<li>Because the dictator was afraid his enemies might supplant him, he decided to kill all of his rivals.
</li>
<li>The army is here to support the local police not to supplant its position as a body of authority.
</li>
<li>Since I spent all of my bill money, I need to locate funds to supplant those I've wasted.
</li>
<li>The new iPhone will soon supplant last year’s model and become the most popular mobile device.
</li>
<li>Because Jackson wants to become head coach, he is doing everything in his power to supplant Max from the position.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-94" class="outline-2">
<h2 id="sec-94"><span class="section-number-2">94</span> <a href="https://wordsinasentence.com/supple-in-a-sentence/">Supple</a></h2>
<div class="outline-text-2" id="text-94">
<p>
<code>flexible, easy to bend</code>
</p>

<ul class="org-ul">
<li>Regular yoga will help you to keep a supple form.
</li>
<li>A good massage will leave you with supple muscles afterwards.
</li>
<li>It is important to stretch before exercise to keep a supple form.
</li>
<li>Clay starts out supple, but once it is allowed to dry it becomes hard.
</li>
<li>Her supple form inspired thoughts in the boy that he did not care to share.
</li>
<li>Play-Doh is supple and easy for young kids to mold into many different shapes.
</li>
<li>If you stay supple during exercise it will help you to avoid injury.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-95" class="outline-2">
<h2 id="sec-95"><span class="section-number-2">95</span> <a href="https://wordsinasentence.com/suppliant-in-a-sentence/">Suppliant</a></h2>
<div class="outline-text-2" id="text-95">
<p>
<code>pleading, begging</code>
</p>

<ul class="org-ul">
<li>After watching Tucker fail miserably because he had made bold demands, I decided to take a more suppliant tactic in <b>asking for a raise</b> <code>要求加薪</code>.
</li>
<li>Meek and suppliant, the best man admitted he had forgotten the ring and begged the bride and groom for forgiveness.
</li>
<li>In the movie Forrest Gump, Forrest’s mother refuses to be suppliant when she demands what is best for her son, but she does agree to some incentives.
</li>
<li>The farmers and other members of the community gathered in the church and knelt together to say a suppliant prayer for rain.
</li>
<li>On Good Friday, many religious pilgrims come to this mountain to make a suppliant climb on their knees to pray at the foot of the cross.
</li>
<li>Abel approached Rebecca’s father in a courteous, suppliant way to <b>ask for her hand in marriage</b>.
</li>
<li>Because she was in the mood for lobster, Barbara made a suppliant request for her date to order it for her.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-96" class="outline-2">
<h2 id="sec-96"><span class="section-number-2">96</span> <a href="https://wordsinasentence.com/surly-in-a-sentence/">Surly</a></h2>
<div class="outline-text-2" id="text-96">
<p>
<code>ill-tempered and irritable</code>
</p>

<ul class="org-ul">
<li>The surly man was yelling at the waitress because he didn’t get the right order from the restaurant.
</li>
<li>Your usually cheerful dog may act surly if it has a <b>splinter</b> in its paw.
</li>
<li>Most people tend to act surly in the morning if they aren’t used to waking up early.
</li>
<li>Someone with a headache may have surly attitude if everyone around them is too loud.
</li>
</ul>
</div>
</div>
