ruby/S.org
* [[https://wordsinasentence.com/surmount-in-a-sentence/][Surmount]]

  =to conquer a problem or obstacle=

  - Good teachers encourage students to surmount their challenges.
  - By taking a course in French, I hope to be able to surmount the language barrier when I move to Paris.
  - The motivational speaker led Jim to believe he could surmount any personal issues.
  - To become healthy, Ann will need to surmount her poor eating habits.
  - One of Janet’s goals is to surmount her fear of flying so she can finally go to Australia.
  - After being shot in the back, the police officer will have to surmount many difficulties before he can walk again.
  - Because of her mental disability, Cathy had to surmount many challenges to earn her high school diploma.

* [[https://wordsinasentence.com/surreptitious-in-a-sentence/][Surreptitious]]

  =kept secret and marked by quiet and caution=

  - The dog has his surreptitious ways of stealing table scraps behind my back.
  - After hitting the lottery, the private family hoped to keep their surreptitious winnings to themselves.
  - Your surreptitious drug habits will not stay unknown for long.
  - The team began a surreptitious search for the suspect but did not tell the media.
  - Throwing me a surprise birthday party was a surreptitious thing to do!
  - Even though I was careful with the surreptitious information, the media found out about it.
  - Rod Blagojevich had a surreptitious plan to sell the senate seat but was caught and sentenced for doing so.

* [[https://wordsinasentence.com/surrogate-in-a-sentence/][Surrogate]]

  =a substitute (usually of a person, position or role)=

  - Because the couple was unable to conceive, they decided to have a surrogate carry their child.
  - When the juror fell ill, a surrogate was put in his place.
  - The degree given during commencement was a surrogate for the real document.
  - A surrogate caregiver was available when our usual babysitter was not.

* [[https://wordsinasentence.com/sustain-in-a-sentence/][Sustain]]

  =to keep up or support=

  - In order to sustain food supplies throughout the harsh winter, the settlers had to reduce the size of food portions.
  - The loan officer’s plan would allow the farmer to sustain a decent living while paying back the bank.
  - While on the diet, you will realize you can sustain yourself by eating less.
  - Ted cannot sustain his speed in the marathon because he is experiencing severe cramping.

* [[https://wordsinasentence.com/sycophant-in-a-sentence/][Sycophant]]

  =a person who tries to get what they want by excessively praising or complimenting someone in order to make them feel attractive or important=

  - Because she always kisses up to the teacher, Janice is considered the sycophant in first period.
  - My sister is a shallow sycophant who will flatter anyone for a free designer handbag.
  - While it helps to be a sycophant if you want to excel in politics, you can also go far simply by being straightforward with people.
  -  The rapper’s assistant was a sycophant who offered his boss compliments at every turn.
  - Although you are definitely not a sycophant, you do tend to pay a lot of compliments to people in authority.
  - My greedy brother is a sycophant who will admire anything as long as he gets something for his time.
  - When he learned his candidate was predicted to lose the election, the sycophant quickly switched his favor to the predicted campaign winner.

* [[https://wordsinasentence.com/symbiosis-in-a-sentence/][Symbiosis]]

  =relationship of mutual benefit=

  -  The trade that peacefully occurs between the two warring tribes is viewed as an example of symbiosis.
  - At the nursing home, we witnessed an extraordinary symbiosis between young children and senior citizens with each group nurturing each other.
  - The unique voice of each choir member came together in symbiosis to make what sounded like a perfect note to the audience.
  - Because the symbiosis that existed between country record labels and radio stations is not as strong as it once was, we do not hear a lot of country music on the radio today.
  - The symbiosis between the two comedians allowed them to entertain the audience as a solo act instead of as competing performers.
  -  During the long war, the two small nations engaged in a symbiosis that afforded them the strength to beat a much larger foe.
  - Everyone predicts the symbiosis between the candidate and his running mate will allow the two underdogs to carry the election.


* [[https://wordsinasentence.com/sacrament-in-a-sentence/][Sacrament]]

  =a formal religious rite or ceremony=

  - According to the church, April can’t receive the communion sacrament because she is a divorced woman.
  - We stood in front of our families and friends and took the sacrament of marriage.
  - When we knew my mother was about to die, we called the priest to bless her with a sacrament.
  - The baptismal sacrament is a very special event for parents and their newborn children.

* [[https://wordsinasentence.com/sacrilege-in-a-sentence/][Sacrilege]]

  =the corruption of something considered holy=

  - It is considered an act of sacrilege for anyone to touch the sacred statue.
  - Under the old system of punishment, the church leaders would have stoned Ben for his sacrilege.
  - Hank offended everyone in the village when he committed sacrilege by killing the holy cow.
  - According to the scripture, wearing a hat inside the temple is an act of sacrilege.
  - The housing developer committed sacrilege when he uprooted the Indian burial ground.
  - While Jason and I have different spiritual beliefs, we both believe vandalizing a religious building is a type of sacrilege.
  - The filmmaker who made the X-rated movie about Christ has been criticized for sacrilege.

* [[https://wordsinasentence.com/saddle-in-a-sentence/][Saddle]]

  =a leather covered seat used to ride an animal=

  - Placing a saddle on the horses back, the cowboy prepared for his long journey.
  - The rough ride caused the equestrian to slip from the back of the saddle.
  - As the rider swung into the saddle, the horse sidestepped.
  - It took the expert rider less than ten minutes to put the saddle on the horse.

