ruby/S.html


<div id="outline-container-sec-97" class="outline-2">
<h2 id="sec-97"><span class="section-number-2">97</span> <a href="https://wordsinasentence.com/surmount-in-a-sentence/">Surmount</a></h2>
<div class="outline-text-2" id="text-97">
<p>
<code>to conquer a problem or obstacle</code>
</p>

<ul class="org-ul">
<li>Good teachers encourage students to surmount their challenges.
</li>
<li>By taking a course in French, I hope to be able to surmount the language barrier when I move to Paris.
</li>
<li>The <b>motivational speaker</b> <code>励志演说家</code> led Jim to believe he could surmount any personal issues.
</li>
<li>To become healthy, Ann will need to surmount her poor eating habits.
</li>
<li>One of Janet’s goals is to surmount her fear of flying so she can finally go to Australia.
</li>
<li>After being shot in the back, the police officer will have to surmount many difficulties before he can walk again.
</li>
<li>Because of her mental disability, Cathy had to surmount many challenges to earn her high school diploma.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-98" class="outline-2">
<h2 id="sec-98"><span class="section-number-2">98</span> <a href="https://wordsinasentence.com/surreptitious-in-a-sentence/">Surreptitious</a></h2>
<div class="outline-text-2" id="text-98">
<p>
<code>kept secret and marked by quiet and caution</code>
</p>

<ul class="org-ul">
<li>The dog has his surreptitious ways of stealing <b>table scraps</b> <code>残羹剩饭</code> behind my back.
</li>
<li>After hitting the lottery, the private family hoped to keep their surreptitious winnings to themselves.
</li>
<li>Your surreptitious drug habits will not stay unknown for long.
</li>
<li>The team began a surreptitious search for the suspect but did not tell the media.
</li>
<li>Throwing me a surprise birthday party was a surreptitious thing to do!
</li>
<li>Even though I was careful with the surreptitious information, the media found out about it.
</li>
<li>Rod Blagojevich had a surreptitious plan to sell the senate seat but was caught and sentenced for doing so.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-99" class="outline-2">
<h2 id="sec-99"><span class="section-number-2">99</span> <a href="https://wordsinasentence.com/surrogate-in-a-sentence/">Surrogate</a></h2>
<div class="outline-text-2" id="text-99">
<p>
<code>a substitute (usually of a person, position or role)</code>
</p>

<ul class="org-ul">
<li>Because the couple was unable to conceive, they decided to have a surrogate carry their child.
</li>
<li>When the juror fell ill, a surrogate was put in his place.
</li>
<li>The degree given during commencement was a surrogate for the real document.
</li>
<li>A surrogate caregiver was available when our usual babysitter was not.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-100" class="outline-2">
<h2 id="sec-100"><span class="section-number-2">100</span> <a href="https://wordsinasentence.com/sustain-in-a-sentence/">Sustain</a></h2>
<div class="outline-text-2" id="text-100">
<p>
<code>to keep up or support</code>
</p>

<ul class="org-ul">
<li>In order to sustain food supplies throughout the harsh winter, the settlers had to reduce the size of food portions.
</li>
<li>The loan officer’s plan would allow the farmer to sustain a decent living while paying back the bank.
</li>
<li>While on the diet, you will realize you can sustain yourself by eating less.
</li>
<li>Ted cannot sustain his speed in the marathon because he is experiencing severe cramping.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-101" class="outline-2">
<h2 id="sec-101"><span class="section-number-2">101</span> <a href="https://wordsinasentence.com/sycophant-in-a-sentence/">Sycophant</a></h2>
<div class="outline-text-2" id="text-101">
<p>
<code>a person who tries to get what they want by excessively praising or complimenting someone in order to make them feel attractive or important</code>
</p>

<ul class="org-ul">
<li>Because she always <b>kisses up to</b> the teacher, Janice is considered the sycophant in first period.
</li>
<li>My sister is a shallow sycophant who will flatter anyone for a free designer handbag.
</li>
<li>While it helps to be a sycophant if you want to excel in politics, you can also go far simply by being straightforward with people.
</li>
<li>The rapper’s assistant was a sycophant who offered his boss compliments at every turn.
</li>
<li>Although you are definitely not a sycophant, you do tend to pay a lot of compliments to people in authority.
</li>
<li>My greedy brother is a sycophant who will admire anything as long as he gets something for his time.
</li>
<li>When he learned his candidate was predicted to lose the election, the sycophant quickly switched his favor to the predicted campaign winner.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-102" class="outline-2">
<h2 id="sec-102"><span class="section-number-2">102</span> <a href="https://wordsinasentence.com/symbiosis-in-a-sentence/">Symbiosis</a></h2>
<div class="outline-text-2" id="text-102">
<p>
<code>relationship of mutual benefit</code>
</p>

<ul class="org-ul">
<li>The trade that peacefully occurs between the two warring tribes is viewed as an example of symbiosis.
</li>
<li>At the nursing home, we witnessed an extraordinary symbiosis between young children and senior citizens with each group nurturing each other.
</li>
<li>The unique voice of each choir member came together in symbiosis to make what sounded like a perfect note to the audience.
</li>
<li>Because the symbiosis that existed between country <b>record labels</b> <code>唱片公司</code> and radio stations is not as strong as it once was, we do not hear a lot of country music on the radio today.
</li>
<li>The symbiosis between the two comedians allowed them to entertain the audience as a solo act instead of as competing performers.
</li>
<li>During the long war, the two small nations engaged in a symbiosis that afforded them the strength to beat a much larger foe.
</li>
<li>Everyone predicts the symbiosis between the candidate and his <b>running mate</b> <code>竞选伙伴</code> will allow the two <b>underdogs</b> <code>比赛前不被看好的人</code> to carry the election.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-103" class="outline-2">
<h2 id="sec-103"><span class="section-number-2">103</span> <a href="https://wordsinasentence.com/sacrament-in-a-sentence/">Sacrament</a></h2>
<div class="outline-text-2" id="text-103">
<p>
<code>a formal religious *rite* or ceremony</code>
</p>

<ul class="org-ul">
<li>According to the church, April can’t receive the communion sacrament because she is a divorced woman.
</li>
<li>We stood in front of our families and friends and took the sacrament of marriage.
</li>
<li>When we knew my mother was about to die, we called the priest to bless her with a sacrament.
</li>
<li>The baptismal sacrament is a very special event for parents and their newborn children.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-104" class="outline-2">
<h2 id="sec-104"><span class="section-number-2">104</span> <a href="https://wordsinasentence.com/sacrilege-in-a-sentence/">Sacrilege</a></h2>
<div class="outline-text-2" id="text-104">
<p>
<code>the corruption of something considered holy</code>
</p>

<ul class="org-ul">
<li>It is considered an act of sacrilege for anyone to touch the sacred statue.
</li>
<li>Under the old system of punishment, the church leaders would have stoned Ben for his sacrilege.
</li>
<li>Hank offended everyone in the village when he committed sacrilege by killing the holy cow.
</li>
<li>According to the scripture, wearing a hat inside the temple is an act of sacrilege.
</li>
<li>The housing developer committed sacrilege when he uprooted the Indian burial ground.
</li>
<li>While Jason and I have different spiritual beliefs, we both believe vandalizing a religious building is a type of sacrilege.
</li>
<li>The filmmaker who made the X-rated movie about Christ has been criticized for sacrilege.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-105" class="outline-2">
<h2 id="sec-105"><span class="section-number-2">105</span> <a href="https://wordsinasentence.com/saddle-in-a-sentence/">Saddle</a></h2>
<div class="outline-text-2" id="text-105">
<p>
<code>a leather covered seat used to ride an animal</code>
</p>

<ul class="org-ul">
<li>Placing a saddle on the horses back, the cowboy prepared for his long journey.
</li>
<li>The rough ride caused the equestrian to slip from the back of the saddle.
</li>
<li>As the rider swung into the saddle, the horse sidestepped.
</li>
<li>It took the expert rider less than ten minutes to put the saddle on the horse.
</li>
</ul>
</div>
</div>
