ruby/S.org
* [[https://wordsinasentence.com/sag-in-a-sentence/][Sag]]

  =to droop down to a lower level=

  - The sandcastle began to sag in the middle as water filled the top of the construction.
  - The tired worker drifted off to sleep and his eyelids began to droop and sag down low.
  - As the holiday season passed, the store’s sales started to sag.
  - Powerful rain caused the tent to sag down, almost to the point of collapsing.

* [[https://wordsinasentence.com/salve-in-a-sentence/][Salve]]

  =a cream or liniment that is used to moisturize and soothe the skin=

  - Models for the cosmetic company were required to use a salve in order to have flawless skin for the commercials.
  - Almost every day in winter I would need to use salve on my dry, crackling skin so that it would be moisturized.
  - Compared to lotion, the salve contained a higher concentration of oil and wax instead of water.
  - The Miracles Salve Corporation swore that their product would cure any skin condition like psoriasis and eczema.

* [[https://wordsinasentence.com/sangfroid-in-a-sentence/][Sangfroid]]

  =composure that is maintained even under great stress=

  - Even as the building fell around him, the fireman maintained his sangfroid and rescued the little girl.
  - The surgeon knew he had to keep his sangfroid during the complicated surgery.
  - Although Jane was nervous standing in front of the judge, she held on to her sangfroid and did not let her nerves get the best of her.
  - The police officer showed incredible sangfroid when he calmly took on the biker gang without any assistance.
  - At eight, my little girl is already a skilled liar who can keep her sangfroid without blinking during parental interrogation.
  - Jake’s sangfroid led his principal to believe he was not concerned about his suspension.
  - Since the thief had been stealing from art museums for over twenty years, he never lost his sangfroid, not even when he accidentally set off an alarm.

* [[https://wordsinasentence.com/sanity-in-a-sentence/][Sanity]]

  =the condition of being mentally sound=

  - Because the children were eager to get their inheritance, they challenged their elderly mother’s sanity in court.
  - How can I retain my sanity when I have eight small children running around my house making me feel insane?
  - John’s weird behavior is making people question his sanity.
  - Without the psychiatric drugs, I sometimes question my sanity.

* [[https://wordsinasentence.com/sardonic-in-a-sentence/][Sardonic]]

  =displaying disrespect in a scornful way=

  - Jim’s sardonic laugh made his parents angry enough to stop paying his cellphone bill.
  - After Rick was fired from the restaurant, he wrote a sardonic review of the eatery.
  - Female readers were turned off by the newspaper editor’s sardonic column that described violence as the best way to teach a woman.
  - Because Jack spoke to his principal in a sardonic manner, he received a three-day suspension for being disrespectful.
  - The judge responded to the defendant’s sardonic smirk by having him removed from the courtroom.
  - Although my sister spoke in a sardonic voice, I knew she meant no disrespect to me.
  - The comedian was known for his sardonic remarks about his ex-wife.

* [[https://wordsinasentence.com/sartorial-in-a-sentence/][Sartorial]]

  =relating to clothing, fashion or dressing=

  - Those with a developed sartorial sense can tell a cheap suit from an expensive one.
  - He was raised by a tailor, which gave him a sartorial sense for clothing.
  - The emperor had the most splendorous sartorial look no matter what he wore.
  - He always took pride in his clothing, showing a certain sartorial elegance no matter what the occasion.
  - Knitting and sewing are both sartorial skills.
  - As a tailor, he could not help but look at every article of clothing with a sartorial eye.
  - His sartorial sense was unmatched, which allowed him to tell someone’s shirt size with a glance.


* [[https://wordsinasentence.com/sate-in-a-sentence/][Sate]]

  =to satisfy; fill up=

  - My family’s huge get-togethers are filled with so much food, they can sate the hungriest person.
  - I need a glass of ice water to sate my thirst.
  - I couldn’t decide on a meal, so I ordered the tasting menu which was sure to sate my appetite.
  - Because he is always hungry, I will never be able to give my dog enough food to sate him.

* [[https://wordsinasentence.com/saucy-in-a-sentence/][Saucy]]

  =rude and cocky, usually in a lively way=

  - With a saucy attitude, the waitress was able to engage and irritate customers at the same time.
  - The comedian’s saucy one-liners came off as rude to some and entertaining to others.
  - Saucy and sharp-tongued, the feisty girl used her quick wit and temper to protect her heart from others.
  - The once sweet child was now saucy, with a sassy and cheeky response to every question she is asked.


* [[https://wordsinasentence.com/savvy-in-a-sentence/][Savvy]]

  =sharp; perceptive=

  - Your help desk agent should be savvy about all the features of your company’s software.
  - When the savvy investor sold his stock before its value dropped, he made a very profitable transaction.
  - Savvy residents of the city know where to buy the best fruits and vegetables.
  - If your marketing expert is not savvy enough to take advantage of social media advertising, then you need to hire another marketer.

* [[https://wordsinasentence.com/scabrous-in-a-sentence/][Scabrous]]

  =lewd and obscene=

  - The scabrous magazine was regarded as a lecherous and vulgar publication.
  - After a few scabrous jokes, the appalled couple walked out of the offensive comedy show.
  - Some readers found the crude material too scabrous for their taste while others thought the writing was interesting.
  - Indecent drawings filled the scabrous gallery and made even the most open minded viewer blush from embarrassment.


* [[https://wordsinasentence.com/scald-in-a-sentence/][Scald]]

  =to be hurt by a scorching fluid=

  - Even the smallest splash of hot oil on my skin would scald it causing severe burns.
  - Tricia turned the shower’s hot water knob full blast which could scald her scalp.
  - Cooking the meat for twenty minutes longer than the recipe called for would scald it and dry it out.
  - Big spoonfuls of steaming, hot oatmeal scald my tongue and blistered it.

