ruby/S.html

<div id="outline-container-sec-106" class="outline-2">
<h2 id="sec-106"><span class="section-number-2">106</span> <a href="https://wordsinasentence.com/sag-in-a-sentence/">Sag</a></h2>
<div class="outline-text-2" id="text-106">
<p>
<code>to droop down to a lower level</code>
</p>

<ul class="org-ul">
<li>The sandcastle began to sag in the middle as water filled the top of the construction.
</li>
<li>The tired worker <b>drifted off to sleep</b> <code>不知不觉入睡</code> and his eyelids began to droop and sag down low.
</li>
<li>As the holiday season passed, the store’s sales started to sag.
</li>
<li>Powerful rain caused the tent to sag down, almost to the point of collapsing.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-107" class="outline-2">
<h2 id="sec-107"><span class="section-number-2">107</span> <a href="https://wordsinasentence.com/salve-in-a-sentence/">Salve</a></h2>
<div class="outline-text-2" id="text-107">
<p>
<code>a cream or liniment that is used to moisturize and soothe the skin</code>
</p>

<ul class="org-ul">
<li>Models for the cosmetic company were required to use a salve in order to have flawless skin for the commercials.
</li>
<li>Almost every day in winter I would need to use salve on my dry, crackling skin so that it would be moisturized.
</li>
<li>Compared to lotion, the salve contained a higher concentration of oil and wax instead of water.
</li>
<li>The Miracles Salve Corporation swore that their product would cure any skin condition like <b>psoriasis</b> and <b>eczema</b>.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-108" class="outline-2">
<h2 id="sec-108"><span class="section-number-2">108</span> <a href="https://wordsinasentence.com/sangfroid-in-a-sentence/">Sangfroid</a></h2>
<div class="outline-text-2" id="text-108">
<p>
<code>composure that is maintained even under great stress</code>
</p>

<ul class="org-ul">
<li>Even as the building fell around him, the fireman maintained his sangfroid and rescued the little girl.
</li>
<li>The surgeon knew he had to keep his sangfroid during the complicated surgery.
</li>
<li>Although Jane was nervous standing in front of the judge, she held on to her sangfroid and did not let her nerves <b>get the best of her</b>.
</li>
<li>The police officer showed incredible sangfroid when he calmly took on the biker gang without any assistance.
</li>
<li>At eight, my little girl is already a skilled liar who can keep her sangfroid without blinking during parental interrogation.
</li>
<li>Jake’s sangfroid led his principal to believe he was not concerned about his suspension.
</li>
<li>Since the thief had been stealing from art museums for over twenty years, he never lost his sangfroid, not even when he accidentally set off an alarm.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-109" class="outline-2">
<h2 id="sec-109"><span class="section-number-2">109</span> <a href="https://wordsinasentence.com/sanity-in-a-sentence/">Sanity</a></h2>
<div class="outline-text-2" id="text-109">
<p>
<code>the condition of being mentally sound</code>
</p>

<ul class="org-ul">
<li>Because the children were eager to get their inheritance, they challenged their elderly mother’s sanity in court.
</li>
<li>How can I retain my sanity when I have eight small children running around my house making me feel insane?
</li>
<li>John’s weird behavior is making people question his sanity.
</li>
<li>Without the psychiatric drugs, I sometimes question my sanity.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-110" class="outline-2">
<h2 id="sec-110"><span class="section-number-2">110</span> <a href="https://wordsinasentence.com/sardonic-in-a-sentence/">Sardonic</a></h2>
<div class="outline-text-2" id="text-110">
<p>
<code>displaying disrespect in a scornful way</code>
</p>

<ul class="org-ul">
<li>Jim’s sardonic laugh made his parents angry enough to stop paying his cellphone bill.
</li>
<li>After Rick was fired from the restaurant, he wrote a sardonic review of the eatery.
</li>
<li>Female readers were turned off by the newspaper editor’s sardonic column that described violence as the best way to teach a woman.
</li>
<li>Because Jack spoke to his principal in a sardonic manner, he received a three-day suspension for being disrespectful.
</li>
<li>The judge responded to the defendant’s sardonic smirk by having him removed from the courtroom.
</li>
<li>Although my sister spoke in a sardonic voice, I knew she meant no disrespect to me.
</li>
<li>The comedian was known for his sardonic remarks about his ex-wife.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-111" class="outline-2">
<h2 id="sec-111"><span class="section-number-2">111</span> <a href="https://wordsinasentence.com/sartorial-in-a-sentence/">Sartorial</a></h2>
<div class="outline-text-2" id="text-111">
<p>
<code>relating to clothing, fashion or dressing</code>
</p>

<ul class="org-ul">
<li>Those with a developed sartorial sense can tell a cheap suit from an expensive one.
</li>
<li>He was raised by a tailor, which gave him a sartorial sense for clothing.
</li>
<li>The emperor had the most splendorous sartorial look no matter what he wore.
</li>
<li>He always took pride in his clothing, showing a certain sartorial elegance no matter what the occasion.
</li>
<li>Knitting and sewing are both sartorial skills.
</li>
<li>As a tailor, he could not help but look at every article of clothing with a sartorial eye.
</li>
<li>His sartorial sense was unmatched, which allowed him to tell someone’s shirt size with a glance.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-112" class="outline-2">
<h2 id="sec-112"><span class="section-number-2">112</span> <a href="https://wordsinasentence.com/sate-in-a-sentence/">Sate</a></h2>
<div class="outline-text-2" id="text-112">
<p>
<code>to satisfy; fill up</code>
</p>

<ul class="org-ul">
<li>My family’s huge get-togethers are filled with so much food, they can sate the hungriest person.
</li>
<li>I need a glass of ice water to sate my thirst.
</li>
<li>I couldn’t decide on a meal, so I ordered the <b>tasting menu</b> which was sure to sate my appetite.
</li>
<li>Because he is always hungry, I will never be able to give my dog enough food to sate him.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-113" class="outline-2">
<h2 id="sec-113"><span class="section-number-2">113</span> <a href="https://wordsinasentence.com/saucy-in-a-sentence/">Saucy</a></h2>
<div class="outline-text-2" id="text-113">
<p>
<code>rude and cocky, usually in a lively way</code>
</p>

<ul class="org-ul">
<li>With a saucy attitude, the waitress was able to engage and irritate customers at the same time.
</li>
<li>The comedian’s saucy <b>one-liners</b> <code>俏皮话</code> came off as rude to some and entertaining to others.
</li>
<li>Saucy and sharp-tongued, the feisty girl used her quick wit and temper to protect her heart from others.
</li>
<li>The once sweet child was now saucy, with a <b>sassy</b> and cheeky response to every question she is asked.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-114" class="outline-2">
<h2 id="sec-114"><span class="section-number-2">114</span> <a href="https://wordsinasentence.com/savvy-in-a-sentence/">Savvy</a></h2>
<div class="outline-text-2" id="text-114">
<p>
<code>sharp; perceptive</code>
</p>

<ul class="org-ul">
<li>Your help desk agent should be savvy about all the features of your company’s software.
</li>
<li>When the savvy investor sold his stock before its value dropped, he made a very profitable transaction.
</li>
<li>Savvy residents of the city know where to buy the best fruits and vegetables.
</li>
<li>If your marketing expert is not savvy enough to take advantage of social media advertising, then you need to hire another marketer.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-115" class="outline-2">
<h2 id="sec-115"><span class="section-number-2">115</span> <a href="https://wordsinasentence.com/scabrous-in-a-sentence/">Scabrous</a></h2>
<div class="outline-text-2" id="text-115">
<p>
<code>lewd and obscene</code>
</p>

<ul class="org-ul">
<li>The scabrous magazine was regarded as a <b>lecherous</b> and vulgar publication.
</li>
<li>After a few scabrous jokes, the appalled couple walked out of the offensive comedy show.
</li>
<li>Some readers found the crude material too scabrous for their taste while others thought the writing was interesting.
</li>
<li>Indecent drawings filled the scabrous gallery and made even the most open minded viewer blush from embarrassment.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-116" class="outline-2">
<h2 id="sec-116"><span class="section-number-2">116</span> <a href="https://wordsinasentence.com/scald-in-a-sentence/">Scald</a></h2>
<div class="outline-text-2" id="text-116">
<p>
<code>to be hurt by a scorching fluid</code>
</p>

<ul class="org-ul">
<li>Even the smallest splash of hot oil on my skin would scald it causing severe burns.
</li>
<li>Tricia turned the shower’s hot water <b>knob</b> <b>full blast</b> <code>全速冲刺</code> which could scald her scalp.
</li>
<li>Cooking the meat for twenty minutes longer than the recipe called for would scald it and dry it out.
</li>
<li>Big spoonfuls of steaming, hot oatmeal scald my tongue and <b>blistered</b> it.
</li>
</ul>
</div>
</div>
