ruby/S.org
* [[https://wordsinasentence.com/scamp-in-a-sentence/][Scamp]]

  =A playfully mischievous child=

  - While his parents were sleeping, the little scamp snuck into the cabinet and ate all of the cookies.
  - The little scamp was notorious for playing practical jokes on all of his classmates.
  - Hiding in the barn, the little scamp had his father worried sick about his whereabouts.
  - The family’s oldest son was serious, but their youngest child was a fun-loving scamp with a playful personality.


* [[https://wordsinasentence.com/scamper-in-a-sentence/][Scamper]]

  =to move quickly with light steps=

  - Watching the squirrel scamper up the sidewalk was the highlight of the toddler’s day.
  - After eating his lunch, the boy couldn’t wait to scamper outside to play.
  - The puppy tried to scamper over the pile of leaves but ended up making a huge mess in the yard.
  - The runaway was able to scamper a few miles through the woods before she was discovered by the search party.

* [[https://wordsinasentence.com/scintillating-in-a-sentence/][Scintillating]]

  =remarkably witty=

  - The host’s scintillating conversations with celebrities have earned her numerous awards.
  - During the interview, the clever comedian came up with one scintillating response after another.
  - The professor’s lecture on genetic mutation was far from scintillating and put most of the class to sleep.
  - After the critic saw the play, he described it as a scintillating masterpiece that captivates with each line of witty dialogue.
  - The drunks at the bar are impressed by their own scintillating chatter.
  - During the comedic roast, the entertainer was amused by his friends’ scintillating comments about his personal life.
  - The comedy show’s ratings have dropped because the sketches are not as scintillating as they once were.

* [[https://wordsinasentence.com/scowl-in-a-sentence/][Scowl]]

  =a frown of anger or displeasure=

  - Whenever my husband looks at our noisy neighbors, he has a scowl on his face.
  - The teacher’s scowl was a warning to the misbehaving students.
  - As soon as I saw the scowl on the policeman’s face, I knew I was in a great deal of trouble.
  - It was obvious from the scowl on Heather’s face she was quite angry.
  - If Cathy thought her scowl would scare her admirer, she was wrong because the man found her grimace very attractive.
  - An offer of a free meal turned the unhappy customer’s scowl into a smile.
  - Although the mean judge always has a scowl on his face, he enjoys his work and takes pride in discovering talented singers.



* [[https://wordsinasentence.com/scribble-in-a-sentence/][Scribble]]

  =to write or draw something quickly or without much focus=

  - I was bored in class, so I drew a little scribble on the back of my worksheet to pass the time, though I can’t remember what I drew.
  - A toddler may draw with a crayon or chalk, but considering their lack of focus they usually do little more than scribble.
  - I was paying attention to my professor’s lecture, but I nevertheless chose to scribble a few doodles in my notebook to keep me entertained.
  - In his haste, he could only scribble the number his friend told him to remember in a quick, messy note on a napkin.

* [[https://wordsinasentence.com/scrumptious-in-a-sentence/][Scrumptious]]

  =delicious; mouthwatering=

  - Placing her nose up to the apple pie, the pastry chef got a whiff of the scrumptious smelling tart.
  - The picky eater was surprised at how tastily scrumptious the delectable danish was.
  - Even though I love my mother’s scrumptious macaroni and cheese, my low-carb diet makes it off limits.
  - James finds octopus a scrumptious delicacy, while his wife thinks eating the eight-legged creature is disgusting.




* [[https://wordsinasentence.com/scurry-in-a-sentence/][Scurry]]

  =to move rapidly using small steps=

  - The mouse tried to scurry under the door.
  - When the bank robber was shot, he could only scurry to his getaway car.
  - It is fun to watch the penguins scurry on the ice blocks.
  - Whenever the doorbell rings, the elderly butler will scurry to the front door.

* [[https://wordsinasentence.com/scurvy-in-a-sentence/][Scurvy]]

  =deficiency of vitamin C=

  - Many sailors died of scurvy due to lack of access to nutritional food.
  - Once the doctor looked at the patient’s bleeding gums and missing teeth, he knew the patient had scurvy.
  - Eating citrus fruits is a good way to prevent scurvy.
  - After the period of famine, many citizens of the country developed scurvy.

* [[https://wordsinasentence.com/scuttle-in-a-sentence/][Scuttle]]

  =to scamper or dash=

  - Because I was running late, I had to scuttle through the airport parking lot.
  - Cara prepared to mop her kitchen floor as she heard the children scuttle in from the downpour.
  - When the cook turned on the light in the kitchen, he saw a mouse scuttle under the refrigerator.
  - As soon as the whistle is blown, the children will scuttle across the park in search of Easter eggs.


* [[https://wordsinasentence.com/seafaring-in-a-sentence/][Seafaring]]

  =sailing through waters on a regular basis=

  - Seafaring merchants during the Renaissance would often travel throughout Europe and Asia to bring new inaccessible products to foreign customers.
  - Located on the coast of the Mediterranean Sea, Phoenicians were known as a shipbuilding civilization during this seafaring time.
  - The Gold Rush of 1849 convinced many immigrants to travel by a seafaring way to California around South America.
  - Seafaring jobs are in high demand for those who enjoy working with marine life or navigating yachts.

* [[https://wordsinasentence.com/seam-in-a-sentence/][Seam]]

  =the edge where two pieces of material are stitched together=

  - A seam of the undershirt was quite noticeable through the thin flimsy silk blouse.
  - Once the seamstress unstitched the last seam of the dress pants, she used it as a pattern to create another pair of dress pants.
  - Taking the suit’s jacket to the sewing machine, the taylor sewed the back of the jacket to the side piece of fabric at the seam.
  - Bobby was such a playful young boy that his mother was always repairing the torn seam on his pants on a daily basis.


