ruby/S.html

<div id="outline-container-sec-117" class="outline-2">
<h2 id="sec-117"><span class="section-number-2">117</span> <a href="https://wordsinasentence.com/scamp-in-a-sentence/">Scamp</a></h2>
<div class="outline-text-2" id="text-117">
<p>
<code>A playfully mischievous child</code>
</p>

<ul class="org-ul">
<li>While his parents were sleeping, the little scamp snuck into the cabinet and ate all of the cookies.
</li>
<li>The little scamp was notorious for playing practical jokes on all of his classmates.
</li>
<li>Hiding in the barn, the little scamp had his father worried sick about his whereabouts.
</li>
<li>The family’s oldest son was serious, but their youngest child was a fun-loving scamp with a playful personality.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-118" class="outline-2">
<h2 id="sec-118"><span class="section-number-2">118</span> <a href="https://wordsinasentence.com/scamper-in-a-sentence/">Scamper</a></h2>
<div class="outline-text-2" id="text-118">
<p>
<code>to move quickly with light steps</code>
</p>

<ul class="org-ul">
<li>Watching the squirrel scamper up the sidewalk was the highlight of the toddler’s day.
</li>
<li>After eating his lunch, the boy couldn’t wait to scamper outside to play.
</li>
<li>The puppy tried to scamper over the pile of leaves but ended up making a huge mess in the yard.
</li>
<li>The runaway was able to scamper a few miles through the woods before she was discovered by the search party.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-119" class="outline-2">
<h2 id="sec-119"><span class="section-number-2">119</span> <a href="https://wordsinasentence.com/scintillating-in-a-sentence/">Scintillating</a></h2>
<div class="outline-text-2" id="text-119">
<p>
<code>remarkably witty</code>
</p>

<ul class="org-ul">
<li>The host’s scintillating conversations with celebrities have earned her numerous awards.
</li>
<li>During the interview, the clever comedian came up with one scintillating response after another.
</li>
<li>The professor’s lecture on genetic mutation was far from scintillating and put most of the class to sleep.
</li>
<li>After the critic saw the play, he described it as a scintillating masterpiece that captivates with each line of witty dialogue.
</li>
<li>The drunks at the bar are impressed by their own scintillating chatter.
</li>
<li>During the comedic roast, the entertainer was amused by his friends’ scintillating comments about his personal life.
</li>
<li>The comedy show’s ratings have dropped because the <b>sketches</b> <code>幽默短剧</code> are not as scintillating as they once were.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-120" class="outline-2">
<h2 id="sec-120"><span class="section-number-2">120</span> <a href="https://wordsinasentence.com/scowl-in-a-sentence/">Scowl</a></h2>
<div class="outline-text-2" id="text-120">
<p>
<code>a frown of anger or displeasure</code>
</p>

<ul class="org-ul">
<li>Whenever my husband looks at our noisy neighbors, he has a scowl on his face.
</li>
<li>The teacher’s scowl was a warning to the misbehaving students.
</li>
<li>As soon as I saw the scowl on the policeman’s face, I knew I was in a great deal of trouble.
</li>
<li>It was obvious from the scowl on Heather’s face she was quite angry.
</li>
<li>If Cathy thought her scowl would scare her admirer, she was wrong because the man found her <b>grimace</b> very attractive.
</li>
<li>An offer of a free meal turned the unhappy customer’s scowl into a smile.
</li>
<li>Although the mean judge always has a scowl on his face, he enjoys his work and takes pride in discovering talented singers.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-121" class="outline-2">
<h2 id="sec-121"><span class="section-number-2">121</span> <a href="https://wordsinasentence.com/scribble-in-a-sentence/">Scribble</a></h2>
<div class="outline-text-2" id="text-121">
<p>
<code>to write or draw something quickly or without much focus</code>
</p>

<ul class="org-ul">
<li>I was bored in class, so I drew a little scribble on the back of my worksheet to pass the time, though I can’t remember what I drew.
</li>
<li>A toddler may draw with a crayon or chalk, but considering their lack of focus they usually do little more than scribble.
</li>
<li>I was paying attention to my professor’s lecture, but I nevertheless chose to scribble a few doodles in my notebook to keep me entertained.
</li>
<li>In his haste, he could only scribble the number his friend told him to remember in a quick, messy note on a napkin.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-122" class="outline-2">
<h2 id="sec-122"><span class="section-number-2">122</span> <a href="https://wordsinasentence.com/scrumptious-in-a-sentence/">Scrumptious</a></h2>
<div class="outline-text-2" id="text-122">
<p>
<code>delicious; mouthwatering</code>
</p>

<ul class="org-ul">
<li>Placing her nose up to the apple pie, the pastry chef got <b>a whiff of</b> the scrumptious smelling tart.
</li>
<li>The picky eater was surprised at how tastily scrumptious the <b>delectable</b> <code>美味的</code> <b>danish</b> <code>丹麦酥</code> was.
</li>
<li>Even though I love my mother’s scrumptious <b>macaroni</b> and cheese, my low-carb diet makes it off limits.
</li>
<li>James finds octopus a scrumptious delicacy, while his wife thinks eating the eight-legged creature is disgusting.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-123" class="outline-2">
<h2 id="sec-123"><span class="section-number-2">123</span> <a href="https://wordsinasentence.com/scurry-in-a-sentence/">Scurry</a></h2>
<div class="outline-text-2" id="text-123">
<p>
<code>to move rapidly using small steps</code>
</p>

<ul class="org-ul">
<li>The mouse tried to scurry under the door.
</li>
<li>When the bank robber was shot, he could only scurry to his getaway car.
</li>
<li>It is fun to watch the penguins scurry on the ice blocks.
</li>
<li>Whenever the doorbell rings, the elderly butler will scurry to the front door.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-124" class="outline-2">
<h2 id="sec-124"><span class="section-number-2">124</span> <a href="https://wordsinasentence.com/scurvy-in-a-sentence/">Scurvy</a></h2>
<div class="outline-text-2" id="text-124">
<p>
<code>deficiency of vitamin C</code>
</p>

<ul class="org-ul">
<li>Many sailors died of scurvy due to lack of access to nutritional food.
</li>
<li>Once the doctor looked at the patient’s bleeding gums and missing teeth, he knew the patient had scurvy.
</li>
<li>Eating <b>citrus</b> <code>柑橘类果实</code> fruits is a good way to prevent scurvy.
</li>
<li>After the period of famine, many citizens of the country developed scurvy.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-125" class="outline-2">
<h2 id="sec-125"><span class="section-number-2">125</span> <a href="https://wordsinasentence.com/scuttle-in-a-sentence/">Scuttle</a></h2>
<div class="outline-text-2" id="text-125">
<p>
<code>to scamper or dash</code>
</p>

<ul class="org-ul">
<li>Because I was running late, I had to scuttle through the airport parking lot.
</li>
<li>Cara prepared to mop her kitchen floor as she heard the children scuttle in from the downpour.
</li>
<li>When the cook turned on the light in the kitchen, he saw a mouse scuttle under the refrigerator.
</li>
<li>As soon as the whistle is blown, the children will scuttle across the park in search of Easter eggs.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-126" class="outline-2">
<h2 id="sec-126"><span class="section-number-2">126</span> <a href="https://wordsinasentence.com/seafaring-in-a-sentence/">Seafaring</a></h2>
<div class="outline-text-2" id="text-126">
<p>
<code>sailing through waters on a regular basis</code>
</p>

<ul class="org-ul">
<li>Seafaring merchants during the Renaissance would often travel throughout Europe and Asia to bring new inaccessible products to foreign customers.
</li>
<li>Located on the coast of the Mediterranean Sea, Phoenicians were known as a shipbuilding civilization during this seafaring time.
</li>
<li>The Gold Rush of 1849 convinced many immigrants to travel by a seafaring way to California around South America.
</li>
<li>Seafaring jobs are in high demand for those who enjoy working with marine life or navigating yachts.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-127" class="outline-2">
<h2 id="sec-127"><span class="section-number-2">127</span> <a href="https://wordsinasentence.com/seam-in-a-sentence/">Seam</a></h2>
<div class="outline-text-2" id="text-127">
<p>
<code>the edge where two pieces of material are stitched together</code>
</p>

<ul class="org-ul">
<li>A seam of the undershirt was quite noticeable through the thin flimsy silk blouse.
</li>
<li>Once the <b>seamstress</b> unstitched the last seam of the dress pants, she used it as a pattern to create another pair of dress pants.
</li>
<li>Taking the suit’s jacket to the sewing machine, the taylor sewed the back of the jacket to the side piece of fabric at the seam.
</li>
<li>Bobby was such a playful young boy that his mother was always repairing the torn seam on his pants on a daily basis.
</li>
</ul>
</div>
</div>
