ruby/S.org
* [[https://wordsinasentence.com/sear-in-a-sentence/][Sear]]

  =to char, scorch, or burn the surface of something with quick heat=

  - The chef placed the steak in the hot pan to sear the outside.
  - The man needed to wear protective clothing and glasses so that the heat from soldering would not sear his skin and eyes.
  - She threw the envelope into the fire in order to sear it beyond recognition.
  - The fire from the grill burst into flame, causing his eyebrows to sear.

* [[https://wordsinasentence.com/secretive-in-a-sentence/][Secretive]]

  =describes someone who hides their intentions, thoughts, and actions from other people=

  - Secretive sorority sisters whispered in the hallway about new pledges and upcoming events.
  - Although his sister shared her feelings openly, the man was quite secretive about his plans for spring break.
  - A secretive group of mobsters were doing the dirty work while the boss got all of the credit.
  - A breakout news article threatened to expose the secretive motives of the mayor and her husband.

* [[https://wordsinasentence.com/seep-in-a-sentence/][Seep]]

  =to slowly flow through a small opening=

  - After hitting the bump in the road, oil began to seep out of my car’s radiator.
  - Water began to seep out of the bottom of the trash bag and all over the kitchen floor.
  - With no holes at the bottom of the flower pot, there was no way for all of the rain water to seep out.
  - A manufacturing flaw in the engine caused fluid to seep out of the correct compartment.


* [[https://wordsinasentence.com/senile-in-a-sentence/][Senile]]

  =confused or memory loss as a result of old age=

  - I think my Grandma is going senile because she keeps forgetting her daughter's name.
  - It was clear that Agatha had gone senile after trying to put her cat in the microwave.
  - Because memory loss and confusion runs in her family history, Linda worries that she may also become senile in old age.
  - Keep your aging brain engaged so you stay sharp and reduce the chances of becoming senile.

* [[https://wordsinasentence.com/sententious-in-a-sentence/][Sententious]]

  =using few words, often in a preachy manner=

  - Because the minister was in a hurry to get home to watch the football game, he gave a sententious sermon about the importance of valuing time.
  - The talk show host offended many audience members when he made sententious comments criticizing their beliefs.
  - Since Cara believes she is better than everyone else, she frequently makes sententious statements that describe the faults of others.
  - The angry politician responded to the media’s question with a sententious remark that made him come across as a jerk.
  - Because Alan hates to speak in public, he normally makes his speeches sententious and to the point.
  - The professor’s sententious lecture was so short that students left the classroom complaining about their lack of knowledge.
  - Although my sister is only a year older than me, she often speaks in a sententious tone to imply she is much older than she is.

* [[https://wordsinasentence.com/sequacious-in-a-sentence/][Sequacious]]

  =tending to follow; missing original thoughts or independence=

  - Because the girl was sequacious, she usually went along with the other students and never voiced a conflicting opinion.
  - My father always does what my mother says so I see him as having a sequacious nature.
  - When will you stop being a sheep and become sequacious enough to choose your own path?
  - The sequacious boy kept his opinion to himself as the members of his group decided on a research topic.


* [[https://wordsinasentence.com/sere-in-a-sentence/][Sere]]

  =dry and withered=

  - The sere leaves that covered the ground were once healthy, but are now dry and brittle.
  - A far cry from the healthy yield he expected, the farmer was shocked by the sere and withered grains occupying his field.
  - Field after field were full of sere grain that was scorched by the excruciating heat.
  - Juicy grapes withered into the sere but useful raisins that Grandmother used to make her delicious pie.

* [[https://wordsinasentence.com/serenade-in-a-sentence/][Serenade]]

  =to perform a song for a special person=

  - More than anything my mother wants my father to serenade her by singing her favorite song at their anniversary dinner.
  - The singer will serenade one special fan during the concert.
  - Before Ted decides to serenade his blind date, he should know she is deaf and will probably not appreciate his gesture.
  - The band will serenade the birthday girl after the waitress brings her cake.

* [[https://wordsinasentence.com/serpentine-in-a-sentence/][Serpentine]]

  =marked by a twisting appearance, like the form of a serpent=

  - The serpentine lake twists through the region providing the entire area with water.
  - Because the road is quite serpentine and winding, some people feel lightheaded when riding on it.
  - The stake was made in a serpentine fashion with a coil design so it could be firmly implanted in the ground.
  - I started to scream as soon as I saw the serpentine creature that was shaped like a snake.

* [[https://wordsinasentence.com/serried-in-a-sentence/][Serried]]

  =rows of people or objects grouped together=

  - Grandfather’s garden is serried in five rows, but it is too overgrown to notice.
  - The collector kept his assortments serried alphabetically so he’d always know where everything was.
  - The soldiers stood in serried ranks as they waited for their commanding officers.
  - The classroom was serried, with the students’ desks aligned neatly in rows.

* [[https://wordsinasentence.com/sever-in-a-sentence/][Sever]]

  =to detach by cutting figuratively or literally=

  - National leaders may sever ties with other countries who do not properly negotiate trade with them.
  - Sever your unhealthy ways by removing them out of your life one bad habit at a time.
  - Predators have teeth designed to sever their prey when they need food to eat.
  - With winter looming, the homeowner decided to sever a tree and use it for firewood.

