ruby/S.html


<div id="outline-container-sec-128" class="outline-2">
<h2 id="sec-128"><span class="section-number-2">128</span> <a href="https://wordsinasentence.com/sear-in-a-sentence/">Sear</a></h2>
<div class="outline-text-2" id="text-128">
<p>
<code>to char, scorch, or burn the surface of something with quick heat</code>
</p>

<ul class="org-ul">
<li>The chef placed the steak in the hot pan to sear the outside.
</li>
<li>The man needed to wear protective clothing and glasses so that the heat from soldering would not sear his skin and eyes.
</li>
<li>She threw the envelope into the fire in order to sear it beyond recognition.
</li>
<li>The fire from the grill burst into flame, causing his eyebrows to sear.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-129" class="outline-2">
<h2 id="sec-129"><span class="section-number-2">129</span> <a href="https://wordsinasentence.com/secretive-in-a-sentence/">Secretive</a></h2>
<div class="outline-text-2" id="text-129">
<p>
<code>describes someone who hides their intentions, thoughts, and actions from other people</code>
</p>

<ul class="org-ul">
<li>Secretive <b>sorority</b> <code>女生联谊会</code> sisters whispered in the hallway about new pledges and upcoming events.
</li>
<li>Although his sister shared her feelings openly, the man was quite secretive about his plans for spring break.
</li>
<li>A secretive group of mobsters were doing the dirty work while the boss got all of the credit.
</li>
<li>A breakout news article threatened to expose the secretive motives of the mayor and her husband.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-130" class="outline-2">
<h2 id="sec-130"><span class="section-number-2">130</span> <a href="https://wordsinasentence.com/seep-in-a-sentence/">Seep</a></h2>
<div class="outline-text-2" id="text-130">
<p>
<code>to slowly flow through a small opening</code>
</p>

<ul class="org-ul">
<li>After hitting the bump in the road, oil began to seep out of my car’s radiator.
</li>
<li>Water began to seep out of the bottom of the trash bag and all over the kitchen floor.
</li>
<li>With no holes at the bottom of the flower pot, there was no way for all of the rain water to seep out.
</li>
<li>A manufacturing flaw in the engine caused fluid to seep out of the correct compartment.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-131" class="outline-2">
<h2 id="sec-131"><span class="section-number-2">131</span> <a href="https://wordsinasentence.com/senile-in-a-sentence/">Senile</a></h2>
<div class="outline-text-2" id="text-131">
<p>
<code>confused or memory loss as a result of old age</code>
</p>

<ul class="org-ul">
<li>I think my Grandma is going senile because she keeps forgetting her daughter's name.
</li>
<li>It was clear that Agatha had gone senile after trying to put her cat in the microwave.
</li>
<li>Because memory loss and confusion runs in her family history, Linda worries that she may also become senile in old age.
</li>
<li>Keep your aging brain engaged so you stay sharp and reduce the chances of becoming senile.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-132" class="outline-2">
<h2 id="sec-132"><span class="section-number-2">132</span> <a href="https://wordsinasentence.com/sententious-in-a-sentence/">Sententious</a></h2>
<div class="outline-text-2" id="text-132">
<p>
<code>using few words, often in a preachy manner</code>
</p>

<ul class="org-ul">
<li>Because the minister was in a hurry to get home to watch the football game, he gave a sententious sermon about the importance of valuing time.
</li>
<li>The talk show host offended many audience members when he made sententious comments criticizing their beliefs.
</li>
<li>Since Cara believes she is better than everyone else, she frequently makes sententious statements that describe the faults of others.
</li>
<li>The angry politician responded to the media’s question with a sententious remark that made him come across as a jerk.
</li>
<li>Because Alan hates to speak in public, he normally makes his speeches sententious and to the point.
</li>
<li>The professor’s sententious lecture was so short that students left the classroom complaining about their lack of knowledge.
</li>
<li>Although my sister is only a year older than me, she often speaks in a sententious tone to imply she is much older than she is.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-133" class="outline-2">
<h2 id="sec-133"><span class="section-number-2">133</span> <a href="https://wordsinasentence.com/sequacious-in-a-sentence/">Sequacious</a></h2>
<div class="outline-text-2" id="text-133">
<p>
<code>tending to follow; missing original thoughts or independence</code>
</p>

<ul class="org-ul">
<li>Because the girl was sequacious, she usually went along with the other students and never voiced a conflicting opinion.
</li>
<li>My father always does what my mother says so I see him as having a sequacious nature.
</li>
<li>When will you stop being a sheep and become sequacious enough to choose your own path?
</li>
<li>The sequacious boy kept his opinion to himself as the members of his group decided on a research topic.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-134" class="outline-2">
<h2 id="sec-134"><span class="section-number-2">134</span> <a href="https://wordsinasentence.com/sere-in-a-sentence/">Sere</a></h2>
<div class="outline-text-2" id="text-134">
<p>
<code>dry and withered</code>
</p>

<ul class="org-ul">
<li>The sere leaves that covered the ground were once healthy, but are now dry and <b>brittle</b>.
</li>
<li>A <b>far cry</b> <code>天壤之别</code> from the healthy yield he expected, the farmer was shocked by the sere and withered grains occupying his field.
</li>
<li>Field after field were full of sere grain that was scorched by the excruciating heat.
</li>
<li>Juicy grapes withered into the sere but useful raisins that Grandmother used to make her delicious pie.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-135" class="outline-2">
<h2 id="sec-135"><span class="section-number-2">135</span> <a href="https://wordsinasentence.com/serenade-in-a-sentence/">Serenade</a></h2>
<div class="outline-text-2" id="text-135">
<p>
<code>to perform a song for a special person</code>
</p>

<ul class="org-ul">
<li><b>More than anything</b> <code>最重要的是</code> my mother wants my father to serenade her by singing her favorite song at their anniversary dinner.
</li>
<li>The singer will serenade one special fan during the concert.
</li>
<li>Before Ted decides to serenade his blind date, he should know she is deaf and will probably not appreciate his gesture.
</li>
<li>The band will serenade the birthday girl after the waitress brings her cake.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-136" class="outline-2">
<h2 id="sec-136"><span class="section-number-2">136</span> <a href="https://wordsinasentence.com/serpentine-in-a-sentence/">Serpentine</a></h2>
<div class="outline-text-2" id="text-136">
<p>
<code>marked by a twisting appearance, like the form of a serpent</code>
</p>

<ul class="org-ul">
<li>The serpentine lake twists through the region providing the entire area with water.
</li>
<li>Because the road is quite serpentine and winding, some people feel lightheaded when riding on it.
</li>
<li>The stake was made in a serpentine fashion with a coil design so it could be firmly implanted in the ground.
</li>
<li>I started to scream as soon as I saw the serpentine creature that was shaped like a snake.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-137" class="outline-2">
<h2 id="sec-137"><span class="section-number-2">137</span> <a href="https://wordsinasentence.com/serried-in-a-sentence/">Serried</a></h2>
<div class="outline-text-2" id="text-137">
<p>
<code>rows of people or objects grouped together</code>
</p>

<ul class="org-ul">
<li>Grandfather’s garden is serried in five rows, but it is too overgrown to notice.
</li>
<li>The collector kept his assortments serried alphabetically so he’d always know where everything was.
</li>
<li>The soldiers stood in serried ranks as they waited for their commanding officers.
</li>
<li>The classroom was serried, with the students’ desks aligned neatly in rows.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-138" class="outline-2">
<h2 id="sec-138"><span class="section-number-2">138</span> <a href="https://wordsinasentence.com/sever-in-a-sentence/">Sever</a></h2>
<div class="outline-text-2" id="text-138">
<p>
<code>to detach by cutting *figuratively* or literally</code>
</p>

<ul class="org-ul">
<li>National leaders may sever ties with other countries who do not properly negotiate trade with them.
</li>
<li>Sever your unhealthy ways by removing them out of your life one bad habit at a time.
</li>
<li>Predators have teeth designed to sever their prey when they need food to eat.
</li>
<li>With winter looming, the homeowner decided to sever a tree and use it for firewood.
</li>
</ul>
</div>
</div>
