ruby/S.org
* [[https://wordsinasentence.com/shambled-in-a-sentence/][Shambled]]

  =to move with a slow, shuffling, awkward gait=

  - Moving at a slow and steady pace, the man shambled up the stairs to the guest bedroom.
  - As he shambled into the dark alley, the man seemed to be moving more sluggishly than ever.
  - After his accident, the man shambled and shuffled instead of walking.
  - With his awkward stride, the cowboy shambled through the gate to the field.

* [[https://wordsinasentence.com/sheen-in-a-sentence/][Sheen]]

  =a quality of things with a smooth and shiny surface=

  - I didn’t want the counter to have a shiny look, so I covered it with a paint with less sheen.
  - Selecting lustrous gloss instead of a matte lipstick will add more sheen to your look.
  - Spraying extra oil on the hair added extra sheen to her already radiant locks.
  - As the plant stems began to die off, they lost their sheen and turned from shiny to dull and brittle.


* [[https://wordsinasentence.com/shilly-shally-in-a-sentence/][Shilly shally]]

  =in an uncertain or wavering way=

  - When the teacher stumped the student with a difficult question, she spoke shilly shally since she didn’t know the answer.
  - Afraid to approach the attacking bear, the park ranger walked shilly shally up to the situation by taking very small steps.
  - Police officers will approach shilly shally to the suspect’s car by slowly and cautiously observing the driver.
  - Since the woman didn’t want to tell her sensitive friend about the toilet paper stuck to the back of her pants, she spoke shilly shally without really knowing what to say.

* [[https://wordsinasentence.com/shoddy-in-a-sentence/][Shoddy]]

  =not done or made well=

  - The shoddy porch collapsed one day after it was built.
  - As soon as the judges heard the young woman’s shoddy performance, they voted her out of the competition.
  - The shoddy toy was broken when it arrived in the mail.
  - Because of shoddy accounting practices, our firm is being audited.

* [[https://wordsinasentence.com/shove-in-a-sentence/][Shove]]

  =to roughly push=

  - When he’s packing for a trip, the disorganized man tries to shove all of his clothes into one suitcase.
  - Neglecting their chores all day, the children only had a few minutes to shove their laundry into the hamper and pick up the trash before mother returned.
  - The siblings began to playfully push and shove as they played in the thick snow.
  - The bully tried to shove me out of the way at the water fountain, but the teacher noticed and took his recess away.

* [[https://wordsinasentence.com/shriek-in-a-sentence/][Shriek]]

  =to issue a piercing yelp or call=

  - When the pop idol walked on the stage, the girls started to shriek in excitement.
  - The baby will shriek with delight as soon as he sees his father.
  - Because I’m afraid of snakes, I usually shriek when I come across one.
  - The monkeys in the tropical forest shriek noisily when they are approached by humans.


* [[https://wordsinasentence.com/shudder-in-a-sentence/][Shudder]]

  =to tremble suddenly=

  - A cool breeze moved through the garden, causing the princess’s body to shudder from the chill.
  - The sound of nails down the chalkboard caused the child to shudder and shake.
  - Sending a shockwave down the warrior’s spine, the ghost’s appearance on the battlefield made even the bravest soldier shudder.
  - Even the thought of having to spend one night in the haunted tavern made my body shudder with fear.

* [[https://wordsinasentence.com/siege-in-a-sentence/][Siege]]

  =a circumstance in which a group, usually a military or law enforcement agency, surrounds an area or building in an attempt to take it over=

  - During the siege of the village, the villagers were forced to give up their property.
  - Soldiers killed hundreds of people while the town was under siege.
  - On Black Friday, it looked as though the department store was under siege by eager customers.
  - We felt as though our neighborhood was under siege while law enforcement searched the area for an escaped inmate.
  - Once the siege was over, the soldiers placed their flag on top of the tallest building and left town.
  - The policemen found themselves under siege when angry protestors surrounded their cruiser.
  - With enemies approaching from the left and the right, it was apparent the castle was under siege.


* [[https://wordsinasentence.com/simper-in-a-sentence/][Simper]]

  =a silly or shy grin=

  - The simper on Kate’s face causes me to think she gets nervous whenever she talks to a boy.
  - Even though I was angry with Rick, his goofy simper covered his face and melted my heart.
  - Ann’s simper and reddish cheeks let everyone know she was embarrassed by her fall.
  - Although Jake was being reprimanded, his face bore a simper that irritated his principal.


* [[https://wordsinasentence.com/singe-in-a-sentence/][Singe]]

  =to burn something in a superficial way=

  - The spicy food began to singe my mouth as soon as I took a bite.
  - Hazardous materials may singe or sear your hands if they are not handled carefully.
  - After several hours at the beach without sunscreen, the strong rays began to singe my skin.
  - Playing too close to the fire pit caused the camper to singe the edge of his jacket.

* [[https://wordsinasentence.com/skim-in-a-sentence/][Skim]]

  =to go over something quickly=

  - Not having enough time to read all of the assigned chapters, I decided to skim through the pages and home for the best.
  - The boat shot down the lake, beginning to skim over the water as if it was floating on air.
  - I regret my decision to skim over the contract instead of reading it fully since there was important information that I missed.
  - Internet surfers often skim over articles and never fully read anything.

* [[https://wordsinasentence.com/skirt-in-a-sentence/][Skirt]]

  =skirt is to go around something instead of directly through it=

  - Do not skirt around the truth about this issue, tell me exactly what happened and when.
  - At cross country track practice, the runners chose to skirt around the intended course and cut some distance off the anticipated path to the finish line.
  - We had to skirt around the subject because we could not deal with any more hostility over it.
  - The couple mingled socially at the party and managed to skirt around Mallory the entire night.

