ruby/S.html

<div id="outline-container-sec-139" class="outline-2">
<h2 id="sec-139"><span class="section-number-2">139</span> <a href="https://wordsinasentence.com/shambled-in-a-sentence/">Shambled</a></h2>
<div class="outline-text-2" id="text-139">
<p>
<code>to move with a slow, shuffling, awkward gait</code>
</p>

<ul class="org-ul">
<li>Moving at a slow and steady pace, the man shambled up the stairs to the guest bedroom.
</li>
<li>As he shambled into the dark alley, the man seemed to be moving more sluggishly than ever.
</li>
<li>After his accident, the man shambled and shuffled instead of walking.
</li>
<li>With his awkward stride, the cowboy shambled through the gate to the field.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-140" class="outline-2">
<h2 id="sec-140"><span class="section-number-2">140</span> <a href="https://wordsinasentence.com/sheen-in-a-sentence/">Sheen</a></h2>
<div class="outline-text-2" id="text-140">
<p>
<code>a quality of things with a smooth and shiny surface</code>
</p>

<ul class="org-ul">
<li>I didn’t want the counter to have a shiny look, so I covered it with a paint with less sheen.
</li>
<li>Selecting <b>lustrous</b> <b>gloss</b> instead of a <b>matte</b> <code>亚光</code> lipstick will add more sheen to your look.
</li>
<li>Spraying extra oil on the hair added extra sheen to her already radiant locks.
</li>
<li>As the plant stems began to die off, they lost their sheen and turned from shiny to dull and brittle.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-141" class="outline-2">
<h2 id="sec-141"><span class="section-number-2">141</span> <a href="https://wordsinasentence.com/shilly-shally-in-a-sentence/">Shilly shally</a></h2>
<div class="outline-text-2" id="text-141">
<p>
<code>in an uncertain or wavering way</code>
</p>

<ul class="org-ul">
<li>When the teacher stumped the student with a difficult question, she spoke shilly shally since she didn’t know the answer.
</li>
<li>Afraid to approach the attacking bear, the park ranger walked shilly shally up to the situation by taking very small steps.
</li>
<li>Police officers will approach shilly shally to the suspect’s car by slowly and cautiously observing the driver.
</li>
<li>Since the woman didn’t want to tell her sensitive friend about the toilet paper stuck to the back of her pants, she spoke shilly shally without really knowing what to say.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-142" class="outline-2">
<h2 id="sec-142"><span class="section-number-2">142</span> <a href="https://wordsinasentence.com/shoddy-in-a-sentence/">Shoddy</a></h2>
<div class="outline-text-2" id="text-142">
<p>
<code>not done or made well</code>
</p>

<ul class="org-ul">
<li>The shoddy porch collapsed one day after it was built.
</li>
<li>As soon as the judges heard the young woman’s shoddy performance, they voted her out of the competition.
</li>
<li>The shoddy toy was broken when it arrived in the mail.
</li>
<li>Because of shoddy accounting practices, our firm is being audited.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-143" class="outline-2">
<h2 id="sec-143"><span class="section-number-2">143</span> <a href="https://wordsinasentence.com/shove-in-a-sentence/">Shove</a></h2>
<div class="outline-text-2" id="text-143">
<p>
<code>to roughly push</code>
</p>

<ul class="org-ul">
<li>When he’s packing for a trip, the disorganized man tries to shove all of his clothes into one suitcase.
</li>
<li>Neglecting their chores all day, the children only had a few minutes to shove their laundry into the hamper and pick up the trash before mother returned.
</li>
<li>The siblings began to playfully push and shove as they played in the thick snow.
</li>
<li>The bully tried to shove me out of the way at the water fountain, but the teacher noticed and took his recess away.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-144" class="outline-2">
<h2 id="sec-144"><span class="section-number-2">144</span> <a href="https://wordsinasentence.com/shriek-in-a-sentence/">Shriek</a></h2>
<div class="outline-text-2" id="text-144">
<p>
<code>to issue a piercing yelp or call</code>
</p>

<ul class="org-ul">
<li>When the pop idol walked on the stage, the girls started to shriek in excitement.
</li>
<li>The baby will shriek with delight as soon as he sees his father.
</li>
<li>Because I’m afraid of snakes, I usually shriek when I come across one.
</li>
<li>The monkeys in the tropical forest shriek noisily when they are approached by humans.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-145" class="outline-2">
<h2 id="sec-145"><span class="section-number-2">145</span> <a href="https://wordsinasentence.com/shudder-in-a-sentence/">Shudder</a></h2>
<div class="outline-text-2" id="text-145">
<p>
<code>to tremble suddenly</code>
</p>

<ul class="org-ul">
<li>A cool breeze moved through the garden, causing the princess’s body to shudder from the chill.
</li>
<li>The sound of nails down the chalkboard caused the child to shudder and shake.
</li>
<li>Sending a shockwave down the warrior’s spine, the ghost’s appearance on the battlefield made even the bravest soldier shudder.
</li>
<li>Even the thought of having to spend one night in the haunted tavern made my body shudder with fear.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-146" class="outline-2">
<h2 id="sec-146"><span class="section-number-2">146</span> <a href="https://wordsinasentence.com/siege-in-a-sentence/">Siege</a></h2>
<div class="outline-text-2" id="text-146">
<p>
<code>a circumstance in which a group, usually a military or law enforcement agency, surrounds an area or building in an attempt to take it over</code>
</p>

<ul class="org-ul">
<li>During the siege of the village, the villagers were forced to give up their property.
</li>
<li>Soldiers killed hundreds of people while the town was under siege.
</li>
<li>On Black Friday, it looked as though the department store was under siege by eager customers.
</li>
<li>We felt as though our neighborhood was under siege while law enforcement searched the area for an escaped inmate.
</li>
<li>Once the siege was over, the soldiers placed their flag on top of the tallest building and left town.
</li>
<li>The policemen found themselves under siege when angry protestors surrounded their cruiser.
</li>
<li>With enemies approaching from the left and the right, it was apparent the castle was under siege.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-147" class="outline-2">
<h2 id="sec-147"><span class="section-number-2">147</span> <a href="https://wordsinasentence.com/simper-in-a-sentence/">Simper</a></h2>
<div class="outline-text-2" id="text-147">
<p>
<code>a silly or shy grin</code>
</p>

<ul class="org-ul">
<li>The simper on Kate’s face causes me to think she gets nervous whenever she talks to a boy.
</li>
<li>Even though I was angry with Rick, his goofy simper covered his face and melted my heart.
</li>
<li>Ann’s simper and reddish cheeks let everyone know she was embarrassed by her fall.
</li>
<li>Although Jake was being reprimanded, his face bore a simper that irritated his principal.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-148" class="outline-2">
<h2 id="sec-148"><span class="section-number-2">148</span> <a href="https://wordsinasentence.com/singe-in-a-sentence/">Singe</a></h2>
<div class="outline-text-2" id="text-148">
<p>
<code>to burn something in a superficial way</code>
</p>

<ul class="org-ul">
<li>The spicy food began to singe my mouth as soon as I took a bite.
</li>
<li>Hazardous materials may singe or sear your hands if they are not handled carefully.
</li>
<li>After several hours at the beach without sunscreen, the strong rays began to singe my skin.
</li>
<li>Playing too close to the fire pit caused the camper to singe the edge of his jacket.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-149" class="outline-2">
<h2 id="sec-149"><span class="section-number-2">149</span> <a href="https://wordsinasentence.com/skim-in-a-sentence/">Skim</a></h2>
<div class="outline-text-2" id="text-149">
<p>
<code>to go over something quickly</code>
</p>

<ul class="org-ul">
<li>Not having enough time to read all of the assigned chapters, I decided to skim through the pages and home for the best.
</li>
<li>The boat shot down the lake, beginning to skim over the water as if it was floating on air.
</li>
<li>I regret my decision to skim over the contract instead of reading it fully since there was important information that I missed.
</li>
<li>Internet surfers often skim over articles and never fully read anything.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-150" class="outline-2">
<h2 id="sec-150"><span class="section-number-2">150</span> <a href="https://wordsinasentence.com/skirt-in-a-sentence/">Skirt</a></h2>
<div class="outline-text-2" id="text-150">
<p>
<code>skirt is to go around something instead of directly through it</code>
</p>

<ul class="org-ul">
<li>Do not skirt around the truth about this issue, tell me exactly what happened and when.
</li>
<li>At cross country track practice, the runners chose to skirt around the intended course and cut some distance off the anticipated path to the finish line.
</li>
<li>We had to skirt around the subject because we could not deal with any more hostility over it.
</li>
<li>The couple mingled socially at the party and managed to skirt around Mallory the entire night.
</li>
</ul>
</div>
</div>
