ruby/S.org
* [[https://wordsinasentence.com/skittish-in-a-sentence/][Skittish]]

  =scared by even the smallest of things=

  - The skittish horse stood on his hind legs when the rabbit rushed by him.
  - Since the toddler is very skittish, she jumps at the slightest noise.
  - My skittish little brother ran to my parents’ room when he heard the fireworks.
  - Around her boyfriend, Karen appears skittish as though she is waiting to be hit.

* [[https://wordsinasentence.com/skulduggery-in-a-sentence/][Skulduggery]]

  =behavior characterized by tricking someone into something or cheating them through lies or misinformation=

  - The insurance company was investigated by the FBI after claims of skulduggery and cheating customers was reported.
  - The local gas station was known for its skulduggery, but it wasn't until they were shut down for overcharging customers that they realized how dishonest the company truly was.
  - Marcus always knew about his brother’s skulduggery towards others but he never expected him to lie to his face.
  - Bianca used her charm and beauty for skulduggery and tricked many wealthy men to give her thousands of dollars.

* [[https://wordsinasentence.com/slack-in-a-sentence/][Slack]]

  =slack means loose, not tight=

  - I took my new dress to the seamstress because it needed slack added to the waist.
  - Add some slack to the rope so that I can descend from the rock slowly.
  - There was too much slack in the shoestrings, making my shoes feel loose the entire hike.
  - The pants had plenty of slack and were not too tight to wear in public.

* [[https://wordsinasentence.com/slake-in-a-sentence/][Slake]]

  =slake means to quench or satisfy one’s thirst=

  - This electrolyte water should help slake the runners’ thirst during the marathon.
  - To slake dehydration, the athletes drank sports drink before, during, and after the triathlon.
  - Parched by unpredictable exertion climbing the mountain, the hikers had to stop and slake their dry mouths with bottled water and fruit.
  - You can slake your craving for coffee during pregnancy with other warm beverages such as decaffeinated herbal tea and hot carob.

* [[https://wordsinasentence.com/slander-in-a-sentence/][Slander]]

  =to make a statement that cannot be proven in order to injure someone’s reputation=

  - To win the election for homecoming queen, Jill resorted to slander to ruin her competitors’ reputations.
  - The magazine is known for its habit of creating false articles that slander celebrities in order to increase sales.
  - Because Gail wanted Heather’s job, she tried to slander her at work by spreading rumors about Heather’s past drug issues.
  - The politician’s attempts to slander his rival with lies backfired and cost him the election.

* [[https://wordsinasentence.com/slant-in-a-sentence/][Slant]]

  =a slant is a lean, bend, or slope=

  - The slant of the mountain side made a much easier track for the mountain climbers than the strictly vertical path.
  - The slant of the handwriting made her words more difficult to read because they leaned too heavily to the right.
  - She felt that keeping her books arranged with a slight slant made the shelf look more organized than if the books were straight.
  - Before she fainted as a result of low blood sugar, her body appeared to be in a slant position.

* [[https://wordsinasentence.com/slay-in-a-sentence/][Slay]]

  =to kill something in a violent way=

  - Determined to slay the dragon, the knight raised his sword to deliver a strike.
  - The people were shocked that small David was able to slay Goliath the giant with a single shot to the head.
  - Hitler’s men killed most of the Jews in gas chambers, but some did slay their victims violently.
  - Militaries no longer need to slay their enemies with swords and guns since weapons of mass destruction are available.


* [[https://wordsinasentence.com/sleight-in-a-sentence/][Sleight]]

  =the manipulation of cunning or skill, particularly as a means of deception=

  - The card cheat used a sleight of hand trick to ensure he won the biggest pot of the night.
  - Using sleight of mind skills, the pretend psychic is able to infer details about a stranger’s life.
  - With a sleight of hand ruse, the dealer fooled the players into thinking she switched decks.
  - What sleight did you use to convince the old man to buy your worthless insurance policy?

* [[https://wordsinasentence.com/slew-in-a-sentence/][Slew]]

  =to have killed something/someone=

  - Zeus slew many of his enemies by literally striking them down with bolts of lightning.
  - Mongols slew thousands of men through skilled archery and smart battle strategy.
  - The knight slew the fire-breathing dragon by finding a weakness in its scales.
  - The gladiator slew his competition with a thrust of his sword.

* [[https://wordsinasentence.com/slick-in-a-sentence/][Slick]]

  =smooth and glossy (usually of a surface)=

  - Rain caused the road to become wet and many cars to skid across the slick surface.
  - Brushing cream into her hair, the ballerina made her bun slick and glossy for her performance.
  - It’s easy to slip on a slick surface, so walk carefully on the tile floor.
  - The bowling ball slid down the slick lane, crashing into the pins at the end.

* [[https://wordsinasentence.com/slog-in-a-sentence/][Slog]]

  =to work extremely hard over a period of time=

  - The road workers were forced to slog it out and continue the construction even through the holidays.
  - As they continued to slog in the field, the farmers dreamed of a day they wouldn’t have to work so hard.
  - A twelve-hour shift is the minimum for workers who slog in the sweat shops day in and day out.
  - The players tried to slog their way to victory, refusing to stop even though they were down by several points.


* [[https://wordsinasentence.com/sloppily-in-a-sentence/][Sloppily]]

  =messy, dirty, disheveled=

  - He showed up to the interview so sloppily dressed that they turned him away at the door.
  - The pastry chef decorated the cake so sloppily that the cake tilted and frosting spilled out from the sides.
  - The essay was written so sloppily that the teacher could not tell where one sentence ended and another began.
  - She wished her mother wouldn't dress so sloppily when she picked her up from school.

