ruby/S.html

<div id="outline-container-sec-151" class="outline-2">
<h2 id="sec-151"><span class="section-number-2">151</span> <a href="https://wordsinasentence.com/skittish-in-a-sentence/">Skittish</a></h2>
<div class="outline-text-2" id="text-151">
<p>
<code>scared by even the smallest of things</code>
</p>

<ul class="org-ul">
<li>The skittish horse stood on his hind legs when the rabbit rushed by him.
</li>
<li>Since the toddler is very skittish, she jumps at the slightest noise.
</li>
<li>My skittish little brother ran to my parents’ room when he heard the fireworks.
</li>
<li>Around her boyfriend, Karen appears skittish as though she is waiting to be hit.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-152" class="outline-2">
<h2 id="sec-152"><span class="section-number-2">152</span> <a href="https://wordsinasentence.com/skulduggery-in-a-sentence/">Skulduggery</a></h2>
<div class="outline-text-2" id="text-152">
<p>
<code>behavior characterized by tricking someone into something or cheating them through lies or misinformation</code>
</p>

<ul class="org-ul">
<li>The insurance company was investigated by the FBI after claims of skulduggery and cheating customers was reported.
</li>
<li>The local gas station was known for its skulduggery, but it wasn't until they were shut down for overcharging customers that they realized how dishonest the company truly was.
</li>
<li>Marcus always knew about his brother’s skulduggery towards others but he never expected him to lie to his face.
</li>
<li>Bianca used her charm and beauty for skulduggery and tricked many wealthy men to give her thousands of dollars.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-153" class="outline-2">
<h2 id="sec-153"><span class="section-number-2">153</span> <a href="https://wordsinasentence.com/slack-in-a-sentence/">Slack</a></h2>
<div class="outline-text-2" id="text-153">
<p>
<code>slack means loose, not tight</code>
</p>

<ul class="org-ul">
<li>I took my new dress to the seamstress because it needed slack added to the waist.
</li>
<li>Add some slack to the rope so that I can descend from the rock slowly.
</li>
<li>There was too much slack in the shoestrings, making my shoes feel loose the entire hike.
</li>
<li>The pants had plenty of slack and were not too tight to wear in public.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-154" class="outline-2">
<h2 id="sec-154"><span class="section-number-2">154</span> <a href="https://wordsinasentence.com/slake-in-a-sentence/">Slake</a></h2>
<div class="outline-text-2" id="text-154">
<p>
<code>slake means to quench or satisfy one’s thirst</code>
</p>

<ul class="org-ul">
<li>This electrolyte water should help slake the runners’ thirst during the marathon.
</li>
<li>To slake dehydration, the athletes drank sports drink before, during, and after the triathlon.
</li>
<li>Parched by unpredictable exertion climbing the mountain, the hikers had to stop and slake their dry mouths with bottled water and fruit.
</li>
<li>You can slake your craving for coffee during pregnancy with other warm beverages such as decaffeinated herbal tea and hot carob.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-155" class="outline-2">
<h2 id="sec-155"><span class="section-number-2">155</span> <a href="https://wordsinasentence.com/slander-in-a-sentence/">Slander</a></h2>
<div class="outline-text-2" id="text-155">
<p>
<code>to make a statement that cannot be proven in order to injure someone’s reputation</code>
</p>

<ul class="org-ul">
<li>To win the election for homecoming queen, Jill resorted to slander to ruin her competitors’ reputations.
</li>
<li>The magazine is known for its habit of creating false articles that slander celebrities in order to increase sales.
</li>
<li>Because Gail wanted Heather’s job, she tried to slander her at work by spreading rumors about Heather’s past drug issues.
</li>
<li>The politician’s attempts to slander his rival with lies backfired and cost him the election.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-156" class="outline-2">
<h2 id="sec-156"><span class="section-number-2">156</span> <a href="https://wordsinasentence.com/slant-in-a-sentence/">Slant</a></h2>
<div class="outline-text-2" id="text-156">
<p>
<code>a slant is a lean, bend, or slope</code>
</p>

<ul class="org-ul">
<li>The slant of the mountain side made a much easier track for the mountain climbers than the strictly vertical path.
</li>
<li>The slant of the handwriting made her words more difficult to read because they leaned too heavily to the right.
</li>
<li>She felt that keeping her books arranged with a slight slant made the shelf look more organized than if the books were straight.
</li>
<li>Before she fainted as a result of low blood sugar, her body appeared to be in a slant position.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-157" class="outline-2">
<h2 id="sec-157"><span class="section-number-2">157</span> <a href="https://wordsinasentence.com/slay-in-a-sentence/">Slay</a></h2>
<div class="outline-text-2" id="text-157">
<p>
<code>to kill something in a violent way</code>
</p>

<ul class="org-ul">
<li>Determined to slay the dragon, the knight raised his sword to deliver a strike.
</li>
<li>The people were shocked that small David was able to slay Goliath the giant with a single shot to the head.
</li>
<li>Hitler’s men killed most of the Jews in gas chambers, but some did slay their victims violently.
</li>
<li>Militaries no longer need to slay their enemies with swords and guns since weapons of mass destruction are available.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-158" class="outline-2">
<h2 id="sec-158"><span class="section-number-2">158</span> <a href="https://wordsinasentence.com/sleight-in-a-sentence/">Sleight</a></h2>
<div class="outline-text-2" id="text-158">
<p>
<code>the manipulation of cunning or skill, particularly as a means of deception</code>
</p>

<ul class="org-ul">
<li>The card cheat used a sleight of hand trick to ensure he won the biggest pot of the night.
</li>
<li>Using sleight of mind skills, the pretend psychic is able to infer details about a stranger’s life.
</li>
<li>With a sleight of hand ruse, the dealer fooled the players into thinking she switched decks.
</li>
<li>What sleight did you use to convince the old man to buy your worthless insurance policy?
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-159" class="outline-2">
<h2 id="sec-159"><span class="section-number-2">159</span> <a href="https://wordsinasentence.com/slew-in-a-sentence/">Slew</a></h2>
<div class="outline-text-2" id="text-159">
<p>
<code>to have killed something/someone</code>
</p>

<ul class="org-ul">
<li>Zeus slew many of his enemies by literally striking them down with bolts of lightning.
</li>
<li>Mongols slew thousands of men through skilled archery and smart battle strategy.
</li>
<li>The knight slew the fire-breathing dragon by finding a weakness in its scales.
</li>
<li>The gladiator slew his competition with a thrust of his sword.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-160" class="outline-2">
<h2 id="sec-160"><span class="section-number-2">160</span> <a href="https://wordsinasentence.com/slick-in-a-sentence/">Slick</a></h2>
<div class="outline-text-2" id="text-160">
<p>
<code>smooth and glossy (usually of a surface)</code>
</p>

<ul class="org-ul">
<li>Rain caused the road to become wet and many cars to skid across the slick surface.
</li>
<li>Brushing cream into her hair, the ballerina made her bun slick and glossy for her performance.
</li>
<li>It’s easy to slip on a slick surface, so walk carefully on the tile floor.
</li>
<li>The bowling ball slid down the slick lane, crashing into the pins at the end.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-161" class="outline-2">
<h2 id="sec-161"><span class="section-number-2">161</span> <a href="https://wordsinasentence.com/slog-in-a-sentence/">Slog</a></h2>
<div class="outline-text-2" id="text-161">
<p>
<code>to work extremely hard over a period of time</code>
</p>

<ul class="org-ul">
<li>The road workers were forced to slog it out and continue the construction even through the holidays.
</li>
<li>As they continued to slog in the field, the farmers dreamed of a day they wouldn’t have to work so hard.
</li>
<li>A twelve-hour shift is the minimum for workers who slog in the sweat shops day in and day out.
</li>
<li>The players tried to slog their way to victory, refusing to stop even though they were down by several points.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-162" class="outline-2">
<h2 id="sec-162"><span class="section-number-2">162</span> <a href="https://wordsinasentence.com/sloppily-in-a-sentence/">Sloppily</a></h2>
<div class="outline-text-2" id="text-162">
<p>
<code>messy, dirty, disheveled</code>
</p>

<ul class="org-ul">
<li>He showed up to the interview so sloppily dressed that they turned him away at the door.
</li>
<li>The pastry chef decorated the cake so sloppily that the cake tilted and frosting spilled out from the sides.
</li>
<li>The essay was written so sloppily that the teacher could not tell where one sentence ended and another began.
</li>
<li>She wished her mother wouldn't dress so sloppily when she picked her up from school.
</li>
</ul>
</div>
</div>
