ruby/S.org
* [[https://wordsinasentence.com/slosh-in-a-sentence/][Slosh]]

  =the sound of splashing=

  - The distant slosh of the waves on the sandy beach was a relaxing sound as I attempted to take a nap.
  - I could hear the slosh of the water in the bucket as I carried it through the hallway, which was rather irritating.
  - Nothing is more annoying than the slosh of water in a container that is moving around a bunch.
  - When you step out of the bath tub after finishing, you will probably hear the slosh of the water waving back and forth.


* [[https://wordsinasentence.com/slovenly-in-a-sentence/][Slovenly]]

  =having a dirty appearance=

  - The man’s slovenly dress was a result of him being homeless for a month.
  - Because Jan is a pet hoarder, with over twenty cats, it is not surprising that she lives in a slovenly home.
  - In the animated series, the slovenly dark-skinned child always has a puff of dirt following him.
  - Although Warren is very wealthy, he still lives in the slovenly neighborhood where he grew up as an underprivileged youth.
  - Since Bridgett spends most of her time in class, she rarely cleans her slovenly dorm room.
  - The inmates have written the governor a letter complaining about the slovenly and unsanitary prison conditions.
  - After a night of wild partying, a slovenly-looking Carl came in to work wearing yesterday’s clothes.



* [[https://wordsinasentence.com/slump-in-a-sentence/][Slump]]

  =to fall suddenly of prices, values, and sales=

  - After a successful mowing season, winter caused service calls to slump.
  - Sales of the phone began to slump after several caught on fire and burnt their owners.
  - After playing for a while, the player’s energy began to slump.
  - The slump cut new car sales by a third and cost the dealership a great deal of money.


* [[https://wordsinasentence.com/sly-in-a-sentence/][Sly]]

  =having or showing cleverness in a cunning or deceitful manner=

  - Instead of a ‘yes’ or ‘no’ answer, he gave a sly smile as a response.
  - The young suspect was very sly during the investigation.
  - The author of the book was very sly at introducing hints as to who the murderer was.
  - During the office party, the young lovers kept stealing sly glances at one another.

* [[https://wordsinasentence.com/smear-in-a-sentence/][Smear]]

  =to spread a substance messily=

  - The baby used her fingers to smear paint all across the paper.
  - Using a knife, Ava tried to smear peanut butter over every inch of her sandwich bread.
  - Unless you smear glue on the back of the poster, it won’t stick to the surface.
  - The painter was careful not to smear the blue wall paint on the kitchen’s white baseboards.


* [[https://wordsinasentence.com/smirk-in-a-sentence/][Smirk]]

  =a confident and often gloating smile=

  - The smirk on his face told her that he was being sneaky.
  - Bryan started to smirk when his little brother got in trouble for causing the mess he made.
  - Bruce shot his sister as smirk as he stole the last piece of birthday cake right out of her hands.
  - Lexy couldn't help but smirk as they called her name for prom queen.


* [[https://wordsinasentence.com/smudge-in-a-sentence/][Smudge]]

  =a smeared mark on the surface of something=

  - Wiping her eyes while crying, the bride tried hard not to leave a smudge from her makeup.
  - The robber made a mistake and left a small smudge of a fingerprint that identified him.
  - Wiping each smudge off of the window, the housewife tried to get her area perfectly clean.
  - The model was so upset to see a dark smudge on the bottom of her white skirt.


* [[https://wordsinasentence.com/snare-in-a-sentence/][Snare]]

  =a trap=

  - Finding himself in the middle of a bureaucratic snare, the politician wished that he had never trusted his fellow cabinet members.
  - A snare was set to trap the critters who were eating all of the garden vegetables at night.
  - With a snare in place, the hunter had nothing to do but wait for the first rabbit to approach.
  - A victim of the queen’s evil snare, the princess had to come up with a way to escape her dungeon.


* [[https://wordsinasentence.com/snarl-in-a-sentence/][Snarl]]

  =growl=

  - Cowering in fear, Pete and Jerry heard the snarl of an unknown animal while walking in the haunted forest.
  - The snarl of the vicious dogs made the neighbors aware that they were not friendly.
  - As the patrons would pass the exhibit at the San Diego Zoo, the tigers would snarl in their direction.
  - At first the wolf’s upper lip would raise and expose its sharp teeth, and then the sound of its snarl would signal danger.

* [[https://wordsinasentence.com/snatch-in-a-sentence/][Snatch]]

  =to grab something quickly=

  - I tried to snatch up my most precious belongings before I ran to safety, but the smoke from the fire proved too much for my lungs.
  - The only way to get the sleeping teenager out of bed in the morning is to snatch his comforter off.
  - Irritated by the chore list her mother had left, the grumpy girl proceeded to snatch the paper from the counter and storm out of the room.
  - A kidnapper tried to snatch an infant from a local hospital, but safety protocols botched the attempt.

* [[https://wordsinasentence.com/sneer-in-a-sentence/][Sneer]]

  =to speak or smile in an unkind way=

  - Mark gave Ted a condescending sneer when he walked into the meeting.
  - There is no way you will get the job if you sit at the interview with a sneer on your face.
  - With a disrespectful sneer, Gertrude mocked her slaves for their slow work pace.
  - With a sneer on his face, Bob ripped the contract into shreds, insisting that he would never do business with such unimportant people.

* [[https://wordsinasentence.com/snicker-in-a-sentence/][Snicker]]

  =to let out a half-suppressed laugh in a disrespectful way=

  - The judges tried not to snicker at the beauty queen’s misguided rant about how world hunger affects Americans the most.
  - Ignoring the bully who began to snicker and giggle as she walked by, the confident freshman held her head high.
  - Opponents began to snicker and chuckle as the divisive candidate blabbed about how unifying his campaign would be.
  - I couldn’t help but snicker at the news of the adulterer’s new wife leaving him for someone else.

