ruby/S.html

<div id="outline-container-sec-163" class="outline-2">
<h2 id="sec-163"><span class="section-number-2">163</span> <a href="https://wordsinasentence.com/slosh-in-a-sentence/">Slosh</a></h2>
<div class="outline-text-2" id="text-163">
<p>
<code>the sound of splashing</code>
</p>

<ul class="org-ul">
<li>The distant slosh of the waves on the sandy beach was a relaxing sound as I attempted to take a nap.
</li>
<li>I could hear the slosh of the water in the bucket as I carried it through the hallway, which was rather irritating.
</li>
<li>Nothing is more annoying than the slosh of water in a container that is moving around a bunch.
</li>
<li>When you step out of the bath tub after finishing, you will probably hear the slosh of the water waving back and forth.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-164" class="outline-2">
<h2 id="sec-164"><span class="section-number-2">164</span> <a href="https://wordsinasentence.com/slovenly-in-a-sentence/">Slovenly</a></h2>
<div class="outline-text-2" id="text-164">
<p>
<code>having a dirty appearance</code>
</p>

<ul class="org-ul">
<li>The man’s slovenly dress was a result of him being homeless for a month.
</li>
<li>Because Jan is a pet hoarder, with over twenty cats, it is not surprising that she lives in a slovenly home.
</li>
<li>In the animated series, the slovenly dark-skinned child always has a puff of dirt following him.
</li>
<li>Although Warren is very wealthy, he still lives in the slovenly neighborhood where he grew up as an underprivileged youth.
</li>
<li>Since Bridgett spends most of her time in class, she rarely cleans her slovenly dorm room.
</li>
<li>The inmates have written the governor a letter complaining about the slovenly and unsanitary prison conditions.
</li>
<li>After a night of wild partying, a slovenly-looking Carl came in to work wearing yesterday’s clothes.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-165" class="outline-2">
<h2 id="sec-165"><span class="section-number-2">165</span> <a href="https://wordsinasentence.com/slump-in-a-sentence/">Slump</a></h2>
<div class="outline-text-2" id="text-165">
<p>
<code>to fall suddenly of prices, values, and sales</code>
</p>

<ul class="org-ul">
<li>After a successful mowing season, winter caused service calls to slump.
</li>
<li>Sales of the phone began to slump after several caught on fire and burnt their owners.
</li>
<li>After playing for a while, the player’s energy began to slump.
</li>
<li>The slump cut new car sales by a third and cost the dealership a great deal of money.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-166" class="outline-2">
<h2 id="sec-166"><span class="section-number-2">166</span> <a href="https://wordsinasentence.com/sly-in-a-sentence/">Sly</a></h2>
<div class="outline-text-2" id="text-166">
<p>
<code>having or showing cleverness in a cunning or deceitful manner</code>
</p>

<ul class="org-ul">
<li>Instead of a ‘yes’ or ‘no’ answer, he gave a sly smile as a response.
</li>
<li>The young suspect was very sly during the investigation.
</li>
<li>The author of the book was very sly at introducing hints as to who the murderer was.
</li>
<li>During the office party, the young lovers kept stealing sly glances at one another.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-167" class="outline-2">
<h2 id="sec-167"><span class="section-number-2">167</span> <a href="https://wordsinasentence.com/smear-in-a-sentence/">Smear</a></h2>
<div class="outline-text-2" id="text-167">
<p>
<code>to spread a substance messily</code>
</p>

<ul class="org-ul">
<li>The baby used her fingers to smear paint all across the paper.
</li>
<li>Using a knife, Ava tried to smear peanut butter over every inch of her sandwich bread.
</li>
<li>Unless you smear glue on the back of the poster, it won’t stick to the surface.
</li>
<li>The painter was careful not to smear the blue wall paint on the kitchen’s white baseboards.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-168" class="outline-2">
<h2 id="sec-168"><span class="section-number-2">168</span> <a href="https://wordsinasentence.com/smirk-in-a-sentence/">Smirk</a></h2>
<div class="outline-text-2" id="text-168">
<p>
<code>a confident and often gloating smile</code>
</p>

<ul class="org-ul">
<li>The smirk on his face told her that he was being sneaky.
</li>
<li>Bryan started to smirk when his little brother got in trouble for causing the mess he made.
</li>
<li>Bruce shot his sister as smirk as he stole the last piece of birthday cake right out of her hands.
</li>
<li>Lexy couldn't help but smirk as they called her name for prom queen.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-169" class="outline-2">
<h2 id="sec-169"><span class="section-number-2">169</span> <a href="https://wordsinasentence.com/smudge-in-a-sentence/">Smudge</a></h2>
<div class="outline-text-2" id="text-169">
<p>
<code>a smeared mark on the surface of something</code>
</p>

<ul class="org-ul">
<li>Wiping her eyes while crying, the bride tried hard not to leave a smudge from her makeup.
</li>
<li>The robber made a mistake and left a small smudge of a fingerprint that identified him.
</li>
<li>Wiping each smudge off of the window, the housewife tried to get her area perfectly clean.
</li>
<li>The model was so upset to see a dark smudge on the bottom of her white skirt.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-170" class="outline-2">
<h2 id="sec-170"><span class="section-number-2">170</span> <a href="https://wordsinasentence.com/snare-in-a-sentence/">Snare</a></h2>
<div class="outline-text-2" id="text-170">
<p>
<code>a trap</code>
</p>

<ul class="org-ul">
<li>Finding himself in the middle of a bureaucratic snare, the politician wished that he had never trusted his fellow cabinet members.
</li>
<li>A snare was set to trap the critters who were eating all of the garden vegetables at night.
</li>
<li>With a snare in place, the hunter had nothing to do but wait for the first rabbit to approach.
</li>
<li>A victim of the queen’s evil snare, the princess had to come up with a way to escape her dungeon.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-171" class="outline-2">
<h2 id="sec-171"><span class="section-number-2">171</span> <a href="https://wordsinasentence.com/snarl-in-a-sentence/">Snarl</a></h2>
<div class="outline-text-2" id="text-171">
<p>
<code>growl</code>
</p>

<ul class="org-ul">
<li>Cowering in fear, Pete and Jerry heard the snarl of an unknown animal while walking in the haunted forest.
</li>
<li>The snarl of the vicious dogs made the neighbors aware that they were not friendly.
</li>
<li>As the patrons would pass the exhibit at the San Diego Zoo, the tigers would snarl in their direction.
</li>
<li>At first the wolf’s upper lip would raise and expose its sharp teeth, and then the sound of its snarl would signal danger.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-172" class="outline-2">
<h2 id="sec-172"><span class="section-number-2">172</span> <a href="https://wordsinasentence.com/snatch-in-a-sentence/">Snatch</a></h2>
<div class="outline-text-2" id="text-172">
<p>
<code>to grab something quickly</code>
</p>

<ul class="org-ul">
<li>I tried to snatch up my most precious belongings before I ran to safety, but the smoke from the fire proved too much for my lungs.
</li>
<li>The only way to get the sleeping teenager out of bed in the morning is to snatch his comforter off.
</li>
<li>Irritated by the chore list her mother had left, the grumpy girl proceeded to snatch the paper from the counter and storm out of the room.
</li>
<li>A kidnapper tried to snatch an infant from a local hospital, but safety protocols botched the attempt.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-173" class="outline-2">
<h2 id="sec-173"><span class="section-number-2">173</span> <a href="https://wordsinasentence.com/sneer-in-a-sentence/">Sneer</a></h2>
<div class="outline-text-2" id="text-173">
<p>
<code>to speak or smile in an unkind way</code>
</p>

<ul class="org-ul">
<li>Mark gave Ted a condescending sneer when he walked into the meeting.
</li>
<li>There is no way you will get the job if you sit at the interview with a sneer on your face.
</li>
<li>With a disrespectful sneer, Gertrude mocked her slaves for their slow work pace.
</li>
<li>With a sneer on his face, Bob ripped the contract into shreds, insisting that he would never do business with such unimportant people.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-174" class="outline-2">
<h2 id="sec-174"><span class="section-number-2">174</span> <a href="https://wordsinasentence.com/snicker-in-a-sentence/">Snicker</a></h2>
<div class="outline-text-2" id="text-174">
<p>
<code>to let out a half-suppressed laugh in a disrespectful way</code>
</p>

<ul class="org-ul">
<li>The judges tried not to snicker at the beauty queen’s misguided rant about how world hunger affects Americans the most.
</li>
<li>Ignoring the bully who began to snicker and giggle as she walked by, the confident freshman held her head high.
</li>
<li>Opponents began to snicker and chuckle as the divisive candidate blabbed about how unifying his campaign would be.
</li>
<li>I couldn’t help but snicker at the news of the adulterer’s new wife leaving him for someone else.
</li>
</ul>
</div>
</div>
