ruby/S.org
* [[https://wordsinasentence.com/snip-in-a-sentence/][Snip]]

  =to cut something with a small, quick stroke=

  - If you snip the suckers off of the bush too quickly, the blossoms will never appear.
  - The cosmetologist was able to snip the hair so quickly that baby never noticed he was getting his hair cut.
  - One snip of the scissors, and the long string hanging from the pillow was gone.
  - You need to snip off the corner of the bag before you can poor the food into the bowl.

* [[https://wordsinasentence.com/snitch-in-a-sentence/][Snitch]]

  =a person who reports the wrongdoing of others to someone in an authority position=

  - Fearing that he would be labeled a snitch, the man made sure that no one at the company knew he was filing a complaint.
  - Gang members thought that a snitch was in their midst, and wondered who was the rat telling their business to the cops.
  - Without a snitch to turn on the crooked cops, they continued their reign of terror over the city.
  - The woman felt like a snitch when reporting her coworkers, but knew it was the right thing to do.


* [[https://wordsinasentence.com/sodden-in-a-sentence/][Sodden]]

  =soaked in fluid=

  - My shoes were sodden after I walked a mile in the rain.
  - When you walk on sodden ground, keep your eyes open for dangerous sinkholes.
  - The clothes were still sodden when Greg removed them from the broken dryer.
  - After the halftime rain, the football players found it hard to run on the sodden field.
  - The baby cried until his sodden diaper was removed.
  - After the marathon, Harold’s clothing was sodden with sweat.
  - My grandmother tried to dry my sodden jeans with an iron.


* [[https://wordsinasentence.com/somatic-in-a-sentence/][Somatic]]

  =somatic means relating to the human body=

  - It is difficult to link generic somatic symptoms, like an irregular heartbeat, to specific illness.
  - The mental health system tends to ignore somatic symptoms that are related to other body parts.
  - Somatic symptoms like headaches and fatigue generally resolve themselves quickly.
  - With successful treatment, both psychological and somatic symptoms vanish from the body.


* [[https://wordsinasentence.com/somnolent-in-a-sentence/][Somnolent]]

  =likely to induce sleep=

  - The moonlight, along with the somnolent lapping of the waves on the shore, set the perfect scene for a romantic evening.
  - After feeding him, Kristin held her breath as she gently placed the somnolent baby in his crib.
  - The somnolent setting makes the spa a perfect getaway for a relaxing retreat.
  - The somnolent drone of the professor made it almost impossible for the students to stay awake during the lecture.
  - After a day of skiing, my greatest pleasure is to spend a somnolent evening drinking a cup of hot chocolate by the fireside.
  - When the mist parted, we were able to see a somnolent little village in the distant valley.
  - The rainy weather went on for days, making all the citizens walk around in a somnolent daze.


* [[https://wordsinasentence.com/sorcery-in-a-sentence/][Sorcery]]

  =the utilization of magical abilities acquired from evil souls=

  - The dark knight used sorcery to hypnotize the king.
  - When the witch gave her tricks of sorcery to the murdered man, she urged him to seek revenge on his killers.
  - The evil witchdoctor practices sorcery to control the tribespeople.
  - If a person uses the magic of sorcery for wicked deeds, he or she may be consumed by dark souls.

* [[https://wordsinasentence.com/spasmodic-in-a-sentence/][Spasmodic]]

  =occurring in an erratic manner=

  - Hopefully the medicine will control the number of spasmodic outbursts Henry has in class.
  - People who have spasmodic seizures may have warning signs that alert them of the upcoming convulsions.
  - Because Jim and I do not have a dating schedule, we consider ourselves to be sporadic daters.
  - Days after the marathon, Kurt had spasmodic muscle contractions that occurred without warning.


* [[https://wordsinasentence.com/spat-in-a-sentence/][Spat]]

  =to quarrel or argue briefly=

  - Most couples make it through their first spat just fine.
  - It is often common for siblings to have a spat and start playing again shortly after.
  - The police were called to the scene of a spat about barking dogs between two neighbors.
  - Small spats can blow out of proportion quickly if there isn’t open communication between all parties involved.

* [[https://wordsinasentence.com/spate-in-a-sentence/][Spate]]

  =a series or large amounts of=

  - A recent spate of employee changes left the company with an entirely new staff.
  - Since the New Year, a spate of attacks on schools has left the entire country concerned.
  - A spate of new homes has popped up in the area due to a boom in population.
  - We hoped that the fighting would end, but a spate of new battles suggest the war won’t be over soon.


* [[https://wordsinasentence.com/spear-in-a-sentence/][Spear]]

  =to impale or pierce an object=

  - The Native American used a long rod to spear the fish right out of the water.
  - After he tried to spear and roast the hot dog several times, the hungry camper gave up and ate it raw.
  - This time the knight succeeded in his attempt to spear the enemy with his sword.
  - During an accidental fall, a sharp and jagged edge was able to spear the rock climber directly in his chest.


* [[https://wordsinasentence.com/speck-in-a-sentence/][Speck]]

  =a small particle=

  - A speck of dirt flew in the runner’s eye, making it difficult for her to focus on finishing the race.
  - The tiny speck of sand in my shoe was irritating enough to make me shake my shoes out.
  - A speck of honey mustard was enough to give the sandwich a little flavor.
  - As the star blew out, it shriveled up into a tiny speck of nothing.

* [[https://wordsinasentence.com/spendthrift-in-a-sentence/][Spendthrift]]

  =an individual who uses money in an irresponsible way=

  - Because the lottery winner was a spendthrift, he spent his winnings in less than a year.
  - The heiress is a spendthrift who once paid half a million dollars for a pair of shoes.
  - Since my brother is a spendthrift, I must remind him to pay his bills before he goes shopping for clothes.
  - My mother can’t be a spendthrift because she debates every purchase and never spends irresponsibly.

