ruby/S.html

<div id="outline-container-sec-175" class="outline-2">
<h2 id="sec-175"><span class="section-number-2">175</span> <a href="https://wordsinasentence.com/snip-in-a-sentence/">Snip</a></h2>
<div class="outline-text-2" id="text-175">
<p>
<code>to cut something with a small, quick stroke</code>
</p>

<ul class="org-ul">
<li>If you snip the suckers off of the bush too quickly, the blossoms will never appear.
</li>
<li>The cosmetologist was able to snip the hair so quickly that baby never noticed he was getting his hair cut.
</li>
<li>One snip of the scissors, and the long string hanging from the pillow was gone.
</li>
<li>You need to snip off the corner of the bag before you can poor the food into the bowl.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-176" class="outline-2">
<h2 id="sec-176"><span class="section-number-2">176</span> <a href="https://wordsinasentence.com/snitch-in-a-sentence/">Snitch</a></h2>
<div class="outline-text-2" id="text-176">
<p>
<code>a person who reports the wrongdoing of others to someone in an authority position</code>
</p>

<ul class="org-ul">
<li>Fearing that he would be labeled a snitch, the man made sure that no one at the company knew he was filing a complaint.
</li>
<li>Gang members thought that a snitch was in their midst, and wondered who was the rat telling their business to the cops.
</li>
<li>Without a snitch to turn on the crooked cops, they continued their reign of terror over the city.
</li>
<li>The woman felt like a snitch when reporting her coworkers, but knew it was the right thing to do.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-177" class="outline-2">
<h2 id="sec-177"><span class="section-number-2">177</span> <a href="https://wordsinasentence.com/sodden-in-a-sentence/">Sodden</a></h2>
<div class="outline-text-2" id="text-177">
<p>
<code>soaked in fluid</code>
</p>

<ul class="org-ul">
<li>My shoes were sodden after I walked a mile in the rain.
</li>
<li>When you walk on sodden ground, keep your eyes open for dangerous sinkholes.
</li>
<li>The clothes were still sodden when Greg removed them from the broken dryer.
</li>
<li>After the halftime rain, the football players found it hard to run on the sodden field.
</li>
<li>The baby cried until his sodden diaper was removed.
</li>
<li>After the marathon, Harold’s clothing was sodden with sweat.
</li>
<li>My grandmother tried to dry my sodden jeans with an iron.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-178" class="outline-2">
<h2 id="sec-178"><span class="section-number-2">178</span> <a href="https://wordsinasentence.com/somatic-in-a-sentence/">Somatic</a></h2>
<div class="outline-text-2" id="text-178">
<p>
<code>somatic means relating to the human body</code>
</p>

<ul class="org-ul">
<li>It is difficult to link generic somatic symptoms, like an irregular heartbeat, to specific illness.
</li>
<li>The mental health system tends to ignore somatic symptoms that are related to other body parts.
</li>
<li>Somatic symptoms like headaches and fatigue generally resolve themselves quickly.
</li>
<li>With successful treatment, both psychological and somatic symptoms vanish from the body.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-179" class="outline-2">
<h2 id="sec-179"><span class="section-number-2">179</span> <a href="https://wordsinasentence.com/somnolent-in-a-sentence/">Somnolent</a></h2>
<div class="outline-text-2" id="text-179">
<p>
<code>likely to induce sleep</code>
</p>

<ul class="org-ul">
<li>The moonlight, along with the somnolent lapping of the waves on the shore, set the perfect scene for a romantic evening.
</li>
<li>After feeding him, Kristin held her breath as she gently placed the somnolent baby in his crib.
</li>
<li>The somnolent setting makes the spa a perfect getaway for a relaxing retreat.
</li>
<li>The somnolent drone of the professor made it almost impossible for the students to stay awake during the lecture.
</li>
<li>After a day of skiing, my greatest pleasure is to spend a somnolent evening drinking a cup of hot chocolate by the fireside.
</li>
<li>When the mist parted, we were able to see a somnolent little village in the distant valley.
</li>
<li>The rainy weather went on for days, making all the citizens walk around in a somnolent daze.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-180" class="outline-2">
<h2 id="sec-180"><span class="section-number-2">180</span> <a href="https://wordsinasentence.com/sorcery-in-a-sentence/">Sorcery</a></h2>
<div class="outline-text-2" id="text-180">
<p>
<code>the utilization of magical abilities acquired from evil souls</code>
</p>

<ul class="org-ul">
<li>The dark knight used sorcery to hypnotize the king.
</li>
<li>When the witch gave her tricks of sorcery to the murdered man, she urged him to seek revenge on his killers.
</li>
<li>The evil witchdoctor practices sorcery to control the tribespeople.
</li>
<li>If a person uses the magic of sorcery for wicked deeds, he or she may be consumed by dark souls.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-181" class="outline-2">
<h2 id="sec-181"><span class="section-number-2">181</span> <a href="https://wordsinasentence.com/spasmodic-in-a-sentence/">Spasmodic</a></h2>
<div class="outline-text-2" id="text-181">
<p>
<code>occurring in an erratic manner</code>
</p>

<ul class="org-ul">
<li>Hopefully the medicine will control the number of spasmodic outbursts Henry has in class.
</li>
<li>People who have spasmodic seizures may have warning signs that alert them of the upcoming convulsions.
</li>
<li>Because Jim and I do not have a dating schedule, we consider ourselves to be sporadic daters.
</li>
<li>Days after the marathon, Kurt had spasmodic muscle contractions that occurred without warning.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-182" class="outline-2">
<h2 id="sec-182"><span class="section-number-2">182</span> <a href="https://wordsinasentence.com/spat-in-a-sentence/">Spat</a></h2>
<div class="outline-text-2" id="text-182">
<p>
<code>to quarrel or argue briefly</code>
</p>

<ul class="org-ul">
<li>Most couples make it through their first spat just fine.
</li>
<li>It is often common for siblings to have a spat and start playing again shortly after.
</li>
<li>The police were called to the scene of a spat about barking dogs between two neighbors.
</li>
<li>Small spats can blow out of proportion quickly if there isn’t open communication between all parties involved.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-183" class="outline-2">
<h2 id="sec-183"><span class="section-number-2">183</span> <a href="https://wordsinasentence.com/spate-in-a-sentence/">Spate</a></h2>
<div class="outline-text-2" id="text-183">
<p>
<code>a series or large amounts of</code>
</p>

<ul class="org-ul">
<li>A recent spate of employee changes left the company with an entirely new staff.
</li>
<li>Since the New Year, a spate of attacks on schools has left the entire country concerned.
</li>
<li>A spate of new homes has popped up in the area due to a boom in population.
</li>
<li>We hoped that the fighting would end, but a spate of new battles suggest the war won’t be over soon.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-184" class="outline-2">
<h2 id="sec-184"><span class="section-number-2">184</span> <a href="https://wordsinasentence.com/spear-in-a-sentence/">Spear</a></h2>
<div class="outline-text-2" id="text-184">
<p>
<code>to impale or pierce an object</code>
</p>

<ul class="org-ul">
<li>The Native American used a long rod to spear the fish right out of the water.
</li>
<li>After he tried to spear and roast the hot dog several times, the hungry camper gave up and ate it raw.
</li>
<li>This time the knight succeeded in his attempt to spear the enemy with his sword.
</li>
<li>During an accidental fall, a sharp and jagged edge was able to spear the rock climber directly in his chest.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-185" class="outline-2">
<h2 id="sec-185"><span class="section-number-2">185</span> <a href="https://wordsinasentence.com/speck-in-a-sentence/">Speck</a></h2>
<div class="outline-text-2" id="text-185">
<p>
<code>a small particle</code>
</p>

<ul class="org-ul">
<li>A speck of dirt flew in the runner’s eye, making it difficult for her to focus on finishing the race.
</li>
<li>The tiny speck of sand in my shoe was irritating enough to make me shake my shoes out.
</li>
<li>A speck of honey mustard was enough to give the sandwich a little flavor.
</li>
<li>As the star blew out, it shriveled up into a tiny speck of nothing.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-186" class="outline-2">
<h2 id="sec-186"><span class="section-number-2">186</span> <a href="https://wordsinasentence.com/spendthrift-in-a-sentence/">Spendthrift</a></h2>
<div class="outline-text-2" id="text-186">
<p>
<code>an individual who uses money in an irresponsible way</code>
</p>

<ul class="org-ul">
<li>Because the lottery winner was a spendthrift, he spent his winnings in less than a year.
</li>
<li>The heiress is a spendthrift who once paid half a million dollars for a pair of shoes.
</li>
<li>Since my brother is a spendthrift, I must remind him to pay his bills before he goes shopping for clothes.
</li>
<li>My mother can’t be a spendthrift because she debates every purchase and never spends irresponsibly.
</li>
</ul>
</div>
</div>
