ruby/S.org
* [[https://wordsinasentence.com/spew-in-a-sentence/][Spew]]

  =to forcefully expel a large amount of something=

  - The elephant gathered a great deal of water in its trunk so it could spew it at its offspring and help the baby clean itself.
  - I had to spew out the water I was drinking when I took a breath at the wrong moment and nearly inhaled the liquid.
  - The geysers in Yellowstone National Park will sporadically spew out streams of steaming water from below the surface.
  - When a volcano erupts, it will spew out a humongous amount of lava, ash, and magma, often resulting in the destruction of any nearby settlements.

* [[https://wordsinasentence.com/spiel-in-a-sentence/][Spiel]]

  =a lengthy and extravagant speech or argument usually intended to persuade=

  - The teacher gave his usual spiel about the importance of completing all assignments, but the students just yawned.
  - Union protesters seemed even more enraged as the company representative gave his final spiel urging them to return to work.
  - I listened to the car salesman's spiel but still refused to buy anything.
  - Monotone and lengthy, the politician’s spiel did little to gain the support of the opposition.

* [[https://wordsinasentence.com/spindly-in-a-sentence/][Spindly]]

  =tall and thin=

  - The dancer was tall and spindly, with thin legs that seemed to go up to her shoulders.
  - Touching the spindly plant, the botanist observed its thin branches sticking out on every side.
  - The spindly wooden chair was crafted to have long, thin legs and a tall back.
  - Getting ready to start the race, the boy’s spindly legs looked as if they went on for miles.

* [[https://wordsinasentence.com/spite-in-a-sentence/][Spite]]

  =to purposefully hurt or offend someone=

  - The bitter woman took her children out of the country just to spite her ex-husband for leaving her.
  - Many congress members voted for a bill they had never read simply to spite the other party they hate so much.
  - Convinced that her sister was hiding her clothing just to spite her, the irritated teen placed a lock on her closet door.
  - To spite his teacher, the evil boy placed a tack in her seat and waited for her to sit down.

* [[https://wordsinasentence.com/spleen-in-a-sentence/][Spleen]]

  =an abdominal organ that produces lymphocytes and filters blood=

  - A major part of the immune system, the abdominal spleen filters the body’s blood.
  - Pressing under the patient’s ribcage, the doctor explained that his spleen is an organ that helps keep bodily fluid balanced.
  - The spleen helps fight certain kinds of bacteria that cause both pneumonia and meningitis.
  - Because the spleen is a storage for blood, the rupturing of this organ is a life-threatening emergency.




* [[https://wordsinasentence.com/spree-in-a-sentence/][Spree]]

  =a time period in which individual(s) engage in a great deal of something=

  - When the crime spree ended six people were dead.
  - The alcoholic consumed two gallons of whiskey during his last drinking spree.
  - During my shopping spree, I visited nearly every store in the mall.
  - Amazingly Jim sold six cars during his four hour selling spree.


* [[https://wordsinasentence.com/squabble-in-a-sentence/][Squabble]]

  =minor fight or argument=

  - The old couple was known to squabble about even the most trivial things.
  - You must not squabble about such simple things as who gets to sit in the front seat of the car.
  - The brothers were known to squabble about who would be player one in their video game.
  - When he became tired of her complaining, they would begin to squabble about everything.
  - It may just seem like a squabble to you, but this argument is important to their future survival.
  - Kids will squabble over the most ridiculous things.
  - He always felt his wife was ready to squabble, which drove him to avoid going home on time.

* [[https://wordsinasentence.com/squall-in-a-sentence/][Squall]]

  =to cry or wail loudly=

  - I left the house because the squall of our new born baby was grating on my nerves.
  - The baby jumped up and let out a delightful squall when her mother walked into her room.
  - Michael throws back his head and makes this childlike squall whenever he gets excited about something.
  - Letting out a loud squall, the pirate swung his sword violently in every direction, terrifying his prisoners.

* [[https://wordsinasentence.com/squalor-in-a-sentence/][Squalor]]

  =poor and dirty conditions=

  - Because the homeless man did not have running water, he was used to living in squalor.
  - The selfish queen laughed when she learned the majority of her people lived in squalor with very little food.
  - After the destructive hurricane, many people had no choice but to live in squalor.
  - The man’s leg infection was made worse by the squalor of the unsanitary prison.
  - Until the captured soldiers are rescued, they will more than likely be tortured and forced to live in squalor.
  - The film director chose to film in black and white in order to show the squalor of the times during the economic depression.
  - In that poverty-stricken country, over seventy-five percent of the people live in squalor and cannot afford food on a daily basis.

* [[https://wordsinasentence.com/squeamish-in-a-sentence/][Squeamish]]

  =easily made nauseous=

  - My husband has a weak stomach and becomes squeamish whenever he sees blood.
  - Because I am squeamish when it comes to violence, I do not watch boxing on television.
  - My youngest daughter is extremely squeamish when she has to get a shot.
  - When my sister was giving birth to her first child, her husband became squeamish and vomited in the delivery room.

* [[https://wordsinasentence.com/squelch-in-a-sentence/][Squelch]]

  =to halt, stop, eliminate=

  - When Justin runs wildly around the house, it takes every ounce of my strength to squelch my urge to slap him.
  - You must learn to squelch your fears in the army, or you will be laughed out of the brigade.
  - The Roman general would not tolerate the uprising, and he sent his legions to squelch it with force.
  - The mean remark made by my uncle only served to squelch my desire to offer him any further kind of assistance.

