ruby/S.html

<div id="outline-container-sec-187" class="outline-2">
<h2 id="sec-187"><span class="section-number-2">187</span> <a href="https://wordsinasentence.com/spew-in-a-sentence/">Spew</a></h2>
<div class="outline-text-2" id="text-187">
<p>
<code>to forcefully expel a large amount of something</code>
</p>

<ul class="org-ul">
<li>The elephant gathered a great deal of water in its trunk so it could spew it at its offspring and help the baby clean itself.
</li>
<li>I had to spew out the water I was drinking when I took a breath at the wrong moment and nearly inhaled the liquid.
</li>
<li>The geysers in Yellowstone National Park will sporadically spew out streams of steaming water from below the surface.
</li>
<li>When a volcano erupts, it will spew out a humongous amount of lava, ash, and magma, often resulting in the destruction of any nearby settlements.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-188" class="outline-2">
<h2 id="sec-188"><span class="section-number-2">188</span> <a href="https://wordsinasentence.com/spiel-in-a-sentence/">Spiel</a></h2>
<div class="outline-text-2" id="text-188">
<p>
<code>a lengthy and extravagant speech or argument usually intended to persuade</code>
</p>

<ul class="org-ul">
<li>The teacher gave his usual spiel about the importance of completing all assignments, but the students just yawned.
</li>
<li>Union protesters seemed even more enraged as the company representative gave his final spiel urging them to return to work.
</li>
<li>I listened to the car salesman's spiel but still refused to buy anything.
</li>
<li>Monotone and lengthy, the politician’s spiel did little to gain the support of the opposition.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-189" class="outline-2">
<h2 id="sec-189"><span class="section-number-2">189</span> <a href="https://wordsinasentence.com/spindly-in-a-sentence/">Spindly</a></h2>
<div class="outline-text-2" id="text-189">
<p>
<code>tall and thin</code>
</p>

<ul class="org-ul">
<li>The dancer was tall and spindly, with thin legs that seemed to go up to her shoulders.
</li>
<li>Touching the spindly plant, the botanist observed its thin branches sticking out on every side.
</li>
<li>The spindly wooden chair was crafted to have long, thin legs and a tall back.
</li>
<li>Getting ready to start the race, the boy’s spindly legs looked as if they went on for miles.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-190" class="outline-2">
<h2 id="sec-190"><span class="section-number-2">190</span> <a href="https://wordsinasentence.com/spite-in-a-sentence/">Spite</a></h2>
<div class="outline-text-2" id="text-190">
<p>
<code>to purposefully hurt or offend someone</code>
</p>

<ul class="org-ul">
<li>The bitter woman took her children out of the country just to spite her ex-husband for leaving her.
</li>
<li>Many congress members voted for a bill they had never read simply to spite the other party they hate so much.
</li>
<li>Convinced that her sister was hiding her clothing just to spite her, the irritated teen placed a lock on her closet door.
</li>
<li>To spite his teacher, the evil boy placed a tack in her seat and waited for her to sit down.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-191" class="outline-2">
<h2 id="sec-191"><span class="section-number-2">191</span> <a href="https://wordsinasentence.com/spleen-in-a-sentence/">Spleen</a></h2>
<div class="outline-text-2" id="text-191">
<p>
<code>an abdominal organ that produces lymphocytes and filters blood</code>
</p>

<ul class="org-ul">
<li>A major part of the immune system, the abdominal spleen filters the body’s blood.
</li>
<li>Pressing under the patient’s ribcage, the doctor explained that his spleen is an organ that helps keep bodily fluid balanced.
</li>
<li>The spleen helps fight certain kinds of bacteria that cause both pneumonia and meningitis.
</li>
<li>Because the spleen is a storage for blood, the rupturing of this organ is a life-threatening emergency.
</li>
</ul>
</div>
</div>




<div id="outline-container-sec-192" class="outline-2">
<h2 id="sec-192"><span class="section-number-2">192</span> <a href="https://wordsinasentence.com/spree-in-a-sentence/">Spree</a></h2>
<div class="outline-text-2" id="text-192">
<p>
<code>a time period in which individual(s) engage in a great deal of something</code>
</p>

<ul class="org-ul">
<li>When the crime spree ended six people were dead.
</li>
<li>The alcoholic consumed two gallons of whiskey during his last drinking spree.
</li>
<li>During my shopping spree, I visited nearly every store in the mall.
</li>
<li>Amazingly Jim sold six cars during his four hour selling spree.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-193" class="outline-2">
<h2 id="sec-193"><span class="section-number-2">193</span> <a href="https://wordsinasentence.com/squabble-in-a-sentence/">Squabble</a></h2>
<div class="outline-text-2" id="text-193">
<p>
<code>minor fight or argument</code>
</p>

<ul class="org-ul">
<li>The old couple was known to squabble about even the most trivial things.
</li>
<li>You must not squabble about such simple things as who gets to sit in the front seat of the car.
</li>
<li>The brothers were known to squabble about who would be player one in their video game.
</li>
<li>When he became tired of her complaining, they would begin to squabble about everything.
</li>
<li>It may just seem like a squabble to you, but this argument is important to their future survival.
</li>
<li>Kids will squabble over the most ridiculous things.
</li>
<li>He always felt his wife was ready to squabble, which drove him to avoid going home on time.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-194" class="outline-2">
<h2 id="sec-194"><span class="section-number-2">194</span> <a href="https://wordsinasentence.com/squall-in-a-sentence/">Squall</a></h2>
<div class="outline-text-2" id="text-194">
<p>
<code>to cry or wail loudly</code>
</p>

<ul class="org-ul">
<li>I left the house because the squall of our new born baby was grating on my nerves.
</li>
<li>The baby jumped up and let out a delightful squall when her mother walked into her room.
</li>
<li>Michael throws back his head and makes this childlike squall whenever he gets excited about something.
</li>
<li>Letting out a loud squall, the pirate swung his sword violently in every direction, terrifying his prisoners.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-195" class="outline-2">
<h2 id="sec-195"><span class="section-number-2">195</span> <a href="https://wordsinasentence.com/squalor-in-a-sentence/">Squalor</a></h2>
<div class="outline-text-2" id="text-195">
<p>
<code>poor and dirty conditions</code>
</p>

<ul class="org-ul">
<li>Because the homeless man did not have running water, he was used to living in squalor.
</li>
<li>The selfish queen laughed when she learned the majority of her people lived in squalor with very little food.
</li>
<li>After the destructive hurricane, many people had no choice but to live in squalor.
</li>
<li>The man’s leg infection was made worse by the squalor of the unsanitary prison.
</li>
<li>Until the captured soldiers are rescued, they will more than likely be tortured and forced to live in squalor.
</li>
<li>The film director chose to film in black and white in order to show the squalor of the times during the economic depression.
</li>
<li>In that poverty-stricken country, over seventy-five percent of the people live in squalor and cannot afford food on a daily basis.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-196" class="outline-2">
<h2 id="sec-196"><span class="section-number-2">196</span> <a href="https://wordsinasentence.com/squeamish-in-a-sentence/">Squeamish</a></h2>
<div class="outline-text-2" id="text-196">
<p>
<code>easily made nauseous</code>
</p>

<ul class="org-ul">
<li>My husband has a weak stomach and becomes squeamish whenever he sees blood.
</li>
<li>Because I am squeamish when it comes to violence, I do not watch boxing on television.
</li>
<li>My youngest daughter is extremely squeamish when she has to get a shot.
</li>
<li>When my sister was giving birth to her first child, her husband became squeamish and vomited in the delivery room.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-197" class="outline-2">
<h2 id="sec-197"><span class="section-number-2">197</span> <a href="https://wordsinasentence.com/squelch-in-a-sentence/">Squelch</a></h2>
<div class="outline-text-2" id="text-197">
<p>
<code>to halt, stop, eliminate</code>
</p>

<ul class="org-ul">
<li>When Justin runs wildly around the house, it takes every ounce of my strength to squelch my urge to slap him.
</li>
<li>You must learn to squelch your fears in the army, or you will be laughed out of the brigade.
</li>
<li>The Roman general would not tolerate the uprising, and he sent his legions to squelch it with force.
</li>
<li>The mean remark made by my uncle only served to squelch my desire to offer him any further kind of assistance.
</li>
</ul>
</div>
</div>
