ruby/S.org
* [[https://wordsinasentence.com/squint-in-a-sentence/][Squint]]

  =to look with the eyes partly closed=

  - Since the sun was shining bright into my eyes, I had to squint to see.
  - When the eye doctor presented the eye chart, Kim had to squint to read the last line.
  - If you have a tendency to squint when you read, you may need glasses.
  - Molly will squint her eyes when she is deep in thought.

* [[https://wordsinasentence.com/staid-in-a-sentence/][Staid]]

  =serious, boring, or old-fashioned=

  - In his business suit, my staid boyfriend looked out of place in the wild nightclub.
  - The teenage girl thought the nursing home party sounded staid.
  - Since my aunt is a nun, she always wears such a staid look on her face.
  - Larry prefers the staid life of a country gentleman.
  - If you want a lively bar and grill, then you should avoid this staid establishment that is run by a religious couple.
  - Mike’s staid apartment is bare of furniture and completely lacking in color.
  - When people describe my boss, they describe him as a staid man who never smiles.


* [[https://wordsinasentence.com/stale-in-a-sentence/][Stale]]

  =food that is no longer fresh and has become hard, dry, or otherwise unpleasant=

  - Bread that has become hard, dry, and crusty is stale.
  - Food items that are supposed to stay refrigerated become stale if left out for too long.
  - Stale is a term most often used to refer to old bread that is no longer good to eat.
  - It is obvious when bread has become stale because it is no longer soft.

* [[https://wordsinasentence.com/stampede-in-a-sentence/][Stampede]]

  =an unexpected movement of a group or to rush rowdily in a state of panic=

  - It took over a dozen wranglers to stop the cattle stampede.
  - When the shots rang out, there was a stampede as patrons fled the nightclub.
  - The horses may run in a stampede if they are frightened.
  - Since the store has only a few copies of the popular videogame, its manager is expecting a stampede when the doors are opened.

* [[https://wordsinasentence.com/stanza-in-a-sentence/][Stanza]]

  =a portion of a poem displayed in paragraph form=

  - The first stanza of the poem introduces us to the misguided lovers.
  - As I wrote the final stanza of the poem, I realized my words failed to deliver the message I wanted to imply.
  - The second stanza of the poem contains rhyming lines.
  - As a poetry teacher, my hardest task is getting students to write the first stanza because they often find it difficult to write the initial lines.

* [[https://wordsinasentence.com/stature-in-a-sentence/][Stature]]

  =a level of prestige earned for a deed or achievement=

  - As a five-time Grammy winner, Aretha has a huge stature in the music community.
  - Bucky enjoys the stature that comes with being the mayor of a small town.
  - Even Sudhakar’s high stature in the company could not prevent him from losing his job.
  - When the billionaire lost all of his money, he lost his stature in the social world.



* [[https://wordsinasentence.com/staunch-in-a-sentence/][Staunch]]

  =loyal, trustworthy, reliable, outstanding=

  - Although Joseph considers himself to be a staunch Republican, he has not voted for a Republican candidate in over six years.
  - Because Alice is a staunch fan of Sarah Wittier’s writing, she has read all of Wittier’s books.
  - Since the two countries are staunch allies it is not surprising they will work together in the war to defeat their shared enemy.
  - Laura is a staunch supporter of the pro-life movement because she feels abortions are a sin against God.
  - The union has shown a staunch commitment to providing industrial workers with decent salaries and medical insurance.
  - As a caring physician, Jim is a staunch believer in patient rights.
  - The men and women who serve in our military are staunch defenders of our country.

* [[https://wordsinasentence.com/steep-in-a-sentence/][Steep]]

  =excessive or high=

  - I can’t afford the steep rates at this hotel so I guess I’ll be sleeping in my car tonight.
  - As soon as there was a steep decline in iPhone prices, everyone went out and purchased a new model.
  - There is an elevator for hotel guests who can’t climb the steep stairs.
  - Since Phil doesn’t earn a great deal of money, he should really consider whether or not he can afford such a steep car payment.

* [[https://wordsinasentence.com/stench-in-a-sentence/][Stench]]

  =a very unpleasant odor=

  - The stench of the dead rat drove us from the house and into a hotel.
  - Because the water from the lake has a foul stench, you shouldn’t drink it.
  - If you’re in the chemistry lab and you smell the stench of rotten eggs, the odds are someone is using sulfur in an experiment.
  - The stench of death was so strong the coroner had to wear a mask while examining the corpse.

* [[https://wordsinasentence.com/stentorian-in-a-sentence/][Stentorian]]

  =incredibly loud=

  - The stentorian music was so loud it made my head hurt.
  - During boot camp, we were often awakened by the stentorian voice of our drill sergeant.
  - There was a stentorian noise, and the plane suddenly lost altitude.
  - When my father speaks in a stentorian voice, I know I’m in trouble.

* [[https://wordsinasentence.com/stickler-in-a-sentence/][Stickler]]

  =an individual who insists a task should be completed in a certain manner=

  - Because the drill sergeant is a stickler for details, he makes us check everything four times.
  - Our company hired an efficiency expert who is a stickler for increasing productivity.
  - A stickler for editorial rules, my aunt is a highly sought-after editor who counts several bestselling writers among her clients.
  - If I’m placed in the blue cabin at camp, I won’t have any fun because the counselor of that cabin is a stickler for rules.

* [[https://wordsinasentence.com/stiff-in-a-sentence/][Stiff]]

  =physically inflexible or hard=

  - By the time the criminal investigators uncovered the body it was already stiff with rigor mortis.
  - A week after it was baked, the baguette was stiff enough to be used as a weapon.
  - When Julie hugged her ex boyfriend, he became as stiff as a statue and refused to return her gesture.
  - The businessman sprayed an excessive amount of starch on his collar to ensure it stayed stiff and firm throughout his important meeting.


