ruby/S.org
* [[https://wordsinasentence.com/stifling-in-a-sentence/][Stifling]]

  =overpowering to the point of being suffocating or preventing progress=

  - The hot temperature is so stifling it is pulling all the energy out of my body.
  - Because of the stifling chains, the prisoner found it difficult to walk.
  - Some medical researchers believe the reduction of animal testing will have a stifling effect on drug innovation.
  - Since I have respiratory issues, I often find the odor of cigarette smoke to be quite stifling.

* [[https://wordsinasentence.com/stoked-in-a-sentence/][Stoked]]

  =thrilled and happy=

  - “I was totally stoked by my doctor’s announcement that I hadn’t contracted Tuberculosis like I had once thought,” the patient said.
  - As adrenaline junkies, surfers are always stoked to ride killer waves that are considered to be the riskiest and deadliest.
  - After turning thirty years old, Kevin was stoked to hear that his wife was finally pregnant with their first baby.
  - When the news came, Sarah was stoked to win the shopping spree especially since she had just lost her job.


* [[https://wordsinasentence.com/stolid-in-a-sentence/][Stolid]]

  =can't be moved to smile or show much sign of life=

  - He was a stolid man who did not even show his emotions at his mother’s funeral.
  - Although it takes a great deal to make me laugh, I would not consider myself to be a stolid person.
  - Even though the homeless little girl appeared to be hungry, my father remained stolid and did not give her any money for food.
  - Having seen his share of bloody crime scenes, the stolid police detective did not blink when he saw the five dead bodies.
  - On the other hand, there are many who wish Americans were more stolid and less hot blooded.
  - The judge was shocked by the killer’s stolid indifference to the death penalty conviction.
  - Although the comedian told funny jokes, his audience was too stolid to appreciate his humor.

* [[https://wordsinasentence.com/stoop-in-a-sentence/][Stoop]]

  =a place to sit that usually is taller than a chair and does not have a back to it=

  - The interior designer placed a stool at the breakfast bar in the newly remodeled kitchen.
  - After painting the stool black, I scooted it underneath the tall table so that it could not be seen.
  - “Grab a stool and get a soft drink,” said the friend as they gathered around the table to play trivia at the restaurant.
  - Since seating was limited at the establishment, Sally awkwardly sat on the stool looking down at her friend sitting in the chair.

* [[https://wordsinasentence.com/straggle-in-a-sentence/][Straggle]]

  =to stray from the road, course or line of march=

  - He was reprimanded for not staying in line, as he would often straggle through the hallway.
  - When he visits a museum, he likes to straggle from one exhibit to another in no particular order.
  - The cop had to stop the confused man as he continued to aimlessly straggle the streets.
  - On the field trip, they had to wait for the rest of the class to straggle towards the meeting point.



* [[https://wordsinasentence.com/strand-in-a-sentence/][Strand]]

  =a single piece of something such as thread, rope, or hair=

  - Since the wind caused her hair to blow in her face, a single strand of hair got caught in her left eye.
  - Around Christmas time, we place a single strand of lights on the mantle above the fireplace.
  - A strand of barbed wire was fastened to trees to enclose the property and keep trespassers out.
  - To make a beaded bracelet, just add beads to a strand of beading wire and attach a clasp at the end.

* [[https://wordsinasentence.com/strew-in-a-sentence/][Strew]]

  =to spread or scatter things all over the place=

  - During the toddler’s temper tantrum, she strew several papers all over the floor.
  - When I finished mowing the lawn, I noticed the mower strew clumps of grass everywhere which I would have to clean up.
  - The mother noticed that her young daughter did strew toys all over her room which explained the noise she heard that morning.
  - Environmentalists were saddened to see people strew litter everywhere in the medians of the highways.


* [[https://wordsinasentence.com/stricture-in-a-sentence/][Stricture]]

  =a restriction or limit placed on an individual or thing=

  - The military was called in to help enforce the curfew stricture ordered by the governor.
  - In college, the students must obey the stricture forbidding alcohol on campus.
  - The pet ownership stricture limits the number of pets that condominium owners can have.
  - By placing a stricture on their children’s sugar intake, the parents hoped their actions would reduce dental problems.


* [[https://wordsinasentence.com/strident-in-a-sentence/][Strident]]

  =loud and harsh=

  - The old man’s voice was so strident that I gritted my teeth every time he spoke to me.
  - Even through the apartment walls, Jack was able to hear the strident argument between his neighbors.
  - Our relationship will never go far if you continue to talk to me in such a strident tone!
  - Since I had a headache, the bird’s chirping sounded quite strident to me.
  - Because Jennie has a strident personality, she has few friends.
  - The hungry baby’s cries sounded strident.
  - In a strident voice, the police officer ordered the criminal to drop his weapon.

* [[https://wordsinasentence.com/strife-in-a-sentence/][Strife]]

  =struggle or conflict=

  - A tactical team was sent in to end the strife between the two gangs.
  - If the two countries do not put their strife to rest, they will cause the deaths of thousands of citizens.
  - The priest listened calmly as the arguing couple told him about the strife in their marriage.
  - When the political strife ended, the two parties were able to reach an agreement on the legislative bill.
  - The strife between the coach and the quarterback negatively affected the team’s performance.
  - As a mediator, Timothy has to come up with ways to end strife between opposing parties.
  - The strife between the two brothers started when they fell in love with the same girl.

* [[https://wordsinasentence.com/strut-in-a-sentence/][Strut]]

  =a proud step or walk, with the head upright=

  - The rooster would strut in the yard when trying to impress the hens.
  - After he won the competition, he began his strut to the winner’s circle.
  - Proud of her makeover, she would strut in front of the mirror for hours.
  - After the boy learned to walk, he would strut about the house proudly.

