ruby/S.html


<div id="outline-container-sec-210" class="outline-2">
<h2 id="sec-210"><span class="section-number-2">210</span> <a href="https://wordsinasentence.com/stifling-in-a-sentence/">Stifling</a></h2>
<div class="outline-text-2" id="text-210">
<p>
<code>overpowering to the point of being suffocating or preventing progress</code>
</p>

<ul class="org-ul">
<li>The hot temperature is so stifling it is pulling all the energy out of my body.
</li>
<li>Because of the stifling chains, the prisoner found it difficult to walk.
</li>
<li>Some medical researchers believe the reduction of animal testing will have a stifling effect on drug innovation.
</li>
<li>Since I have respiratory issues, I often find the odor of cigarette smoke to be quite stifling.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-211" class="outline-2">
<h2 id="sec-211"><span class="section-number-2">211</span> <a href="https://wordsinasentence.com/stoked-in-a-sentence/">Stoked</a></h2>
<div class="outline-text-2" id="text-211">
<p>
<code>thrilled and happy</code>
</p>

<ul class="org-ul">
<li>“I was totally stoked by my doctor’s announcement that I hadn’t contracted Tuberculosis like I had once thought,” the patient said.
</li>
<li>As adrenaline junkies, surfers are always stoked to ride killer waves that are considered to be the riskiest and deadliest.
</li>
<li>After turning thirty years old, Kevin was stoked to hear that his wife was finally pregnant with their first baby.
</li>
<li>When the news came, Sarah was stoked to win the shopping spree especially since she had just lost her job.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-212" class="outline-2">
<h2 id="sec-212"><span class="section-number-2">212</span> <a href="https://wordsinasentence.com/stolid-in-a-sentence/">Stolid</a></h2>
<div class="outline-text-2" id="text-212">
<p>
<code>can't be moved to smile or show much sign of life</code>
</p>

<ul class="org-ul">
<li>He was a stolid man who did not even show his emotions at his mother’s funeral.
</li>
<li>Although it takes a great deal to make me laugh, I would not consider myself to be a stolid person.
</li>
<li>Even though the homeless little girl appeared to be hungry, my father remained stolid and did not give her any money for food.
</li>
<li>Having seen his share of bloody crime scenes, the stolid police detective did not blink when he saw the five dead bodies.
</li>
<li>On the other hand, there are many who wish Americans were more stolid and less hot blooded.
</li>
<li>The judge was shocked by the killer’s stolid indifference to the death penalty conviction.
</li>
<li>Although the comedian told funny jokes, his audience was too stolid to appreciate his humor.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-213" class="outline-2">
<h2 id="sec-213"><span class="section-number-2">213</span> <a href="https://wordsinasentence.com/stoop-in-a-sentence/">Stoop</a></h2>
<div class="outline-text-2" id="text-213">
<p>
<code>a place to sit that usually is taller than a chair and does not have a back to it</code>
</p>

<ul class="org-ul">
<li>The interior designer placed a stool at the breakfast bar in the newly remodeled kitchen.
</li>
<li>After painting the stool black, I scooted it underneath the tall table so that it could not be seen.
</li>
<li>“Grab a stool and get a soft drink,” said the friend as they gathered around the table to play trivia at the restaurant.
</li>
<li>Since seating was limited at the establishment, Sally awkwardly sat on the stool looking down at her friend sitting in the chair.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-214" class="outline-2">
<h2 id="sec-214"><span class="section-number-2">214</span> <a href="https://wordsinasentence.com/straggle-in-a-sentence/">Straggle</a></h2>
<div class="outline-text-2" id="text-214">
<p>
<code>to stray from the road, course or line of march</code>
</p>

<ul class="org-ul">
<li>He was reprimanded for not staying in line, as he would often straggle through the hallway.
</li>
<li>When he visits a museum, he likes to straggle from one exhibit to another in no particular order.
</li>
<li>The cop had to stop the confused man as he continued to aimlessly straggle the streets.
</li>
<li>On the field trip, they had to wait for the rest of the class to straggle towards the meeting point.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-215" class="outline-2">
<h2 id="sec-215"><span class="section-number-2">215</span> <a href="https://wordsinasentence.com/strand-in-a-sentence/">Strand</a></h2>
<div class="outline-text-2" id="text-215">
<p>
<code>a single piece of something such as thread, rope, or hair</code>
</p>

<ul class="org-ul">
<li>Since the wind caused her hair to blow in her face, a single strand of hair got caught in her left eye.
</li>
<li>Around Christmas time, we place a single strand of lights on the mantle above the fireplace.
</li>
<li>A strand of barbed wire was fastened to trees to enclose the property and keep trespassers out.
</li>
<li>To make a beaded bracelet, just add beads to a strand of beading wire and attach a clasp at the end.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-216" class="outline-2">
<h2 id="sec-216"><span class="section-number-2">216</span> <a href="https://wordsinasentence.com/strew-in-a-sentence/">Strew</a></h2>
<div class="outline-text-2" id="text-216">
<p>
<code>to spread or scatter things all over the place</code>
</p>

<ul class="org-ul">
<li>During the toddler’s temper tantrum, she strew several papers all over the floor.
</li>
<li>When I finished mowing the lawn, I noticed the mower strew clumps of grass everywhere which I would have to clean up.
</li>
<li>The mother noticed that her young daughter did strew toys all over her room which explained the noise she heard that morning.
</li>
<li>Environmentalists were saddened to see people strew litter everywhere in the medians of the highways.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-217" class="outline-2">
<h2 id="sec-217"><span class="section-number-2">217</span> <a href="https://wordsinasentence.com/stricture-in-a-sentence/">Stricture</a></h2>
<div class="outline-text-2" id="text-217">
<p>
<code>a restriction or limit placed on an individual or thing</code>
</p>

<ul class="org-ul">
<li>The military was called in to help enforce the curfew stricture ordered by the governor.
</li>
<li>In college, the students must obey the stricture forbidding alcohol on campus.
</li>
<li>The pet ownership stricture limits the number of pets that condominium owners can have.
</li>
<li>By placing a stricture on their children’s sugar intake, the parents hoped their actions would reduce dental problems.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-218" class="outline-2">
<h2 id="sec-218"><span class="section-number-2">218</span> <a href="https://wordsinasentence.com/strident-in-a-sentence/">Strident</a></h2>
<div class="outline-text-2" id="text-218">
<p>
<code>loud and harsh</code>
</p>

<ul class="org-ul">
<li>The old man’s voice was so strident that I gritted my teeth every time he spoke to me.
</li>
<li>Even through the apartment walls, Jack was able to hear the strident argument between his neighbors.
</li>
<li>Our relationship will never go far if you continue to talk to me in such a strident tone!
</li>
<li>Since I had a headache, the bird’s chirping sounded quite strident to me.
</li>
<li>Because Jennie has a strident personality, she has few friends.
</li>
<li>The hungry baby’s cries sounded strident.
</li>
<li>In a strident voice, the police officer ordered the criminal to drop his weapon.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-219" class="outline-2">
<h2 id="sec-219"><span class="section-number-2">219</span> <a href="https://wordsinasentence.com/strife-in-a-sentence/">Strife</a></h2>
<div class="outline-text-2" id="text-219">
<p>
<code>struggle or conflict</code>
</p>

<ul class="org-ul">
<li>A tactical team was sent in to end the strife between the two gangs.
</li>
<li>If the two countries do not put their strife to rest, they will cause the deaths of thousands of citizens.
</li>
<li>The priest listened calmly as the arguing couple told him about the strife in their marriage.
</li>
<li>When the political strife ended, the two parties were able to reach an agreement on the legislative bill.
</li>
<li>The strife between the coach and the quarterback negatively affected the team’s performance.
</li>
<li>As a mediator, Timothy has to come up with ways to end strife between opposing parties.
</li>
<li>The strife between the two brothers started when they fell in love with the same girl.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-220" class="outline-2">
<h2 id="sec-220"><span class="section-number-2">220</span> <a href="https://wordsinasentence.com/strut-in-a-sentence/">Strut</a></h2>
<div class="outline-text-2" id="text-220">
<p>
<code>a proud step or walk, with the head upright</code>
</p>

<ul class="org-ul">
<li>The rooster would strut in the yard when trying to impress the hens.
</li>
<li>After he won the competition, he began his strut to the winner’s circle.
</li>
<li>Proud of her makeover, she would strut in front of the mirror for hours.
</li>
<li>After the boy learned to walk, he would strut about the house proudly.
</li>
</ul>
</div>
</div>
