ruby/S.org
* [[https://wordsinasentence.com/stultify-in-a-sentence/][Stultify]]

  =to cripple or weaken; deprive of strength=

  - Eating pizza right before a workout will definitely work to stultify your efforts.
  - A tranquilizer gun will effectively stultify even the most violent animals.
  - If you accidentally drop your cell phone in water, you will effectively stultify it.
  - By referencing actual statistics, he was able to stultify his opponent’s argument.
  - A beautiful woman often holds the power to stultify even the most powerful man.
  - Kryptonite is the only thing that will effectively stultify Superman.
  - Mixing certain drugs may cause one to stultify the other, making it effectively worthless.


* [[https://wordsinasentence.com/stunt-in-a-sentence/][Stunt]]

  =a brave or clever act or deed=

  - After the acrobat completed her stunt at the Barnum and Bailey Circus, everyone in the crowd applauded loudly.
  - Killer whales are required to do a stunt together during a show at Sea World in front of a live audience.
  - Evel Knievel performed a stunt where he rode his motorcycle through a flaming circle before landing past ten cars.
  - When the magician was able to conduct his stunt in front of a large audience, they clapped when he was successful in making the woman disappear.

* [[https://wordsinasentence.com/stupefy-in-a-sentence/][Stupefy]]

  =to astonish to the point that a person's thinking ability is decreased=

  - Seeing the naked woman was enough to stupefy the bus driver and cause him to drive off the road.
  - Even my teacher did not know the answer to the trivia question that seemed to stupefy the game show contestants.
  - Casinos offer free alcoholic drinks to stupefy patrons to the point that they are unaware of time and money spent.
  - For a moment, it seemed as though the unusual medical condition would stupefy the inexperienced doctor.

* [[https://wordsinasentence.com/stupendous-in-a-sentence/][Stupendous]]

  =amazingly large=

  - The store did not expect a stupendous throng of customers to line up around the building.
  - Because the apartment fire was stupendous, four fire departments responded to the call.
  - A stupendous smile crossed my daughter’s face when she realized her birthday present was a new car.
  - When the singer saw the stupendous crowd at the front of the hotel, she insisted her driver take her to the back entrance.

* [[https://wordsinasentence.com/stupor-in-a-sentence/][Stupor]]

  =a condition in which it is difficult to think=

  - In his drunken stupor, Mitch was unable to locate his car in the parking lot.
  - The sedative was so strong it put Matt in a motionless stupor.
  - Because Kim uses cocaine, she is often in a drug-induced stupor.
  - Frank deals with the pain of his wife’s death by drinking himself into a stupor every night.
  - After being hit in the head with an iron skillet, the burglar sat in a stupor until the police arrived.
  - Jill was in a stupor for weeks when her husband died.
  - Because Bill was in a drunken stupor, he did not notice the boy stealing his wallet.

* [[https://wordsinasentence.com/sturdy-in-a-sentence/][Sturdy]]

  =durable and tough=

  - Kevin’s successful architectural plans were attributed to his sturdy table, steady hand and a creative brain.
  - While shopping at the antique store, I put my hand on the sturdy table and realized it stood in place.
  - Even a hurricane couldn’t knock down the old sturdy tree that had been planted in the center square for hundreds of years.
  - Without breaking through, the sturdy wooden box held the fifty pounds of books while being transported from one house to another.

* [[https://wordsinasentence.com/suavity-in-a-sentence/][Suavity]]

  =the quality of being sweet or pleasing to the mind=

  - His suavity and charm are what attracted many women.
  - The designers wanted the lounge’s suavity to be evident in their sophisticated stylings.
  - When they were introduced, the woman was astounded at the celebrity’s suavity and manners.
  - My sister warned me not to be dazzled the prince’s false suavity.

* [[https://wordsinasentence.com/sublimate-in-a-sentence/][Sublimate]]

  =to change an objectionable expression into one that is acceptable=

  - Rather than start an argument I chose to sublimate my anger by clenching my fists and walking away.
  - The artist is known for his ability to sublimate his anger into his paintings.
  - When Gail’s husband died, she tried to sublimate her grief by feeding the homeless.
  - Jack learned to sublimate his anger by taking boxing lessons.

* [[https://wordsinasentence.com/suborn-in-a-sentence/][Suborn]]

  =successfully influence a person to commit a crime or do something wrong=

  - Through her charm and evil ways, a greedy woman might suborn an innocent stranger to kill her husband in order to get her husband’s life insurance money.
  - Due to the teen’s testimony, this evidence proved in court that the young man did suborn the teenager into committing robbery on his behalf.
  - After the child was caught with the store’s unpaid clothing in her pocket, she became aware that her friend had suborn her into shoplifting.
  - Even though most people thought Mary Surratt was involved in Lincoln’s assassination, some believed that others had suborn her unknowingly into the conspiracy.

* [[https://wordsinasentence.com/subpoena-in-a-sentence/][Subpoena]]

  =a legal document requiring an individual to appear in court=

  - As soon as I received the subpoena, I knew I had to testify during the trial.
  - Will they arrest my sister if she ignores the court's subpoena and does not take the witness stand?
  - If you ignore the judge’s subpoena to appear in court, you will be arrested.
  - The subpoena will force the unwilling witness to give testimony.

* [[https://wordsinasentence.com/subsume-in-a-sentence/][Subsume]]

  =to include or absorb something or someone into a larger group=

  - Some think that Taiwan should fully subsume into China, but many of the Taiwanese are dead set on preserving their independence.
  - Many Native Americans were able to survive the takeover of the Europeans by being willing to subsume into white culture.
  - After years of being in a loveless marriage, the woman regretted her decision to subsume her own life into her husband’s.
  - Mary decided to subsume her own family tree project into a much larger one that her cousin is working on.



