ruby/S.html

<div id="outline-container-sec-221" class="outline-2">
<h2 id="sec-221"><span class="section-number-2">221</span> <a href="https://wordsinasentence.com/stultify-in-a-sentence/">Stultify</a></h2>
<div class="outline-text-2" id="text-221">
<p>
<code>to cripple or weaken; deprive of strength</code>
</p>

<ul class="org-ul">
<li>Eating pizza right before a workout will definitely work to stultify your efforts.
</li>
<li>A tranquilizer gun will effectively stultify even the most violent animals.
</li>
<li>If you accidentally drop your cell phone in water, you will effectively stultify it.
</li>
<li>By referencing actual statistics, he was able to stultify his opponent’s argument.
</li>
<li>A beautiful woman often holds the power to stultify even the most powerful man.
</li>
<li>Kryptonite is the only thing that will effectively stultify Superman.
</li>
<li>Mixing certain drugs may cause one to stultify the other, making it effectively worthless.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-222" class="outline-2">
<h2 id="sec-222"><span class="section-number-2">222</span> <a href="https://wordsinasentence.com/stunt-in-a-sentence/">Stunt</a></h2>
<div class="outline-text-2" id="text-222">
<p>
<code>a brave or clever act or deed</code>
</p>

<ul class="org-ul">
<li>After the acrobat completed her stunt at the Barnum and Bailey Circus, everyone in the crowd applauded loudly.
</li>
<li>Killer whales are required to do a stunt together during a show at Sea World in front of a live audience.
</li>
<li>Evel Knievel performed a stunt where he rode his motorcycle through a flaming circle before landing past ten cars.
</li>
<li>When the magician was able to conduct his stunt in front of a large audience, they clapped when he was successful in making the woman disappear.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-223" class="outline-2">
<h2 id="sec-223"><span class="section-number-2">223</span> <a href="https://wordsinasentence.com/stupefy-in-a-sentence/">Stupefy</a></h2>
<div class="outline-text-2" id="text-223">
<p>
<code>to astonish to the point that a person's thinking ability is decreased</code>
</p>

<ul class="org-ul">
<li>Seeing the naked woman was enough to stupefy the bus driver and cause him to drive off the road.
</li>
<li>Even my teacher did not know the answer to the trivia question that seemed to stupefy the game show contestants.
</li>
<li>Casinos offer free alcoholic drinks to stupefy patrons to the point that they are unaware of time and money spent.
</li>
<li>For a moment, it seemed as though the unusual medical condition would stupefy the inexperienced doctor.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-224" class="outline-2">
<h2 id="sec-224"><span class="section-number-2">224</span> <a href="https://wordsinasentence.com/stupendous-in-a-sentence/">Stupendous</a></h2>
<div class="outline-text-2" id="text-224">
<p>
<code>amazingly large</code>
</p>

<ul class="org-ul">
<li>The store did not expect a stupendous throng of customers to line up around the building.
</li>
<li>Because the apartment fire was stupendous, four fire departments responded to the call.
</li>
<li>A stupendous smile crossed my daughter’s face when she realized her birthday present was a new car.
</li>
<li>When the singer saw the stupendous crowd at the front of the hotel, she insisted her driver take her to the back entrance.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-225" class="outline-2">
<h2 id="sec-225"><span class="section-number-2">225</span> <a href="https://wordsinasentence.com/stupor-in-a-sentence/">Stupor</a></h2>
<div class="outline-text-2" id="text-225">
<p>
<code>a condition in which it is difficult to think</code>
</p>

<ul class="org-ul">
<li>In his drunken stupor, Mitch was unable to locate his car in the parking lot.
</li>
<li>The sedative was so strong it put Matt in a motionless stupor.
</li>
<li>Because Kim uses cocaine, she is often in a drug-induced stupor.
</li>
<li>Frank deals with the pain of his wife’s death by drinking himself into a stupor every night.
</li>
<li>After being hit in the head with an iron skillet, the burglar sat in a stupor until the police arrived.
</li>
<li>Jill was in a stupor for weeks when her husband died.
</li>
<li>Because Bill was in a drunken stupor, he did not notice the boy stealing his wallet.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-226" class="outline-2">
<h2 id="sec-226"><span class="section-number-2">226</span> <a href="https://wordsinasentence.com/sturdy-in-a-sentence/">Sturdy</a></h2>
<div class="outline-text-2" id="text-226">
<p>
<code>durable and tough</code>
</p>

<ul class="org-ul">
<li>Kevin’s successful architectural plans were attributed to his sturdy table, steady hand and a creative brain.
</li>
<li>While shopping at the antique store, I put my hand on the sturdy table and realized it stood in place.
</li>
<li>Even a hurricane couldn’t knock down the old sturdy tree that had been planted in the center square for hundreds of years.
</li>
<li>Without breaking through, the sturdy wooden box held the fifty pounds of books while being transported from one house to another.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-227" class="outline-2">
<h2 id="sec-227"><span class="section-number-2">227</span> <a href="https://wordsinasentence.com/suavity-in-a-sentence/">Suavity</a></h2>
<div class="outline-text-2" id="text-227">
<p>
<code>the quality of being sweet or pleasing to the mind</code>
</p>

<ul class="org-ul">
<li>His suavity and charm are what attracted many women.
</li>
<li>The designers wanted the lounge’s suavity to be evident in their sophisticated stylings.
</li>
<li>When they were introduced, the woman was astounded at the celebrity’s suavity and manners.
</li>
<li>My sister warned me not to be dazzled the prince’s false suavity.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-228" class="outline-2">
<h2 id="sec-228"><span class="section-number-2">228</span> <a href="https://wordsinasentence.com/sublimate-in-a-sentence/">Sublimate</a></h2>
<div class="outline-text-2" id="text-228">
<p>
<code>to change an objectionable expression into one that is acceptable</code>
</p>

<ul class="org-ul">
<li>Rather than start an argument I chose to sublimate my anger by clenching my fists and walking away.
</li>
<li>The artist is known for his ability to sublimate his anger into his paintings.
</li>
<li>When Gail’s husband died, she tried to sublimate her grief by feeding the homeless.
</li>
<li>Jack learned to sublimate his anger by taking boxing lessons.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-229" class="outline-2">
<h2 id="sec-229"><span class="section-number-2">229</span> <a href="https://wordsinasentence.com/suborn-in-a-sentence/">Suborn</a></h2>
<div class="outline-text-2" id="text-229">
<p>
<code>successfully influence a person to commit a crime or do something wrong</code>
</p>

<ul class="org-ul">
<li>Through her charm and evil ways, a greedy woman might suborn an innocent stranger to kill her husband in order to get her husband’s life insurance money.
</li>
<li>Due to the teen’s testimony, this evidence proved in court that the young man did suborn the teenager into committing robbery on his behalf.
</li>
<li>After the child was caught with the store’s unpaid clothing in her pocket, she became aware that her friend had suborn her into shoplifting.
</li>
<li>Even though most people thought Mary Surratt was involved in Lincoln’s assassination, some believed that others had suborn her unknowingly into the conspiracy.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-230" class="outline-2">
<h2 id="sec-230"><span class="section-number-2">230</span> <a href="https://wordsinasentence.com/subpoena-in-a-sentence/">Subpoena</a></h2>
<div class="outline-text-2" id="text-230">
<p>
<code>a legal document requiring an individual to appear in court</code>
</p>

<ul class="org-ul">
<li>As soon as I received the subpoena, I knew I had to testify during the trial.
</li>
<li>Will they arrest my sister if she ignores the court's subpoena and does not take the witness stand?
</li>
<li>If you ignore the judge’s subpoena to appear in court, you will be arrested.
</li>
<li>The subpoena will force the unwilling witness to give testimony.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-231" class="outline-2">
<h2 id="sec-231"><span class="section-number-2">231</span> <a href="https://wordsinasentence.com/subsume-in-a-sentence/">Subsume</a></h2>
<div class="outline-text-2" id="text-231">
<p>
<code>to include or absorb something or someone into a larger group</code>
</p>

<ul class="org-ul">
<li>Some think that Taiwan should fully subsume into China, but many of the Taiwanese are dead set on preserving their independence.
</li>
<li>Many Native Americans were able to survive the takeover of the Europeans by being willing to subsume into white culture.
</li>
<li>After years of being in a loveless marriage, the woman regretted her decision to subsume her own life into her husband’s.
</li>
<li>Mary decided to subsume her own family tree project into a much larger one that her cousin is working on.
</li>
</ul>
</div>
</div>
