ruby/S.org
* [[https://wordsinasentence.com/subterfuge-in-a-sentence/][Subterfuge]]

  =trickery or deceit used to manipulate or achieve one’s goals=

  - Pinocchio’s lies and subterfuge caused his nose to grow longer and longer.
  - The prisoners resorted to subterfuge, tricking the guards into letting them out of their cells.
  - Full of trickery, the sly foxed used his subterfuge to sneak his way into the chicken coop.
  - Subterfuge led by the deceitful media caused everyday people to be confused.
  - If you don't want to be involved with the subterfuge, tell the truth.
  - Done with the subterfuge, Kevin is going to come clean about his drug addiction.
  - Teachers who rig tests are playing a role in the ever-growing subterfuge in the classroom.

* [[https://wordsinasentence.com/sullen-in-a-sentence/][Sullen]]

  =bad tempered and gloomy=

  - The sullen criminal refused to follow the police officer’s instructions.
  - When my toddler is sullen, he can usually be cheered by music.
  - After being dumped by her boyfriend, Ellen was sullen for days.
  - My attempts to talk to my angry son were met by his sullen silence.
  - Everyone smiled when the clown made the sullen child laugh.
  - In the dark room, John became sullen and withdrawn.
  - Often Amy’s sullen personality and short temper will get her into trouble at school.

* [[https://wordsinasentence.com/sunder-in-a-sentence/][Sunder]]

  =split apart=

  - The lumberjack will sunder the wood into pieces after he cuts the trees down.
  - Sunder the loose leaf paper into several pieces to distribute among the members of the group.
  - We can sever and sunder the timber to use some of it for shelves on each side of the bed.
  - The orthopedic surgeon said that the fragmented sunder of the bone made the healing process difficult.

* [[https://wordsinasentence.com/sundry-in-a-sentence/][Sundry]]

  =a group of unrelated things=

  - Because I was unsure of the San Francisco weather, I packed a sundry of clothing items to wear.
  - The store at the summer camp facility will carry a number of sundry items just in case you forget something from home.
  - Although the police department was accused of a variety of sundry charges, there was not sufficient evidence to bring a case against any of the officers.
  - My grandmother decided to open a sundry store where people could buy an assortment of goods.
  -  The woman’s purse held a huge quantity of sundry bits and pieces.
  - When the business owner looked out his window, he saw a sundry lot of people holding picket signs outside of his building.
  - Helen was surprised at how popular the sundry menu was at her international restaurant.

* [[https://wordsinasentence.com/supererogatory-in-a-sentence/][Supererogatory]]

  =actions that are considered good but are not strictly necessary=

  - A supererogatory act includes extra credit work in class.
  - The medic was a supererogatory hero for running back onto the battlefield to save soldiers after being ordered to withdraw.
  - My supererogatory teacher went out of her way to print review sheets for all of us.
  - The Medal of Honor is rarely awarded to someone that did not engage in supererogatory bravery.

* [[https://wordsinasentence.com/superimpose-in-a-sentence/][Superimpose]]

  =to put one image over another image so both are seen=

  - When the graphic artist makes the ad, he will superimpose the company logo over the product’s image so both objects are visible.
  - The software program makes it possible for users to superimpose their pictures into various scenes.
  - If Bill is not careful, he will superimpose too many layers on the image and make it difficult for viewers to clearly see the icon.
  - Since Riley continues to superimpose cruel comments on my online photos, my mother is going to call his parents.

* [[https://wordsinasentence.com/superlative-in-a-sentence/][Superlative]]

  =exceptionally good; excellent=

  - She was a superlative student, getting nearly perfect grades on every assignment.
  - The old sage had superlative wisdom, making him the go-to man for advice of all kinds.
  - The winner of the Nobel Peace Prize must be a superlative person.
  - Though his girlfriend had superlative grammar, her lack of social etiquette made her an embarrassment in social interactions.
  - Being diagnosed with cancer, the man looked to find a doctor with a superlative record.
  - He walked with a superlative flair, causing everyone to turn their heads as he passed by.
  - With her experience in the field, she would be a superlative fit for the job.

* [[https://wordsinasentence.com/supervise-in-a-sentence/][Supervise]]

  =to watch and oversee=

  - Each Sunday school teacher should supervise their class’s craft to ensure that it’s completed in time.
  - Her husband felt the need to supervise her as she assembled the bookshelf for their son’s room.
  - As the leader, Mr. Baker will supervise the charity dragon boat races on the bayou this Saturday.
  - Especially careful since the installment of the new pool, he was sure to actively supervise the baby.

* [[https://wordsinasentence.com/supplicate-in-a-sentence/][Supplicate]]

  =to humbly plead for something=

  - The homeless man was not too prideful to supplicate for change to buy food.
  - Knowing I could not turn my paper in on time, I went to my professor to supplicate for an extension of the deadline.
  - In his closing argument, the attorney will supplicate for his client’s freedom.
  - Because Marcus is full of pride, he will never supplicate for financial assistance.
  - The killer’s family came to court to supplicate for leniency for their loved one.
  - Even though Jason has horrible grades, he still has the nerve to supplicate for a new car from his parents.
  - The orphanage will hold a telethon to supplicate for much-needed donations.

* [[https://wordsinasentence.com/surfeit-in-a-sentence/][Surfeit]]

  =an overabundant supply=

  - We had such a surfeit of food during the holidays that we gave a large portion of it to the family across the street.
  - When the store manager accidently ordered a surfeit of pencils and pens, he was unable to sell the extra items and decided to donate them to a local school.
  - Janet made use of the surfeit of holiday lights by decorating all the trees in her front yard.
  - If you need additional towels, you will find a surfeit of them in the hall closet.
  - The aid workers were not prepared for the surfeit of calls that came in after the hurricane.
  - Because Katie ate a surfeit of candy bars, she now has a tummy ache.
  - The charity would like to collect a surfeit of clothing to distribute to the homeless.

