ruby/S.html



<div id="outline-container-sec-232" class="outline-2">
<h2 id="sec-232"><span class="section-number-2">232</span> <a href="https://wordsinasentence.com/subterfuge-in-a-sentence/">Subterfuge</a></h2>
<div class="outline-text-2" id="text-232">
<p>
<code>trickery or deceit used to manipulate or achieve one’s goals</code>
</p>

<ul class="org-ul">
<li>Pinocchio’s lies and subterfuge caused his nose to grow longer and longer.
</li>
<li>The prisoners resorted to subterfuge, tricking the guards into letting them out of their cells.
</li>
<li>Full of trickery, the sly foxed used his subterfuge to sneak his way into the chicken coop.
</li>
<li>Subterfuge led by the deceitful media caused everyday people to be confused.
</li>
<li>If you don't want to be involved with the subterfuge, tell the truth.
</li>
<li>Done with the subterfuge, Kevin is going to come clean about his drug addiction.
</li>
<li>Teachers who rig tests are playing a role in the ever-growing subterfuge in the classroom.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-233" class="outline-2">
<h2 id="sec-233"><span class="section-number-2">233</span> <a href="https://wordsinasentence.com/sullen-in-a-sentence/">Sullen</a></h2>
<div class="outline-text-2" id="text-233">
<p>
<code>bad tempered and gloomy</code>
</p>

<ul class="org-ul">
<li>The sullen criminal refused to follow the police officer’s instructions.
</li>
<li>When my toddler is sullen, he can usually be cheered by music.
</li>
<li>After being dumped by her boyfriend, Ellen was sullen for days.
</li>
<li>My attempts to talk to my angry son were met by his sullen silence.
</li>
<li>Everyone smiled when the clown made the sullen child laugh.
</li>
<li>In the dark room, John became sullen and withdrawn.
</li>
<li>Often Amy’s sullen personality and short temper will get her into trouble at school.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-234" class="outline-2">
<h2 id="sec-234"><span class="section-number-2">234</span> <a href="https://wordsinasentence.com/sunder-in-a-sentence/">Sunder</a></h2>
<div class="outline-text-2" id="text-234">
<p>
<code>split apart</code>
</p>

<ul class="org-ul">
<li>The lumberjack will sunder the wood into pieces after he cuts the trees down.
</li>
<li>Sunder the loose leaf paper into several pieces to distribute among the members of the group.
</li>
<li>We can sever and sunder the timber to use some of it for shelves on each side of the bed.
</li>
<li>The orthopedic surgeon said that the fragmented sunder of the bone made the healing process difficult.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-235" class="outline-2">
<h2 id="sec-235"><span class="section-number-2">235</span> <a href="https://wordsinasentence.com/sundry-in-a-sentence/">Sundry</a></h2>
<div class="outline-text-2" id="text-235">
<p>
<code>a group of unrelated things</code>
</p>

<ul class="org-ul">
<li>Because I was unsure of the San Francisco weather, I packed a sundry of clothing items to wear.
</li>
<li>The store at the summer camp facility will carry a number of sundry items just in case you forget something from home.
</li>
<li>Although the police department was accused of a variety of sundry charges, there was not sufficient evidence to bring a case against any of the officers.
</li>
<li>My grandmother decided to open a sundry store where people could buy an assortment of goods.
</li>
<li>The woman’s purse held a huge quantity of sundry bits and pieces.
</li>
<li>When the business owner looked out his window, he saw a sundry lot of people holding picket signs outside of his building.
</li>
<li>Helen was surprised at how popular the sundry menu was at her international restaurant.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-236" class="outline-2">
<h2 id="sec-236"><span class="section-number-2">236</span> <a href="https://wordsinasentence.com/supererogatory-in-a-sentence/">Supererogatory</a></h2>
<div class="outline-text-2" id="text-236">
<p>
<code>actions that are considered good but are not strictly necessary</code>
</p>

<ul class="org-ul">
<li>A supererogatory act includes extra credit work in class.
</li>
<li>The medic was a supererogatory hero for running back onto the battlefield to save soldiers after being ordered to withdraw.
</li>
<li>My supererogatory teacher went out of her way to print review sheets for all of us.
</li>
<li>The Medal of Honor is rarely awarded to someone that did not engage in supererogatory bravery.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-237" class="outline-2">
<h2 id="sec-237"><span class="section-number-2">237</span> <a href="https://wordsinasentence.com/superimpose-in-a-sentence/">Superimpose</a></h2>
<div class="outline-text-2" id="text-237">
<p>
<code>to put one image over another image so both are seen</code>
</p>

<ul class="org-ul">
<li>When the graphic artist makes the ad, he will superimpose the company logo over the product’s image so both objects are visible.
</li>
<li>The software program makes it possible for users to superimpose their pictures into various scenes.
</li>
<li>If Bill is not careful, he will superimpose too many layers on the image and make it difficult for viewers to clearly see the icon.
</li>
<li>Since Riley continues to superimpose cruel comments on my online photos, my mother is going to call his parents.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-238" class="outline-2">
<h2 id="sec-238"><span class="section-number-2">238</span> <a href="https://wordsinasentence.com/superlative-in-a-sentence/">Superlative</a></h2>
<div class="outline-text-2" id="text-238">
<p>
<code>exceptionally good; excellent</code>
</p>

<ul class="org-ul">
<li>She was a superlative student, getting nearly perfect grades on every assignment.
</li>
<li>The old sage had superlative wisdom, making him the go-to man for advice of all kinds.
</li>
<li>The winner of the Nobel Peace Prize must be a superlative person.
</li>
<li>Though his girlfriend had superlative grammar, her lack of social etiquette made her an embarrassment in social interactions.
</li>
<li>Being diagnosed with cancer, the man looked to find a doctor with a superlative record.
</li>
<li>He walked with a superlative flair, causing everyone to turn their heads as he passed by.
</li>
<li>With her experience in the field, she would be a superlative fit for the job.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-239" class="outline-2">
<h2 id="sec-239"><span class="section-number-2">239</span> <a href="https://wordsinasentence.com/supervise-in-a-sentence/">Supervise</a></h2>
<div class="outline-text-2" id="text-239">
<p>
<code>to watch and oversee</code>
</p>

<ul class="org-ul">
<li>Each Sunday school teacher should supervise their class’s craft to ensure that it’s completed in time.
</li>
<li>Her husband felt the need to supervise her as she assembled the bookshelf for their son’s room.
</li>
<li>As the leader, Mr. Baker will supervise the charity dragon boat races on the bayou this Saturday.
</li>
<li>Especially careful since the installment of the new pool, he was sure to actively supervise the baby.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-240" class="outline-2">
<h2 id="sec-240"><span class="section-number-2">240</span> <a href="https://wordsinasentence.com/supplicate-in-a-sentence/">Supplicate</a></h2>
<div class="outline-text-2" id="text-240">
<p>
<code>to humbly plead for something</code>
</p>

<ul class="org-ul">
<li>The homeless man was not too prideful to supplicate for change to buy food.
</li>
<li>Knowing I could not turn my paper in on time, I went to my professor to supplicate for an extension of the deadline.
</li>
<li>In his closing argument, the attorney will supplicate for his client’s freedom.
</li>
<li>Because Marcus is full of pride, he will never supplicate for financial assistance.
</li>
<li>The killer’s family came to court to supplicate for leniency for their loved one.
</li>
<li>Even though Jason has horrible grades, he still has the nerve to supplicate for a new car from his parents.
</li>
<li>The orphanage will hold a telethon to supplicate for much-needed donations.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-241" class="outline-2">
<h2 id="sec-241"><span class="section-number-2">241</span> <a href="https://wordsinasentence.com/surfeit-in-a-sentence/">Surfeit</a></h2>
<div class="outline-text-2" id="text-241">
<p>
<code>an overabundant supply</code>
</p>

<ul class="org-ul">
<li>We had such a surfeit of food during the holidays that we gave a large portion of it to the family across the street.
</li>
<li>When the store manager accidently ordered a surfeit of pencils and pens, he was unable to sell the extra items and decided to donate them to a local school.
</li>
<li>Janet made use of the surfeit of holiday lights by decorating all the trees in her front yard.
</li>
<li>If you need additional towels, you will find a surfeit of them in the hall closet.
</li>
<li>The aid workers were not prepared for the surfeit of calls that came in after the hurricane.
</li>
<li>Because Katie ate a surfeit of candy bars, she now has a tummy ache.
</li>
<li>The charity would like to collect a surfeit of clothing to distribute to the homeless.
</li>
</ul>
</div>
</div>
