ruby/S.org
* [[https://wordsinasentence.com/svelte-in-a-sentence/][Svelte]]

  =slenderly graceful=

  - The svelte model made her way across the runway with a graceful flare.
  - After losing weight, the dancer appeared much more svelte and slender when moving.
  - Because of his svelte physique, the slender runner was able to run swiftly down the track.
  - The artists drew svelte lines down the canvas, creating slender figures throughout.

* [[https://wordsinasentence.com/swagger-in-a-sentence/][Swagger]]

  =a confident and usually arrogant attitude=

  - Someone who is full of themselves walks around with swagger.
  - If you walk with swagger you are probably confident in yourself.
  - Most arrogant people talk and move with swagger because of how great they think they are.
  - Someone with too much swagger definitely doesn’t have any self-esteem issues.

* [[https://wordsinasentence.com/swank-in-a-sentence/][Swank]]

  =showy and posh=

  - She was showing off her new diamond engagement ring by flaunting it with arrogant swank.
  - The model is very swank and fashionably elegant, but she can seem conceited and vain at times.
  - With the impression that his money makes him superior, he carries himself with swank and swagger.
  - The luxurious pair of shoes was very posh and swank, but they are too expensive for my budget.

* [[https://wordsinasentence.com/swarthy-in-a-sentence/][Swarthy]]

  =having a dark skin color or complexion=

  - After the man had been stranded on the deserted island for nearly a year, his skin had become quite swarthy as a result of the sun’s heat.
  - It was the first time the people in the all-white kingdom had seen anyone as swarthy as the African king.
  - To the first American settlers, the native residents appeared swarthy in complexion.
  - Shawna looked incredibly pale standing next to the swarthy islander.

* [[https://wordsinasentence.com/swathe-in-a-sentence/][Swathe]]

  =a bandage; a band=

  - Wrapping the swathe around the wound, the good samaritan hoped that the bandage would hold until helped arrived.
  - Placing a swathe around each bundle, the manufacturer took great pride in making sure the products were properly secured before shipping.
  - Without a swathe to hold her still, the infant was unable to sleep soundly and tossed back and forth.
  - Placing the swathe of velvet around her middle, the designer trusted that taking this risk would make her creation stand out from her rival’s design.

* [[https://wordsinasentence.com/sway-in-a-sentence/][Sway]]

  =control or dominion=

  - Africa was under Britain’s sway for several decades during colonial times.
  - Grunts in the military are under the sway of their commander.
  - The CEO of a company holds sway over all of his employees.
  - Many countries have held sway over others through occupation.

* [[https://wordsinasentence.com/swelter-in-a-sentence/][Swelter]]

  =to suffer terribly from intense heat=

  - The beachgoers began to swelter in the afternoon sun.
  - Without air conditioning, the family was forced to swelter in their hot house.
  - The more the construction worker spent time in the sun, the more he would swelter beneath it.
  - The woman packed light and airy clothing so as not to swelter on her Caribbean vacation.

* [[https://wordsinasentence.com/swerve-in-a-sentence/][Swerve]]

  =to change direction very suddenly=

  - To avoid hitting the squirrel on the road, the car had to swerve to the left.
  - You might have to swerve on your bike if something too big is in the way on the street.
  - Many skaters have to swerve to avoid pedestrians on the sidewalks.
  - The two planes that were flying at each other had to swerve at the last second during the air show.

* [[https://wordsinasentence.com/swindle-in-a-sentence/][Swindle]]

  =to deceive someone in order to take wealth from them=

  - The con man makes his money with scams that swindle people out of their money.
  - Scams on the internet are designed to swindle people and trick them into paying scammers money.
  - You have to be careful when buying products on the internet, as some sellers may try to swindle you into paying more money than the product is worth.
  - Some people pretend to be homeless or in trouble so they can swindle kind-hearted people out of their money.

* [[https://wordsinasentence.com/swoop-in-a-sentence/][Swoop]]

  =to rapidly dive downwards in the air=

  - The falcon likes to swoop down on its prey from above to catch them off guard.
  - A fighter jet might swoop down into a cloud to throw off an enemy.
  - It’s probably bad if an airliner begins to swoop down out of the sky.
  - You cannot swoop with a helicopter because a helicopter cannot dive.

* [[https://wordsinasentence.com/sybaritic-in-a-sentence/][Sybaritic]]

  =indulgent; luxurious=

  - The sybaritic prince spared no expense, always splurging on luxurious things like camels and jewels.
  - Though most of her family thought she was overly sybaritic, the luxury-loving heiress saw nothing wrong with living the high life.
  - Out of all of the subarctic places I’ve visited, I had the most lavish experiences in Dubai.
  - The sybaritic teen was robbed outside his home after flashing his jewels and fine cars all over Facebook.

* [[https://wordsinasentence.com/synopsis-in-a-sentence/][Synopsis]]

  =a short summary of a longer work=

  - My teacher said my five-page digest of the book was entirely too long to be a synopsis.
  - As per the teacher’s instructions, the synopsis of the film should not be more than two paragraphs long.
  - The movie synopsis summed up the plot of the film in a single paragraph.
  - Before I write the synopsis of the novel, I need to read the book to ensure I can write a brief review of the story.




* :)
#+HTML: <a id="bottom"/>
#+HTML: <a href="#top">top</a>