ruby/S.html

<div id="outline-container-sec-242" class="outline-2">
<h2 id="sec-242"><span class="section-number-2">242</span> <a href="https://wordsinasentence.com/svelte-in-a-sentence/">Svelte</a></h2>
<div class="outline-text-2" id="text-242">
<p>
<code>slenderly graceful</code>
</p>

<ul class="org-ul">
<li>The svelte model made her way across the runway with a graceful flare.
</li>
<li>After losing weight, the dancer appeared much more svelte and slender when moving.
</li>
<li>Because of his svelte physique, the slender runner was able to run swiftly down the track.
</li>
<li>The artists drew svelte lines down the canvas, creating slender figures throughout.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-243" class="outline-2">
<h2 id="sec-243"><span class="section-number-2">243</span> <a href="https://wordsinasentence.com/swagger-in-a-sentence/">Swagger</a></h2>
<div class="outline-text-2" id="text-243">
<p>
<code>a confident and usually arrogant attitude</code>
</p>

<ul class="org-ul">
<li>Someone who is full of themselves walks around with swagger.
</li>
<li>If you walk with swagger you are probably confident in yourself.
</li>
<li>Most arrogant people talk and move with swagger because of how great they think they are.
</li>
<li>Someone with too much swagger definitely doesn’t have any self-esteem issues.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-244" class="outline-2">
<h2 id="sec-244"><span class="section-number-2">244</span> <a href="https://wordsinasentence.com/swank-in-a-sentence/">Swank</a></h2>
<div class="outline-text-2" id="text-244">
<p>
<code>showy and posh</code>
</p>

<ul class="org-ul">
<li>She was showing off her new diamond engagement ring by flaunting it with arrogant swank.
</li>
<li>The model is very swank and fashionably elegant, but she can seem conceited and vain at times.
</li>
<li>With the impression that his money makes him superior, he carries himself with swank and swagger.
</li>
<li>The luxurious pair of shoes was very posh and swank, but they are too expensive for my budget.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-245" class="outline-2">
<h2 id="sec-245"><span class="section-number-2">245</span> <a href="https://wordsinasentence.com/swarthy-in-a-sentence/">Swarthy</a></h2>
<div class="outline-text-2" id="text-245">
<p>
<code>having a dark skin color or complexion</code>
</p>

<ul class="org-ul">
<li>After the man had been stranded on the deserted island for nearly a year, his skin had become quite swarthy as a result of the sun’s heat.
</li>
<li>It was the first time the people in the all-white kingdom had seen anyone as swarthy as the African king.
</li>
<li>To the first American settlers, the native residents appeared swarthy in complexion.
</li>
<li>Shawna looked incredibly pale standing next to the swarthy islander.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-246" class="outline-2">
<h2 id="sec-246"><span class="section-number-2">246</span> <a href="https://wordsinasentence.com/swathe-in-a-sentence/">Swathe</a></h2>
<div class="outline-text-2" id="text-246">
<p>
<code>a bandage; a band</code>
</p>

<ul class="org-ul">
<li>Wrapping the swathe around the wound, the good samaritan hoped that the bandage would hold until helped arrived.
</li>
<li>Placing a swathe around each bundle, the manufacturer took great pride in making sure the products were properly secured before shipping.
</li>
<li>Without a swathe to hold her still, the infant was unable to sleep soundly and tossed back and forth.
</li>
<li>Placing the swathe of velvet around her middle, the designer trusted that taking this risk would make her creation stand out from her rival’s design.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-247" class="outline-2">
<h2 id="sec-247"><span class="section-number-2">247</span> <a href="https://wordsinasentence.com/sway-in-a-sentence/">Sway</a></h2>
<div class="outline-text-2" id="text-247">
<p>
<code>control or dominion</code>
</p>

<ul class="org-ul">
<li>Africa was under Britain’s sway for several decades during colonial times.
</li>
<li>Grunts in the military are under the sway of their commander.
</li>
<li>The CEO of a company holds sway over all of his employees.
</li>
<li>Many countries have held sway over others through occupation.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-248" class="outline-2">
<h2 id="sec-248"><span class="section-number-2">248</span> <a href="https://wordsinasentence.com/swelter-in-a-sentence/">Swelter</a></h2>
<div class="outline-text-2" id="text-248">
<p>
<code>to suffer terribly from intense heat</code>
</p>

<ul class="org-ul">
<li>The beachgoers began to swelter in the afternoon sun.
</li>
<li>Without air conditioning, the family was forced to swelter in their hot house.
</li>
<li>The more the construction worker spent time in the sun, the more he would swelter beneath it.
</li>
<li>The woman packed light and airy clothing so as not to swelter on her Caribbean vacation.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-249" class="outline-2">
<h2 id="sec-249"><span class="section-number-2">249</span> <a href="https://wordsinasentence.com/swerve-in-a-sentence/">Swerve</a></h2>
<div class="outline-text-2" id="text-249">
<p>
<code>to change direction very suddenly</code>
</p>

<ul class="org-ul">
<li>To avoid hitting the squirrel on the road, the car had to swerve to the left.
</li>
<li>You might have to swerve on your bike if something too big is in the way on the street.
</li>
<li>Many skaters have to swerve to avoid pedestrians on the sidewalks.
</li>
<li>The two planes that were flying at each other had to swerve at the last second during the air show.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-250" class="outline-2">
<h2 id="sec-250"><span class="section-number-2">250</span> <a href="https://wordsinasentence.com/swindle-in-a-sentence/">Swindle</a></h2>
<div class="outline-text-2" id="text-250">
<p>
<code>to deceive someone in order to take wealth from them</code>
</p>

<ul class="org-ul">
<li>The con man makes his money with scams that swindle people out of their money.
</li>
<li>Scams on the internet are designed to swindle people and trick them into paying scammers money.
</li>
<li>You have to be careful when buying products on the internet, as some sellers may try to swindle you into paying more money than the product is worth.
</li>
<li>Some people pretend to be homeless or in trouble so they can swindle kind-hearted people out of their money.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-251" class="outline-2">
<h2 id="sec-251"><span class="section-number-2">251</span> <a href="https://wordsinasentence.com/swoop-in-a-sentence/">Swoop</a></h2>
<div class="outline-text-2" id="text-251">
<p>
<code>to rapidly dive downwards in the air</code>
</p>

<ul class="org-ul">
<li>The falcon likes to swoop down on its prey from above to catch them off guard.
</li>
<li>A fighter jet might swoop down into a cloud to throw off an enemy.
</li>
<li>It’s probably bad if an airliner begins to swoop down out of the sky.
</li>
<li>You cannot swoop with a helicopter because a helicopter cannot dive.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-252" class="outline-2">
<h2 id="sec-252"><span class="section-number-2">252</span> <a href="https://wordsinasentence.com/sybaritic-in-a-sentence/">Sybaritic</a></h2>
<div class="outline-text-2" id="text-252">
<p>
<code>indulgent; luxurious</code>
</p>

<ul class="org-ul">
<li>The sybaritic prince spared no expense, always splurging on luxurious things like camels and jewels.
</li>
<li>Though most of her family thought she was overly sybaritic, the luxury-loving heiress saw nothing wrong with living the high life.
</li>
<li>Out of all of the subarctic places I’ve visited, I had the most lavish experiences in Dubai.
</li>
<li>The sybaritic teen was robbed outside his home after flashing his jewels and fine cars all over Facebook.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-253" class="outline-2">
<h2 id="sec-253"><span class="section-number-2">253</span> <a href="https://wordsinasentence.com/synopsis-in-a-sentence/">Synopsis</a></h2>
<div class="outline-text-2" id="text-253">
<p>
<code>a short summary of a longer work</code>
</p>

<ul class="org-ul">
<li>My teacher said my five-page digest of the book was entirely too long to be a synopsis.
</li>
<li>As per the teacher’s instructions, the synopsis of the film should not be more than two paragraphs long.
</li>
<li>The movie synopsis summed up the plot of the film in a single paragraph.
</li>
<li>Before I write the synopsis of the novel, I need to read the book to ensure I can write a brief review of the story.
</li>
</ul>




<a id="bottom"/>
<a href="#top">⇧</a>
</div>
</div>
</div>
</body>
</html>